{
    "Heading.DataSharing": "Data Sharing",
    "Description.DataSharing1": "Contribute your data to the creation and improvement of better tools that benefit the Roblox community.",
    "Description.DataSharing2": "We value your creativity and creations, and appreciate your support. Manage your data sharing preferences below by choosing what information you want to share, and by modifying the default settings when publishing.",
    "Label.ExperiencePreference": "Make sharing data the default when saving and publishing Experiences",
    "Label.BundlePreference": "Make sharing data the default when publishing Avatar Items",
    "Label.ProductPreference": "Make sharing data the default when publishing paid Creator Store Items (excluding plugins)",
    "Description.Experiences": "Our goal is to make Roblox the best place for creating engaging experiences with the help of AI. Contribute your experience (Rbxl file) with us to help us build and improve our AI-based tools such as Assistant and Code Assist.",
    "Description.Bundles": "Our goal is to provide amazing AI-powered tools to help accelerate avatar and NPC creation. Contribute your Avatars to help us build and improve AI tools that can aid your creation process.",
    "Description.Products": "Your free model, mesh, and image data available publicly on the Creator Store are used to power Roblox's development of creation tools that accelerate development for our community. Contribute your paid model data to AI training to help create even more powerful systems to help you in your workstreams.",
    "Description.PublicLuau": "Our goal is to make Luau a first-class programming language and ensure that existing and future AI tools understand Luau. Only a fraction of your contributed code (<30%), will be compiled and aggregated into an open source-available data set for training of AI models.",
    "Tab.Experiences": "Experiences",
    "Tab.Bundles": "Avatar Items",
    "Tab.Products": "Creator Store Items",
    "Tab.PublicLuau": "Public Luau",
    "Action.Search": "Search by keyword",
    "Label.DynamicHeads": "Dynamic Heads",
    "Label.Bodies": "Bodies",
    "Label.Models": "Models",
    "Action.LearnMore": "Learn More",
    "Action.SelectCreator": "Select Creator",
    "Action.Cancel": "Cancel",
    "Action.Save": "Save Changes",
    "Column.Name": "Name",
    "Column.LastUpdatedDate": "Last updated date",
    "Column.CreatedDate": "Created date",
    "Column.Playability": "Playability",
    "Column.Price": "Price",
    "Label.Private": "Private",
    "Label.Public": "Public",
    "Message.DataSharingSuccess": "Data sharing settings saved!",
    "Message.DataSharingError": "Data sharing settings could not be saved. Try again later.",
    "Messsage.LoadError": "Data sharing settings could not be loaded. Try again later.",
    "Header.ExperiencesEmpty": "Create an experience",
    "Message.ExperiencesEmpty": "Design and build a virtual experience using Roblox Studio, our all-in-one game engine. {linkStart}Learn more{linkEnd}",
    "Header.BundlesEmpty": "Add avatar items",
    "Message.BundlesEmpty": "Publish and sell avatar items. {linkStart}Learn more{linkEnd}",
    "Header.ProductsEmpty": "Create Creator Store Assets",
    "Message.ProductsEmpty": "Publish and sell models ({linkStart}coming soon{linkEnd})",
    "Action.Continue": "Continue",
    "Header.ConfirmationModal": "You are about to update your data contributions",
    "Message.ConfirmationContinue": "After clicking Continue:",
    "Message.ConfirmationUnshared": "You will be un-sharing {itemsStart}{itemsEnd}",
    "Message.ConfirmationShared": "You will start sharing {itemsStart}{itemsEnd}",
    "Message.ConfirmationModal1": "We appreciate your contributions, community data makes it possible to train our models on Roblox specific content so we can offer you AI-based tools customized to your workflow.",
    "Message.ConfirmationModal2": "Note: Your newly unshared content will be removed from the raw dataset within 30 days, and the change will be applied in our next AI model, which we will refresh at least once a year. Please note that opting out of the Luau public dataset is not possible after 30 days, as it will then be publicly accessible.",
    "Label.SelectAll": "Select All",
    "Message.Ineligible": "You need to be over 13 years old to share the data of your creations.",
    "Column.Status": "Shared status",
    "Message.SharedStatus": "Shared",
    "Message.UnsharedStatus": "Unshared",
    "Description.Products2": "Your free model, mesh, and image data available publicly on the Creator Store are used to power Roblox's development of creation tools that accelerate development for our community. Contribute your paid model data ({linkStart}coming soon{linkEnd}) to AI training to help create even more powerful systems to help you in your workstreams."
}