{
    "Label.Public": "Contribute to the public Luau Dataset",
    "Heading.EmpowerCreators": "Empower Luau creation",
    "Description.EmpowerCreators": "Let's elevate Luau to a premier programming language. Contribute your scripts for AI training, enjoy enhanced Luau-focused AI tools, and control which experiences you share.",
    "Label.RobloxOnly": "Share with Roblox",
    "Description.RobloxOnly": "Contribute your scripts to enhance Roblox AI and get early access to the community-trained model. Opt out anytime",
    "Label.Disclaimer": "By opting-in, you confirm that you agree to the applicable terms for {link1Start}sharing with Roblox{link1End} and {link2Start}contributing to the public Luau data set{link2End}. If you do not agree, you may not opt-in.",
    "Description.Public": "Contribute code snippets to elevate Luau as a premier programming language and help all AI models speak Luau.",
    "Action.GetStarted": "Get Started",
    "Label.FindOutMore": "Learn more",
    "Heading.RobloxOnly": "Share with Roblox",
    "Heading.CommunityNeed": "Why do we want scripts from our community for our AI models?",
    "Description.CommunityNeed": "Roblox is building its own AI models to make AI-powered creation tools. Today, we use code from a subset of free, publicly available-marketplace assets to train these models. Using additional data contributed by our community helps our AI offer you accurate and up-to-date suggestions.",
    "Heading.Contribute": "How can I contribute to the public Luau data set?",
    "Description.RobloxContribution1": "To help improve Roblox tools with AI, you can opt-in to select the experiences to share.",
    "Description.RobloxContribution2": "{headingStart}You are in control:{headingEnd} You can opt-out anytime from your {linkStart}Account Settings{linkEnd}. No data will be used for training models until one week after you opt-in. Upon your opt-out, we will not use your data for any new training beyond 30 days. However, we reserve the right to keep the existing models trained on your data active for up to 120 days.",
    "Description.RobloxContribution3": "{headingStart}From and for the community:{headingEnd} We respect your privacy. Data is collected anonymously, and we will filter out any sensitive data, such as your API keys.",
    "Description.RobloxContribution4": "{headingStart}We respect your privacy:{headingEnd} Data is collected anonymously, and we will filter out any sensitive data, such as your API keys.",
    "Description.RobloxContribution5": "{headingStart}Owner-governed sharing:{headingEnd}  Group-owned experiences can only be shared by owners. For experiences that have multiple owners, sharing with Roblox or the wider public is only possible if all owners opt-in.",
    "Heading.OptInIncentive": "Can I still use Roblox AI tools if I don’t opt-in?",
    "Description.OptInIncentive": "Everyone can use our AI products like Code Assist. Those who share their data with our AI models will get access to more comprehensive and performant models that include community contributions.",
    "Heading.DataRequired": "If I opt-in to share my data, does this only include scripts? What about other types of data, like my models or images?",
    "Description.DataRequired": "Opting into sharing your data with Roblox and Luau currently only includes scripts. In the future, if we decide to add other data types, you will still have to opt-in to sharing these types, and we won’t automatically include your data without your opt-in.",
    "Heading.Public": "Contribute to the Luau Dataset",
    "Heading.PublicExplanation": "What does contributing to the Luau Dataset mean?",
    "Description.PublicExplanation1": "Roblox is building a public Luau Dataset for training AI models.",
    "Description.PublicExplanation2": "Our goal is to make Luau a first-class programming language and ensure that existing and future AI tools understand Luau.",
    "Description.PublicExplanation3": "{headingStart}AI tools support for Luau:{headingEnd} This means more accurate suggestions and more integrations when using 3rd party AI models, so creators like you can use their tool of choice in their creation process.",
    "Heading.PublicContribution": "How can I contribute to the Luau Dataset?",
    "Description.PublicContribution1": "Much like contributing to Roblox, privacy and compliance are our top priorities. Experiences won’t be shared unless all owners consent.",
    "Description.PublicContribution2": "{headingStart}However, opting out from the Luau Dataset won’t be possible after 30 days as the dataset will be publicly available.{headingEnd} Please only contribute code from experiences that you are comfortable with. Only a small fraction of your contributed code, less than 30%, will be compiled and aggregated into an open source-available dataset for AI model training.",
    "Heading.LuauStrong": "Let’s keep Luau strong!",
    "Description.RobloxOnly1": "Help improve Roblox AI products",
    "Description.RobloxOnly2": "Gain exclusive access to an enhanced model trained with community data",
    "Description.RobloxOnly3": "No data will be shared outside of Roblox",
    "Description.RobloxOnly4": "Opt out anytime, your data will be removed in less than 30 days",
    "Description.Public1": "Help make Luau a first class programming language",
    "Description.Public2": "Contribute a portion of your code from selected experiences",
    "Description.Public3": "Code will be released with the MIT license",
    "Description.Public4": "Opting out after 30 days will not remove the data as it will be already public",
    "Label.Disclaimer1": "By opting-in, you confirm that you agree (and, if you are under 18, your parent or legal guardian also agree) to the {linkStart}applicable contribution terms{linkEnd}.",
    "Heading.Metadata": "Luau Data Sharing",
    "Description.Metadata": "Let's empower creators with Luau like never before!"
}