{
    "Heading.RobloxCreatorRoadmap": "Roblox Creator Roadmap",
    "Description.MetadataDescription": "Preview new features and capabilities coming soon to Roblox. Get a glimpse into and help shape the future of the platform.",
    "Heading.CreatorRoadMap": "Creator Roadmap",
    "Description.CreatorRoadMap": "We are focused on providing you with solutions to make creation easier and more immersive. Use this roadmap to get a preview of some of the new features and capabilities coming soon to Roblox.",
    "Description.Disclaimer": "Disclaimer: The Creator Roadmap is not a comprehensive list of all upcoming features, and the details of the proposed features may change or some may not launch at all. Launch windows, e.g. (Mid 2023), are approximate and subject to change.",
    "Heading.CreateHoweverYouWant": "Create however you want",
    "Description.CreateHoweverYouWant": "We aim to make it easy and intuitive for everyone to express themselves. Whether you're building experiences or designing accessories, we'll support more ways for you to create.",
    "Heading.EasyCreation": "Easy creation, optimized for your ideal workflows",
    "Heading.StudioBugs": "Studio will address long-standing bugs and pain points",
    "Heading.CreateWorlds": "Create rich and lifelike worlds",
    "Heading.CloudCreation": "Cloud creation improves collaboration and reliability",
    "Heading.GenerativeAI": "Generative AI accelerates creation",
    "Heading.AvatarCreation": "Avatar creation and Marketplace",
    "Heading.GrowAudience": "Grow and engage your audience",
    "Description.GrowAudience": "Did you know that 100 of the top 150 experiences were created last year? We're making it easier for new experiences to build a global audience and giving you tools to engage and retain users.",
    "Heading.RobloxHome": "Roblox Home page connects you to your ideal audience",
    "Heading.PowerfulSearch": "Powerful search and browse capabilities",
    "Heading.Matchmaking": "Match your users to the best server",
    "Heading.Notifications": "Re-engage your community through notifications",
    "Heading.LanguageBarriers": "Break down language barriers",
    "Heading.GrowingCreator": "Benefit from a growing creator ecosystem",
    "Description.GrowingCreator": "We will support you with a thriving ecosystem that simplifies the challenging aspects of creation. These offerings will enhance your productivity, maintain a safe and civil platform, and offer you new ways to earn.",
    "Heading.CreatorHubSuccess": "Creator Hub is your key to success",
    "Description.CreatorHubSuccess": "We're equipping you with all the information you need to maximize your success with open-source  documentation, actionable recommendations to grow your experience, and timely notifications when your attention is needed.",
    "Heading.ComingSoon": "Coming Soon",
    "Description.ComingIn": "in {comingIn} week",
    "Description.ComingInPlural": "in {comingIn} weeks",
    "Heading.JoinTheCommunity": "Join The Community ",
    "Description.JoinTheCommunity": "The Forum is a collaborative resource where you can read about new features, share your input on upcoming features, and connect with other creators. Join in on the discussions and help shape the future of creation on Roblox.",
    "Label.DiscusRoadMap": "Learn More on the Forum",
    "Action.DiscussOnForum": "Discuss on Forum",
    "Heading.RobloxCloud": "Roblox Cloud helps you scale",
    "Heading.SafetyAndModeration": "Balanced safety and moderation",
    "Heading.EarnAndAdvertise": "More ways to earn and advertise",
    "Heading.LearnConnectCreate": "Learn, connect, and create with one another",
    "Heading.Insight": "Actionable insights to grow your experience",
    "Heading.Personalization": "Notifications and personalization keep you informed",
    "Heading.Collaborate": "Collaborate more efficiently as a team",
    "Action.ReadAnnouncement": "Read Latest Announcement",
    "Header.RobloxDevices": "Roblox on all popular devices",
    "Header.EmpowerCommunication": "Empower immersive communication and expression",
    "Heading.AccelerateCreationSepUpdate": "Accelerate creation through community-generated assets",
    "Heading.EngineExperience": "Engine can support any type of experience",
    "Label.LastUpdated2024April": "Last Updated: April 2024",
    "Description.EasyCreation2024AprilUpdate": "Our vision is to provide powerful, flexible workflows for creators to build next-generation immersive 3D experiences and user-generated content (UGC). We are building a foundation that will make it easier than ever to create high quality content, while adding flexibility to your day-to-day tasks. We are also exploring ways we can open the platform in a stable, supported, and future-proof way and will be holding several 'Office Hours' sessions in the near future to share more and answer your questions.{listStart}{listItemStart}{boldStart}Next Generation Studio UI{boldEnd} - A completely redesigned Studio UI with easier access to the tools and plugins that best match your unique workflows. (Early 2024){listItemEnd}{listItemStart}{boldStart}Live Scripting (Full Release) Beta {boldEnd} - Script collaboratively with streamlined version history, like editing a cloud document with your team. ({liveScriptingLinkStart}Live{liveScriptingLinkEnd}){listItemEnd}{listItemStart}{boldStart}Window Context Cues{boldEnd} - Visual indicators of Play/Test state in the Viewport. (Live){listItemEnd}{listItemStart}{boldStart}Studio Luau File Sync Beta{boldEnd} - Export/import scripts between Studio and disk, so that you can use any IDE or version control system. (Early 2024){listItemEnd}{listItemStart}{boldStart}Engine Open Cloud API Beta (Scripting only){boldEnd} - Use Open Cloud APIs for cloud based workflows or external IDEs. We're starting with scripting but plan to expand to the entire data model. (Late 2024){listItemEnd}{listItemStart}{boldStart}Package Version Descriptions{boldEnd} - Add and view descriptions for each version of packages. ({packageVersionLinkStart}Live{packageVersionLinkEnd}){listItemEnd}{listItemStart}{boldStart}Improved Package Discoverability and Update Workflow{boldEnd} - Easily discover package actions and apply updates. (Mid 2024){listItemEnd}{listItemStart}{boldStart}Public packages on Creator Store{boldEnd} - Packages can be shared publicly on Creator Store. (On hold){listItemEnd}{listItemStart}{boldStart}Gamepad + VR support in Studio Emulator{boldEnd} - Platform specific gamepads (e.g., Xbox, PlayStation) and Touch can be emulated. (2024){listItemEnd}{listItemStart}{boldStart}Dragger Improvements{boldEnd} - Improved controls, guides, and measurements for draggers. (Early 2024){listItemEnd}{listItemStart}{boldStart}DragDetectors for UI{boldEnd} - Make UI in your experience draggable and interactive without scripting. (Early 2024){listItemEnd}{listItemStart}{boldStart}Path2d{boldEnd} - Create 2d splines in UI for a broad array of use cases (e.g., animation, layouts). ({path2dStudioLinkStart}Live{path2dStudioLinkEnd}){listItemEnd}{listItemStart}{boldStart}Builder font released{boldEnd} - We are releasing our own custom Roblox font family: Builder. It is available in the Creator Store now and soon will be used on the Roblox App, Website, and Creator Hub. {builderFontLinkStart}Learn more{builderFontLinkEnd}. (Early 2024){listItemEnd}{listItemStart}{boldStart}Content Importer{boldEnd} - Today, there are multiple import flows in Studio. Working on creating a streamlined single importer that enables users to import all their content easily. (Late 2024){listItemEnd}{listEnd}",
    "Description.StudioBugs2024AprilUpdate": "Studio is a professional tool supporting long periods of sustained creation. We are investing heavily in both bug fixes and quality of life improvements that will make Studio more functional and reliable.{listStart}{listItemStart}{boldStart}Improve Team Create Join Time {boldEnd} - Start working on your experience, of any size, faster. (Ongoing){listItemEnd}{listItemStart}{boldStart}Script Diff Window {boldEnd} - Shipped in Package Diffs ({scriptDiffLinkStart}Live{scriptDiffLinkEnd}) and Scripts ({scriptDiffImprovementsLinkStart}Live{scriptDiffImprovementsLinkEnd}).{listItemEnd}{listEnd}",
    "Description.EngineExperience2024AprilUpdate": "We're focused on ensuring that Engine can help you achieve your goals regardless of your ambition.{listStart}{listItemStart}{boldStart}Custom Logging {boldEnd} - Allowing you to pass error locations through pcalls. (Early 2024){listItemEnd}{listItemStart}{boldStart}UI styling{boldEnd} - Stylesheets make it possible to change the look and feel of your UI with one click. They work with 3D content, too. (Early 2024){listItemEnd}{listItemStart}{boldStart}Occlusion culling {boldEnd} - Reduces the amount of occluded geometry rendered, which moderately to greatly improves performance depending on the scenario. (2024){listItemEnd}{listItemStart}{boldStart}Native Code Generation{boldEnd} - Improves script performance on RCC and in Studio plugins by compiling Luau to host CPU instructions instead of interpreting bytecodes in a virtual machine (Mid 2024){listItemEnd}{listItemStart}{boldStart}Updated Type Solver{boldEnd} - This improves Luau script analysis including more accurate binary operators inferences and new type operators. (Late 2024){listItemEnd}{listItemStart}{boldStart}DataModel Isolation and Script Capabilities{boldEnd} - Ability to insert models with scripts into experiences and have those scripts isolated from modifying the world or accessing Roblox APIs that are not explicitly allowed--making it safer to use models shared by other developers, guarantees configurable packages re limited to themselves, and empowers in-experience creation include scripting without impacting server state. (Late 2024){listItemEnd}{listItemStart}{boldStart}Type Inference for Native Compilation{boldEnd} - Incorporating types added by Luau into the decisions made by native code generation will allow more optimizations to performed and reduce the size of the generated native code. (Late 2024){listItemEnd}{listItemStart}{boldStart}Immersion Mode for VR{boldEnd} - Support for tracked controllers in VR that animate avatar arms in real time. (Mid 2024){listItemEnd}{listItemStart}{boldStart}Improved Haptics Controls{boldEnd} - Improved API for adding haptics to your experiences and UI across all supported platforms. (Late 2024){listItemEnd}{listEnd}",
    "Description.CreateWorlds2024AprilUpdate": "We are releasing aerodynamic simulation as our first fluid dynamics force, enabling completely new types of physically-accurate content. We're also significantly improving Future lighting's performance so that we can enable it on Android and make it our default lighting model.{listStart}{listItemStart}{boldStart}Aerodynamic Forces{boldEnd} - Aerodynamic properties, such as air density, to better simulate flight for objects like wingsuits. Studio beta ({aerodynamicLinkStart}live{aerodynamicLinkEnd}). Working toward full release. (Mid 2024){listItemEnd}{listItemStart}{boldStart}Future Lighting Android Beta{boldEnd} - Future lighting model available as a beta feature on Android devices. (Mid 2024){listItemEnd}{listItemStart}{boldStart}Future Lighting Studio Default {boldEnd} - Future lighting as the default lighting model, boosting the visual quality of experiences for more creators. (2024){listItemEnd}{listItemStart}{boldStart}Audio APIs{boldEnd} - Audio API empowers developers with increased control over audio, particularly voice, so devs can explore new ways to remix audio and create realistic sound in experience. ({audioApiBetaLinkStart}Live{audioApiBetaLinkEnd}){listItemEnd}{listItemStart}{boldStart}Mesh & Image APIs (formerly Texture){boldEnd} - First step in a new era of creation where developers have direct access to meshes and textures in Lua ({inExperienceMeshImageApisBetaLinkStart}Live in Studio{inExperienceMeshImageApisBetaLinkEnd}), and coming to in-experience. (Late 2024){listItemEnd}{listItemStart}{boldStart}Improved Physics Solver{boldEnd} - New and improved physics solver that enables more complex mechanisms and makes existing mechanisms more robust. (2024){listItemEnd}{listItemStart}{boldStart}Fluid physics improvements{boldEnd} - Improved hydrodynamic forces and more realistic water behavior. (2024){listItemEnd}{listItemStart}{boldStart}Improved debuggability of the Physics system{boldEnd} - Improve the ability to debug physics in Studio by visualizing force/torques, overhauling the pause functionality ({pausingPhysicsInStudioBetaLinkStart}live{pausingPhysicsInStudioBetaLinkEnd}), adding the ability to step through physics frames when paused, and adding the ability to temporarily simulate selected parts in edit mode. (2024){listItemEnd}{listItemStart}{boldStart}CSG on Meshes{boldEnd} - Perform CSG (Constructive Solid Geometry) operations like Union, Intersect and Subtract on Meshes in Studio and in-experience. (2024){listItemEnd}{listItemStart}{boldStart}New voxel light grid{boldEnd} - Improvements to lighting to bring the highest quality option to as many devices as possible--includes shadows, specular highlights, light reflection. (2024){listItemEnd}{listItemStart}{boldStart}Upper Body tracking{boldEnd} - Upper body tracking translates arm and torso movement onto your avatar in real time using the same technology as facial animation. (2024){listItemEnd}{listItemStart}{boldStart}Audio Meta Data API{boldEnd} - Developer-facing API to help developers add audio metadata to their experiences. (Early 2024){listItemEnd}{listEnd}",
    "Description.CloudCreation2024AprilUpdate": "Large, lifelike worlds will require heavy computational power and vast amounts of storage to create. Offloading these needs to the cloud will ensure that you can reliably create megascale experiences without disruption, while collaborating with teams of any size.{listStart}{listItemStart}{boldStart}Team Create Assets{boldEnd} - Access newly uploaded assets without needing to restart Team Create. (Late 2024){listItemEnd}{listItemStart}{boldStart}Granular Collaborator Permissions{boldEnd} - Give collaborators scoped access to your experiences in Team Create. (2024){listItemEnd}{listItemStart}{boldStart}Comments & Annotations inside Studio{boldEnd} - Annotate and leave comments in Studio for your collaborators. (Late 2024){listItemEnd}{listItemStart}{boldStart}Experience Activity History{boldEnd} - View history of collaboration activities and configuration changes in your experiences. Live on Creator Hub. Coming to Studio. (Mid 2024){listItemEnd}{listItemStart}{boldStart}Live Collaborator Presence in Studio{boldEnd} - Easily track active collaborators and jump to where they are working in Team Create. (Early 2024){listItemEnd}{listItemStart}{boldStart}Enhance Drafts {boldEnd} - Focusing on live scripting and performance improvement. (Early 2024){listItemEnd}{listEnd}",
    "Description.GenerativeAI2024AprilUpdate": "Roblox is building Generative AI tools to scale your creation efforts and let you focus on the aspects that matter most. This technology will help you learn, code, debug, build faster, iterate more, and augment your skills to create even better content. {listStart}{listItemStart}{boldStart}Material Generator Full Release{boldEnd} - Quickly generate visually-compelling materials using natural language. (Mid 2024){listItemEnd}{listItemStart}{boldStart}Code Assist Full Release{boldEnd} - Powerful code generation tool for both experienced and new scripters. ({codeAssistFullReleaseLinkStart}Live{codeAssistFullReleaseLinkEnd}){listItemEnd}{listItemStart}{boldStart}Texture Generator (Beta) (formerly AI texturing){boldEnd} - Text to texture generation to re-style your 3d meshes. ({textureGeneratorBetaLinkStart}Live{textureGeneratorBetaLinkEnd}){listItemEnd}{listEnd}",
    "Description.AvatarCreation2024AprilUpdate": "Avatars are a core part of Roblox. From using them to communicate to creating your own, our avatar features mimic real-life communication, empower self-expression, and drive creation. Here are some of the features we are enabling to create a community-led Marketplace where any creator can make an avatar that is expressive, communicative, and personalized:{listStart}{listItemStart}{boldStart}Improved Avatar Face and Body Tooling{boldEnd} - Enhancing how you can import, create, and publish avatar assets. (Late 2024){listItemEnd}{listItemStart}{boldStart}Community-led Marketplace{boldEnd} - Anyone can publish 3D avatar items to the Marketplace. ({anyoneCanPublishAvatarItemsLinkStart}Live{anyoneCanPublishAvatarItemsLinkEnd}){listItemEnd}{listItemStart}{boldStart}Marketplace price floors{boldEnd} - Improve price floors for items in the Marketplace to help grow creator earnings. (Live){listItemEnd}{listItemStart}{boldStart}Marketplace search and recommendations{boldEnd} - Improvements in Marketplace search and recommendations to create a more seamless shopping experience. (Early 2024){listItemEnd}{listItemStart}{boldStart}Photo to avatar {boldEnd} - Create avatars from photo and text prompts using generative AI. (2024){listItemEnd}{listItemStart}{boldStart}Accessory adjustment tool{boldEnd} - Avatar editor tool that allows you to adjust the size and placement of accessories on your avatar. (Early 2024){listItemEnd}{listItemStart}{boldStart}R6 to 15 Conversion Tool{boldEnd} - Streamline the conversion of existing R6 experiences to R15 with tools to migrate characters, animations and scripts. (Mid 2024){listItemEnd}{listItemStart}{boldStart}Avatar Auto Setup{boldEnd} - Simplify and automate the creation of fully functional Roblox-ready avatars from single-mesh 3D models of humanoid-like bodies. Launched in {avatarAutoSetupAlphaLinkStart}Alpha{avatarAutoSetupAlphaLinkEnd}. Targeting full release. (Late 2024){listItemEnd}{listItemStart}{boldStart}UGC Validation{boldEnd} - Unified library of validation checks for UGC assets (accessories and bodies) to enforce a minimum quality bar and compatibility with existing marketplace assets. (Live){listItemEnd}{listEnd}",
    "Description.RobloxHome2024AprilUpdate": "The Roblox Home page connects people with experiences that they will love, and will help you find your ideal audience. Every user's Home page connects them to new experiences through a state-of-the-art recommendation engine. We aim to make it easier for every Roblox experience to engage and grow their user base by recommending the experience to the right audience.{listStart}{listItemStart}{boldStart}Continuous Home{boldEnd} - Improving discovery on the Home page through an extended, continually scrollable feed. (Live){listItemEnd}{listItemStart}{boldStart}Social and Contextual Descriptors{boldEnd} - Labels like Friend presence in the experience, Genre and additional insights to distinguish different types of experiences on the Home page. (Mid 2024){listItemEnd}{listItemStart}{boldStart}Thumbnail Personalization{boldEnd} - You can A/B test your thumbnails to optimize conversion. (Late 2024){listItemEnd}{listItemStart}{boldStart}Improved Experience Details {boldEnd} - We're updating the Experience Details Page to improve usability and conversion. We're adding the experience icon to mobile experience pages and showing improved insights about the experience to help users decide better. (Late 2024){listItemEnd}{listItemStart}{boldStart}Recommendation Algorithm Improvements{boldEnd} - This is an on-going effort, we will continue to improve recommendations for users. (Ongoing){listItemEnd}{listItemStart}{boldStart}Points of Interest & Events{boldEnd} - We're working on helping you drive the discovery of events and key places in your experience with a new feature: Points of Interest, which lets you highlight events, landmarks, hangout spots, quests, or any other activity in your experience. The current events platform system will be deprecated and replaced with this new system. (Mid 2024) Later in the year, we will showcase your Points of Interest and Events across Home, Experience Details, and other surfaces. (Late 2024){listItemEnd}{listEnd}",
    "Description.PowerfulSearch2024AprilUpdate": "We're empowering users to explore a variety of content that matches their interests and passions, and be able to find anything that exists on Roblox. These improved discovery tools will deliver more relevant traffic to your experience and help new experiences get discovered more quickly.{listStart}{listItemStart}{boldStart}Dynamic Filters{boldEnd} - A community-requested feature that will enable users to find your experience based on genre or tag. (On hold){listItemEnd}{listItemStart}{boldStart}Algorithmically-Generated Categories and Sorts{boldEnd} - Highlighting new, high quality, and trending experiences. (2024){listItemEnd}{listItemStart}{boldStart}Combined Search & Discovery{boldEnd} - Merging Discover functionality with Search to simplify navigation. Search, browse, and filter all in one place. (2024){listItemEnd}{listItemStart}{boldStart}Search Relevance Improvements{boldEnd} - This is an ongoing effort to improve search relevance and to improve the discoverability of new experiences. Focus areas include fixing irrelevant results and using advanced machine learning models to optimize for relevance. (2024){listItemEnd}{listItemStart}{boldStart}Unified Search Result Page{boldEnd} - Improved ranking of experiences, people, marketplace items inside search result page and ranking them based on their relevance to the user query regardless of content type. (Late 2024){listItemEnd}{listItemStart}{boldStart}Clickbait suppression{boldEnd} - Working on detecting misleading and clickbait content and decreasing user exposure. (Early 2024){listItemEnd}{listEnd}",
    "Description.Matchmaking2024AprilUpdate": "Matchmaking is at the heart of Roblox's vision for connecting people. We abstract away the complexity of game server management and use signals like friends, latency, language, age, and server occupancy to direct users to the server most likely to maximize engagement. {listStart}{listItemStart}{boldStart}Auto-Reconnect{boldEnd} - Connect players to the same server following an update. ({automaticallyReconnectDuringUpdatesLinkStart}Live{automaticallyReconnectDuringUpdatesLinkEnd}){listItemEnd}{listEnd}",
    "Description.Notifications2024AprilUpdate": "{developerInvitesLinkStart}Developer-driven Invites{developerInvitesLinkEnd} are a new way to customize and improve the invite experience for users, and some creators are already reporting a 10x increase in players joining their friends. We aim to make it even easier for you to reach your community, and help you optimize the value of each notification.{listStart}{listItemStart}{boldStart}Notification Analytics{boldEnd} - Additional aggregated data provided via Creator Analytics. ({experienceNotificationsLinkStart}Live{experienceNotificationsLinkEnd}){listItemEnd}{listItemStart}{boldStart}Universal Experience Notifications API{boldEnd} - Create any kind of notification for your experiences, beyond just invites. ({experienceNotificationsLinkStart}Live{experienceNotificationsLinkEnd}){listItemEnd}{listItemStart}{boldStart}Notification Insights{boldEnd} - Automated suggestions to help improve the efficiency of your messages. (Mid 2024){listItemEnd}{listEnd}",
    "Description.LanguageBarriers2024AprilUpdate": "We strive to empower all our users to communicate with one another, regardless of language. By dissolving communication barriers, Roblox will help your community stay more closely connected, which will lead to increased engagement.{listStart}{listItemStart}{boldStart}Automatic Chat Translations{boldEnd} - In-experience chat automatically translated to supported languages. ({inExperienceTextChatLinkStart}Live{inExperienceTextChatLinkEnd}){listItemEnd}{listItemStart}{boldStart}In-experience Translation Feedback{boldEnd} - Allow users to share suggestions on ways you can improve your localization quality. ({translationFeedbackLinkStart}Live{translationFeedbackLinkEnd}){listItemEnd}{listItemStart}{boldStart}Fully translated documentation for 95% of creators {boldEnd} - Machine translation will let the majority of creators read documentation in their native language. (Mid 2024){listItemEnd}{listItemStart}{boldStart}New Regions{boldEnd} - Shipped support for four new locales on platform by the end of 2023 - Indonesian, Thai, Turkish, and Vietnamese. Shipped support for Polish in Feb 2024. Arabic support upcoming in the second half of 2024. (Late 2024){listItemEnd}{listItemStart}{boldStart}Image Translation{boldEnd} - Automatically translate text inside images while matching the style and feel of the original image. (Mid 2024){listItemEnd}{listItemStart}{boldStart}Automatic Translation Support for Non-English Experiences{boldEnd} - Creators who build in supported non-English languages can leverage automatic translation to make their experiences available in 15 other languages. ({automaticTranslationLinkStart}Live{automaticTranslationLinkEnd}){listItemEnd}{listEnd}",
    "Description.EmpowerCommunication2024AprilUpdate": "People already use Roblox to connect with friends.  We will be enabling new ways for users to connect, share, and express themselves, and provide creators with tools and APIs to build new forms of communication experiences.{listStart}{listItemStart}{boldStart}Captures API{boldEnd} - The Captures APIs allow creators to include pre-set moments within experiences where a screenshot is automatically taken for users to save, share, or delete the screenshot. ({captureApisLinkStart}Live{captureApisLinkEnd}){listItemEnd}{listItemStart}{boldStart}Updated experience controls{boldEnd} - Consistent and adaptive experience controls that make it easier for users to find their most frequently used action. (Early 2024){listItemEnd}{listEnd}",
    "Description.RobloxCloud2024AprilUpdate": "{cloudLinkStart}Roblox Cloud{cloudLinkEnd} will support a broader application ecosystem through a set of flexible and secure web APIs. We envision a world where you'll be able to automate workflows through scripts, publish via the command line, or create bots to help manage your community.{listStart}{listItemStart}{boldStart}Universe APIs {boldEnd} - Update the metadata, such as the description, for your experience. ({openCloudUniversesApiBetaLinkStart}Live{openCloudUniversesApiBetaLinkEnd}){listItemEnd}{listItemStart}{boldStart}Secret Store for HTTPService{boldEnd} - Securely store and attach secrets (like API keys and credentials) to access external services separately from code. No more plain text. ({secretStoreServiceLinkStart}Live{secretStoreServiceLinkEnd}){listItemEnd}{listItemStart}{boldStart}Memory Stores Enhancement{boldEnd} - Improve Memory Stores to support the key use cases better: 1) A data structure, HashMap, that has much higher limits for features like Server List, 2) Open Cloud APIs for Memory Stores that unlock use cases like external live leaderboards. (Mid 2024){listItemEnd}{listItemStart}{boldStart}Improved delivery of 3D meshes{boldEnd} - LoD (Level of Detail) generation for your meshes will be much better and continuously improve over time. More optimized delivery for 3D meshes to reduce client asset download times. (2024){listItemEnd}{listEnd}",
    "Description.AccelerateCreation2024AprilUpdate": "Creator Store contains millions of high-quality assets, but it's not always easy to find them. We aim to connect you with the perfect asset for any occasion and ensure everything you find in the Creator Store is safe to use. We have also heard your feedback about Creator Store monetization, and will be rolling out a plan to improve earnings for asset creators.{listStart}{listItemStart}{boldStart}List View Beta{boldEnd} - Making it easier to browse large asset collections in Toolbox. (On hold){listItemEnd}{listItemStart}{boldStart}Additional Spam & Plagiarism Protections{boldEnd} - More rigorous plagiarism detection and punishments for repeat offenders. (Early 2024){listItemEnd}{listItemStart}{boldStart}Personalized Asset Recommendations{boldEnd} - Discover assets based on the content in your experience. Launched but was paused due to issues. Targeting Mid 2024 for re-release. (Mid 2024){listItemEnd}{listEnd}",
    "Description.SafetyAndModeration2024AprilUpdate": "Our safety features, tools, and moderation capabilities have been built into the design of our product. We are continuing to work to make those capabilities smarter and stronger over time and will be investing more heavily in the detection and prevention of in-experience exploits. {listStart}{listItemStart}{boldStart}Ads brand safety and suitability controls{boldEnd} - Give advertisers brand safety and suitability controls for Immersive Ads to give more control over where their ads will be shown. ({expandedPublisherEligibilityBrandSuitabilityLinkStart}Live{expandedPublisherEligibilityBrandSuitabilityLinkEnd}){listItemEnd}{listItemStart}{boldStart}Moderation Precision{boldEnd} - We are working hard to lessen the burden of asset moderation while keeping the community safe. (Ongoing){listItemEnd}{listItemStart}{boldStart}Alt-Account Detection{boldEnd} - Take action on repeat offenders and help us combat exploiters on Roblox. (Mid 2024){listItemEnd}{listItemStart}{boldStart}Rights Manager (formerly Tools to manage Intellectual Property){boldEnd} - New centralized place for developers to easily manage the intellectual property rights of their creations. ({rightsManagerLinkStart}Live{rightsManagerLinkEnd}){listItemEnd}{listItemStart}{boldStart}Banning API{boldEnd} - API that allows devs to ban specific users from an experience and automatically handles alt accounts. (Early 2024){listItemEnd}{listEnd}",
    "Description.EarnAndAdvertise2024AprilUpdate": "We recently introduced {immersiveAdsLinkStart}Immersive Ads{immersiveAdsLinkEnd}, which allow developers to place high-quality, native ad units in their experience. These innovative ad units offer a new way for you to publish and earn from advertisements.{listStart}{listItemStart}{boldStart}Earn more on Creator Store sales{boldEnd} - Creators will get 100% of Creator Store sales in Creator Hub and Studio minus sales taxes and payment processing fees.  Items will be priced and sold in $USD instead of Robux and no longer subject to DevEx. ({creatorStoreSellerOnboardingLinkStart}Live{creatorStoreSellerOnboardingLinkEnd}){listItemEnd}{listItemStart}{boldStart}Immersive Ads video ad format and reporting{boldEnd} - Launch the video ad format for Immersive Ads to provide advertisers with new ways to express their ideas and provide new opportunities for publishers to earn. (Early 2024){listItemEnd}{listItemStart}{boldStart}Ads targeting{boldEnd} - More targeting options for advertisers to reach people interested in specific genres and other dimensions. (Early 2024){listItemEnd}{listItemStart}{boldStart}Subscribe within experiences with Roblox Credit{boldEnd} - Users can purchase subscriptions within experience with Roblox Credit, in addition to the saved card payment method offered today. (Early 2024){listItemEnd}{listItemStart}{boldStart}Roblox Groups 'Announcements' can be posted via Guilded {boldEnd} - A community owner can now, using Guilded, send a message (Announcements) to their whole community at once. (Early 2024){listItemEnd}{listItemStart}{boldStart}Expanded Subscription API functionality {boldEnd} - Allow developers to access more information on subscriber status and subscription analytics. Subscription APIs will also be available on Open Cloud. ({subscriptionsWithinExperiencesApiExpansionsLinkStart}Live{subscriptionsWithinExperiencesApiExpansionsLinkEnd}){listItemEnd}{listItemStart}{boldStart}Subscription promotions{boldEnd} - Enabling devs to run promotions on subscriptions (e.g. free trial or discounted first month). (Late 2023){listItemEnd}{listItemStart}{boldStart}Subscription description updates{boldEnd} - Safely enabling the ability to edit and update the description of active subscriptions. ({subscriptionsExpansionNewFeaturesLinkStart}Live{subscriptionsExpansionNewFeaturesLinkEnd}){listItemEnd}{listEnd}",
    "Description.LearnConnectCreate2024AprilUpdate": "Creation on Roblox is constantly evolving, and we strive to make it easy for users of all skill levels to learn and grow with the platform. In the coming year, we'll improve our documentation coverage and quality, expand our learning series, grow our Creator Events program, and support creators who are making next generation experiences.{listStart}{listItemStart}{boldStart}Docs Available in Studio{boldEnd} - Access advice and code samples directly from Studio. (Late 2024){listItemEnd}{listItemStart}{boldStart}Staff Articles in Dev Forum (Formerly Experts in Dev Forum){boldEnd} - Roblox staff can create articles and guides in Dev Forum about existing features, platform insights, and more. This is a new genre of information to share with creators beyond feature announcements and canonical documentation. ({staffArticlesLinkStart}Live{staffArticlesLinkEnd}){listItemEnd}{listItemStart}{boldStart}Updated Experience Templates{boldEnd} - Re-releasing some experience templates with much needed updates. Launched Racing template ({studioRacingTemplateLinkStart}live{studioRacingTemplateLinkEnd}), more templates coming in later this year. (Early 2024){listItemEnd}{listItemStart}{boldStart}Tutorials in-Studio{boldEnd} - New Roblox-created tutorials for new and growing creators. Tutorials can be found through Studio Start and followed without leaving Studio. (2024){listItemEnd}{listItemStart}{boldStart}Creator Fund (formerly Game Fund){boldEnd} - Supporting creators who want to build the next generation of Roblox experiences with a $35 million investment. (Ongoing){listItemEnd}{listEnd}",
    "Description.Insight2024AprilUpdate": "Many top Roblox creators already use analytics to grow their experiences, but data can be overwhelming. We want to offer everyone the power of a trusted data analyst, to help you interpret complicated data patterns and know what actions to take next.{listStart}{listItemStart}{boldStart}Session Time for New vs. Returning Users{boldEnd} - See session time split by new and returning users. Monitor session time drop off (e.g., 30% of your new users dropped off 30 sec in). ({newReturningUserSessionTimeLinkStart}Live{newReturningUserSessionTimeLinkEnd}){listItemEnd}{listItemStart}{boldStart}In Game Economy and Funnel Tracking (formerly Standard Event Schema){boldEnd} - Instrument schema to unlock funnel charts such as level progression and economy source vs. sink. (Mid 2024){listItemEnd}{listItemStart}{boldStart}Data Export API{boldEnd} - Export raw analytics data for your experiences. (2024){listItemEnd}{listItemStart}{boldStart}External Acquisition Source{boldEnd} - See where new users are coming from externally. (Late 2024){listItemEnd}{listItemStart}{boldStart}Improved Insights and Benchmarks{boldEnd} - Improve signal to help creators take action. (Ongoing){listItemEnd}{listEnd}",
    "Description.Personalization2024AprilUpdate": "It's important to know what's going on with your assets, experiences, collaborators, and the platform at large. This information allows you to take the right actions at the right time, and we want to make it even simpler to take advantage of insights and customize them. {listStart}{listItemStart}{boldStart}Expanded Notifications{boldEnd} - Get informed about critical events like a spike in crash rates, a collaboration invite, or a 'right to be forgotten' request. (Ongoing){listItemEnd}{listItemStart}{boldStart}Notifications in Creator Hub{boldEnd} - Easily stay informed about important updates anywhere on Creator Hub with notifications. ({creatorHubNotificationsLinkStart}Live{creatorHubNotificationsLinkEnd}){listItemEnd}{listEnd}",
    "Description.Collaborate2024AprilUpdate": "Most top experiences are developed by teams, and Roblox wants to make it even easier for you to collaborate. Talent Hub will help you connect with people to grow your team, and we are re-building 'Groups' from the ground up to make it easier to manage permissions.{listStart}{listItemStart}{boldStart}Self-serve Experience Ownership Transfer{boldEnd} - Free, self-service experience transfer from account to group. (2024){listItemEnd}{listItemStart}{boldStart}Creator Groups in Creator Hub{boldEnd} - Assign more specific permissions to roles, provide multiple roles to a member, and add collaborators with a new invite flow. (Early 2024){listItemEnd}{listItemStart}{boldStart}Overhauled Group Revenue{boldEnd} - Pay out collaborators directly within Creator Hub, and define more granular percentage splits by revenue source rather than total Group revenue. (Mid 2024){listItemEnd}{listItemStart}{boldStart}Groups owning Groups{boldEnd} - Set up more complicated hierarchies with your collaborators by managing groups owned by your primary group. (Late 2024){listItemEnd}{listItemStart}{boldStart}Asset Privacy and Permissions: Audio and Video{boldEnd} - Sharing audio & video assets with friends ({assetPrivacyLinkStart}live{assetPrivacyLinkEnd}) and working on sharing with groups. (Mid 2024) {listItemEnd}{listItemStart}{boldStart}Asset Privacy and Permissions: Animations{boldEnd} - Sharing animations with friends and groups. (Mid 2024){listItemEnd}{listItemStart}{boldStart}Asset Privacy and Permissions: Meshes, Images, Models and Packages{boldEnd} - Improved sharing of meshes, images, models & packages. (Late 2024){listItemEnd}{listItemStart}{boldStart}Asset Management{boldEnd} - Launching a revamped Asset Manager in Studio. Enable users to easily organize (folders/labels) and search assets in their accounts and their groups' accounts.  We'll be deprecating the existing Asset Manager and migrating user inventory out of Toolbox into the new Asset Manager, and Toolbox will become solely focused on Creator Store content. (Late 2024){listItemEnd}{listEnd}",
    "Description.Notifications2024AugustUpdate": "{developerInvitesLinkStart}Developer-driven Invites{developerInvitesLinkEnd} are a new way to customize and improve the invite experience for users, and some creators are already reporting a 10x increase in players joining their friends. We aim to make it even easier for you to reach your community, and help you optimize the value of each notification.{listStart}{listItemStart}{boldStart}Notification Analytics{boldEnd} - Additional aggregated data provided via Creator Analytics. ({experienceNotificationsLinkStart}Live{experienceNotificationsLinkEnd}){listItemEnd}{listItemStart}{boldStart}Universal Experience Notifications API{boldEnd} - Create any kind of notification for your experiences, beyond just invites. ({experienceNotificationsLinkStart}Live{experienceNotificationsLinkEnd}){listItemEnd}{listItemStart}{boldStart}Notification Insights{boldEnd} - Automated suggestions to help improve the efficiency of your messages. (Mid 2024){listItemEnd}{listEnd}",
    "Description.GenerativeAI2024AugustUpdate": "Roblox is building Generative AI tools to scale your creation efforts and let you focus on the aspects that matter most. This technology will help you learn, code, debug, build faster, iterate more, and augment your skills to create even better content. {listStart}{listItemStart}{boldStart}Material Generator Full Release{boldEnd} - Quickly generate visually-compelling materials using natural language. (Mid 2024){listItemEnd}{listItemStart}{boldStart}Code Assist Full Release{boldEnd} - Powerful code generation tool for both experienced and new scripters. ({codeAssistFullReleaseLinkStart}Live{codeAssistFullReleaseLinkEnd}){listItemEnd}{listItemStart}{boldStart}Texture Generator (Beta) (formerly AI texturing){boldEnd} - Text to texture generation to re-style your 3d meshes. ({textureGeneratorBetaLinkStart}Live{textureGeneratorBetaLinkEnd}){listItemEnd}{listEnd}",
    "Description.RobloxHome2024AugustUpdate": "The Roblox Home page connects people with experiences that they will love, and will help you find your ideal audience. Every user's Home page connects them to new experiences through a state-of-the-art recommendation engine. We aim to make it easier for every Roblox experience to engage and grow their user base by recommending the experience to the right audience.{listStart}{listItemStart}{boldStart}Continuous Home{boldEnd} - Improving discovery on the Home page through an extended, continually scrollable feed. (Live){listItemEnd}{listItemStart}{boldStart}Social and Contextual Descriptors{boldEnd} - Labels like Friend presence in the experience, Genre and additional insights to distinguish different types of experiences on the Home page. (Late 2024){listItemEnd}{listItemStart}{boldStart}Thumbnail Personalization{boldEnd} - You can A/B test your thumbnails to optimize conversion. (Late 2024){listItemEnd}{listItemStart}{boldStart}Improved Experience Details {boldEnd} - We're updating the Experience Details Page to improve usability and conversion. We're adding the experience icon to mobile experience pages and showing improved insights about the experience to help users decide better. (Late 2024){listItemEnd}{listItemStart}{boldStart}Recommendation Algorithm Improvements{boldEnd} - This is an on-going effort, we will continue to improve recommendations for users. (Ongoing){listItemEnd}{listItemStart}{boldStart}Points of Interest & Events{boldEnd} - We're working on helping you drive the discovery of events and key places in your experience with a new feature: Points of Interest, which lets you highlight events, landmarks, hangout spots, quests, or any other activity in your experience. The current events platform system will be deprecated and replaced with this new system. (Mid 2024) Later in the year, we will showcase your Points of Interest and Events across Home, Experience Details, and other surfaces. (Late 2024){listItemEnd}{listEnd}",
    "Description.StudioBugs2024AugustUpdate": "Studio is a professional tool supporting long periods of sustained creation. We are investing heavily in both bug fixes and quality of life improvements that will make Studio more functional and reliable.{listStart}{listItemStart}{boldStart}Improve Team Create Join Time {boldEnd} - Start working on your experience, of any size, faster. (Ongoing){listItemEnd}{listItemStart}{boldStart}Script Diff Window {boldEnd} - Shipped in Package Diffs ({scriptDiffLinkStart}Live{scriptDiffLinkEnd}) and Scripts ({scriptDiffImprovementsLinkStart}Live{scriptDiffImprovementsLinkEnd}).{listItemEnd}{listEnd}",
    "Description.RobloxCloud2024AugustUpdate": "{cloudLinkStart}Roblox Cloud{cloudLinkEnd} will support a broader application ecosystem through a set of flexible and secure web APIs. We envision a world where you'll be able to automate workflows through scripts, publish via the command line, or create bots to help manage your community.{listStart}{listItemStart}{boldStart}Universe APIs {boldEnd} - Update the metadata, such as the description, for your experience. ({openCloudUniversesApiBetaLinkStart}Live{openCloudUniversesApiBetaLinkEnd}){listItemEnd}{listItemStart}{boldStart}Secret Store for HTTPService{boldEnd} - Securely store and attach secrets (like API keys and credentials) to access external services separately from code. No more plain text. ({secretStoreServiceLinkStart}Live{secretStoreServiceLinkEnd}){listItemEnd}{listItemStart}{boldStart}Memory Stores Enhancement{boldEnd} - Improve Memory Stores to support the key use cases better: 1) A data structure, HashMap, that has much higher limits for features like Server List, ({memoryStoreHashMapLinkStart}Live{memoryStoreHashMapLinkEnd}) 2) Open Cloud APIs for Memory Stores that unlock use cases like external live leaderboards. ({openCloudMemoryStoresLinkStart}Live{openCloudMemoryStoresLinkEnd}){listItemEnd}{listItemStart}{boldStart}Improved Data Stores (Beta){boldEnd} - Adding easy-to-use schematized user profile management and platform support for session locking and retry logic. (Late 2024){listItemEnd}{listItemStart}{boldStart}Badges Enhancements{boldEnd} - Badges privacy options and ability to reorder (Late 2024){listItemEnd}{listItemStart}{boldStart}Data Stores Versioning Update{boldEnd} - optimize number of versions stored, versions available longer, support snapshots (Late 2024){listItemEnd}{listItemStart}{boldStart}Game Server Performance Dashboards{boldEnd} - New dashboards to see Server CPU and Memory Usage Breakdowns (Late 2024){listItemEnd}{listItemStart}{boldStart}Improved delivery of 3D meshes{boldEnd} - LoD (Level of Detail) generation for your meshes will be much better and continuously improve over time. More optimized delivery for 3D meshes to reduce client asset download times. (2024){listItemEnd}{listEnd}",
    "Description.EmpowerCommunication2024AugustUpdate": "People already use Roblox to connect with friends.  We will be enabling new ways for users to connect, share, and express themselves, and provide creators with tools and APIs to build new forms of communication experiences.{listStart}{listItemStart}{boldStart}Captures API{boldEnd} - The Captures APIs allow creators to include pre-set moments within experiences where a screenshot is automatically taken for users to save, share, or delete the screenshot. ({captureApisLinkStart}Live{captureApisLinkEnd}){listItemEnd}{listItemStart}{boldStart}Updated in experience controls{boldEnd} - Consistent and adaptive experience controls that make it easier for users to find their most frequently used action. ({inExperienceControlsLinkStart}Late 2024{inExperienceControlsLinkEnd}){listItemEnd}{listEnd}",
    "Description.EasyCreation2024AugustUpdate": "Our vision is to provide powerful, flexible workflows for creators to build next-generation immersive 3D experiences and user-generated content (UGC). We are building a foundation that will make it easier than ever to create high quality content, while adding flexibility to your day-to-day tasks. We are also exploring ways we can open the platform in a stable, supported, and future-proof way and will be holding several 'Office Hours' sessions in the near future to share more and answer your questions.{listStart}{listItemStart}{boldStart}Next Generation Studio UI{boldEnd} - A completely redesigned Studio UI with easier access to the tools and plugins that best match your unique workflows. ({nextGenStudioPreviewLinkStart}Live{nextGenStudioPreviewLinkEnd}){listItemEnd}{listItemStart}{boldStart}Live Scripting (Full Release) Beta {boldEnd} - Script collaboratively with streamlined version history, like editing a cloud document with your team. ({liveScriptingLinkStart}Live{liveScriptingLinkEnd}){listItemEnd}{listItemStart}{boldStart}Window Context Cues{boldEnd} - Visual indicators of Play/Test state in the Viewport. (Live){listItemEnd}{listItemStart}{boldStart}Studio Luau File Sync Beta{boldEnd} - Export/import scripts between Studio and disk, so that you can use any IDE or version control system. (Late 2024){listItemEnd}{listItemStart}{boldStart}Engine Open Cloud API Beta (Scripting only){boldEnd} - Use Open Cloud APIs for cloud based workflows or external IDEs. We're starting with scripting but plan to expand to the entire data model. ({openCloudEngineApiScriptingBetaLinkStart}Live{openCloudEngineApiScriptingBetaLinkEnd}){listItemEnd}{listItemStart}{boldStart}Engine Open Cloud API for Running Tasks{boldEnd} - Run Luau code in RCC via Open Cloud so that creators can run automated Luau tests. (Late 2024){listItemEnd}{listItemStart}{boldStart}Package Version Descriptions{boldEnd} - Add and view descriptions for each version of packages. ({packageVersionLinkStart}Live{packageVersionLinkEnd}){listItemEnd}{listItemStart}{boldStart}Improved Package Discoverability and Update Workflow{boldEnd} - Easily discover package actions and apply updates. (Live){listItemEnd}{listItemStart}{boldStart}OSS Code Libraries as Packages on Creator Store{boldEnd} - OSS Code Libraries can be distributed as Packages on Creator Store. (2024){listItemEnd}{listItemStart}{boldStart}Gamepad + VR support in Studio Emulator{boldEnd} - Platform specific gamepads (e.g., Xbox, PlayStation) and Touch can be emulated. (Late 2024){listItemEnd}{listItemStart}{boldStart}Dragger Improvements{boldEnd} - Improved controls, guides, and measurements for draggers. (Late 2024){listItemEnd}{listItemStart}{boldStart}DragDetectors for UI{boldEnd} - Make UI in your experience draggable and interactive without scripting. (Late 2024){listItemEnd}{listItemStart}{boldStart}Path2d{boldEnd} - Create 2d splines in UI for a broad array of use cases (e.g., animation, layouts). ({path2dStudioLinkStart}Live{path2dStudioLinkEnd}){listItemEnd}{listItemStart}{boldStart}Terrain Creation{boldEnd} - Create large geographic features (e.g., mountains, lakes, hills) quickly with customizable parameters. (Late 2024){listItemEnd}{listItemStart}{boldStart}Avatar Setup Editing Tools{boldEnd} - Edit attachment points and cage of an Avatar directly in the Avatar Setup tool. (Late 2024){listItemEnd}{listItemStart}{boldStart}Viewport Settings{boldEnd} - Modify viewport settings quickly and easily in the viewport. (Mid 2024){listItemEnd}{listItemStart}{boldStart}Material Picker{boldEnd} - Consolidated interface to apply and create materials quickly. ({materialPickerLinkStart}Live{materialPickerLinkEnd}){listItemEnd}{listItemStart}{boldStart}Explorer Revamp{boldEnd} - Significantly improve performance of the Explorer widget, especially in large, complex places. Introduce better organizational and editing tools to make quick changes directly from the explorer, increasing creator velocity. (Early 2025){listItemEnd}{listItemStart}{boldStart}Builder Font{boldEnd} - We are releasing our own custom Roblox font family: Builder. It is available in the Creator Store now and soon will be used on the Roblox App, Website, and Creator Hub. ({builderFontLinkStart}Live{builderFontLinkEnd}){listItemEnd}{listItemStart}{boldStart}Content Importer{boldEnd} - Today, there are multiple import flows in Studio. Working on creating a streamlined single importer that enables users to import all their content easily. (Late 2024){listItemEnd}{listEnd}",
    "Label.LastUpdated2024August": "Last Updated: August 2024",
    "Description.EarnAndAdvertise2024AugustUpdate": "We recently introduced {immersiveAdsLinkStart}Immersive Ads{immersiveAdsLinkEnd}, which allow developers to place high-quality, native ad units in their experience. These innovative ad units offer a new way for you to publish and earn from advertisements.{listStart}{listItemStart}{boldStart}Earn more on Creator Store sales{boldEnd} - Creators will get 100% of Creator Store sales in Creator Hub and Studio minus sales taxes and payment processing fees. Items will be priced and sold in $USD instead of Robux and no longer subject to DevEx. ({creatorStoreSellerOnboardingLinkStart}Live{creatorStoreSellerOnboardingLinkEnd}){listItemEnd}{listItemStart}{boldStart}Immersive Ads video ad format and reporting{boldEnd} - Launch the video ad format for Immersive Ads to provide advertisers with new ways to express their ideas and provide new opportunities for publishers to earn. ({immersiveAdsVideoLaunchLinkStart}Live{immersiveAdsVideoLaunchLinkEnd}){listItemEnd}{listItemStart}{boldStart}Ads targeting{boldEnd} - More targeting options for advertisers to reach people interested in specific genres and other dimensions. ({enhancedSponsoredExperiencedAdsManagerLinkStart}Live{enhancedSponsoredExperiencedAdsManagerLinkEnd}){listItemEnd}{listItemStart}{boldStart}Subscribe within experiences with Roblox Credit{boldEnd} - Users can purchase subscriptions within experience with Roblox Credit, in addition to the saved card payment method offered today. (Live){listItemEnd}{listItemStart}{boldStart}Roblox Groups 'Announcements' can be posted via Guilded {boldEnd} - A community owner can now, using Guilded, send a message (Announcements) to their whole community at once. ({announcementsRobloxGroupsLinkStart}Live{announcementsRobloxGroupsLinkEnd}){listItemEnd}{listItemStart}{boldStart}Expanded Subscription API functionality {boldEnd} - Allow developers to access more information on subscriber status and subscription analytics. Subscription APIs will also be available on Open Cloud. ({subscriptionsWithinExperiencesApiExpansionsLinkStart}Live{subscriptionsWithinExperiencesApiExpansionsLinkEnd}){listItemEnd}{listItemStart}{boldStart}Subscription promotions{boldEnd} - Enabling devs to run promotions on subscriptions (e.g. free trial or discounted first month). (Late 2024){listItemEnd}{listItemStart}{boldStart}Subscription description updates{boldEnd} - Safely enabling the ability to edit and update the description of active subscriptions. ({subscriptionsExpansionNewFeaturesLinkStart}Live{subscriptionsExpansionNewFeaturesLinkEnd}){listItemEnd}{listEnd}",
    "Description.EngineExperience2024AugustUpdate": "We're focused on ensuring that Engine can help you achieve your goals regardless of your ambition.{listStart}{listItemStart}{boldStart}Custom Logging {boldEnd} - Allowing you to pass error locations through pcalls. (On hold){listItemEnd}{listItemStart}{boldStart}UI styling{boldEnd} - Stylesheets make it possible to change the look and feel of your UI with one click. They work with 3D content, too. (Late 2024){listItemEnd}{listItemStart}{boldStart}Occlusion culling {boldEnd} - Reduces the amount of occluded geometry rendered, which moderately to greatly improves performance depending on the scenario. (2024){listItemEnd}{listItemStart}{boldStart}Native Code Generation{boldEnd} - Improves script performance on RCC and in Studio plugins by compiling Luau to host CPU instructions instead of interpreting bytecodes in a virtual machine. (Mid 2024){listItemEnd}{listItemStart}{boldStart}Updated Type Solver{boldEnd} - This improves Luau script analysis including more accurate binary operators inferences and new type operators. (Late 2024){listItemEnd}{listItemStart}{boldStart}DataModel Isolation and Script Capabilities{boldEnd} - Ability to insert models with scripts into experiences and have those scripts isolated from modifying the world or accessing Roblox APIs that are not explicitly allowed-- making it safer to use models shared by other developers, guarantees configurable packages re limited to themselves, and empowers in-experience creation include scripting without impacting server state. (Late 2024){listItemEnd}{listItemStart}{boldStart}Type Inference for Native Compilation{boldEnd} - Incorporating types added by Luau into the decisions made by native code generation will allow more optimizations to performed and reduce the size of the generated native code. (Late 2024){listItemEnd}{listItemStart}{boldStart}Immersion Mode for VR{boldEnd} - Support for tracked controllers in VR that animate avatar arms in real time. ({animatingAvatarInVrLinkStart}Live{animatingAvatarInVrLinkEnd}){listItemEnd}{listItemStart}{boldStart}Improved Haptics Controls{boldEnd} - Improved API for adding haptics to your experiences and UI across all supported platforms. (Late 2024){listItemEnd}{listEnd}",
    "Description.CreateWorlds2024AugustUpdate": "We are releasing aerodynamic simulation as our first fluid dynamics force, enabling completely new types of physically-accurate content. We're also significantly improving Future lighting's performance so that we can enable it on Android and make it our default lighting model.{listStart}{listItemStart}{boldStart}Store up to 8K image resolution{boldEnd} - Currently, when a user uploads an image > 1K in resolution, it gets transcoded down to 1K, and the high-fidelity version is lost. We will now start to store the high-fidelity version up to 8K. Initially, it will be used for asset previews in the Store. In the future, it can be utilized to support textures more than 1K. ({retainingHighFidelityImagesLinkStart}Live{retainingHighFidelityImagesLinkEnd}){listItemEnd}{listItemStart}{boldStart}Aerodynamic Forces{boldEnd} - Aerodynamic properties, such as air density, to better simulate flight for objects like wingsuits. Studio beta (live). Working toward full release. (Mid 2024){listItemEnd}{listItemStart}{boldStart}Future Lighting Android Beta{boldEnd} - Future lighting model available as a beta feature on Android devices. (Mid 2024){listItemEnd}{listItemStart}{boldStart}Future Lighting Studio Default {boldEnd} - Future lighting as the default lighting model, boosting the visual quality of experiences for more creators. (2025){listItemEnd}{listItemStart}{boldStart}Audio APIs{boldEnd} - Audio API empowers developers with increased control over audio, particularly voice, so devs can explore new ways to remix audio and create realistic sound in experience. ({audioApiBetaLinkStart}Live{audioApiBetaLinkEnd}){listItemEnd}{listItemStart}{boldStart}Mesh & Image APIs (formerly Texture){boldEnd} - First step in a new era of creation where developers have direct access to meshes and textures in Lua (Live in Studio), and coming to in-experience. (Late 2024){listItemEnd}{listItemStart}{boldStart}Improved Physics Solver{boldEnd} - New and improved physics solver that enables more complex mechanisms and makes existing mechanisms more robust. (2024){listItemEnd}{listItemStart}{boldStart}Fluid physics improvements{boldEnd} - Improved hydrodynamic forces and more realistic water behavior. (Late 2024){listItemEnd}{listItemStart}{boldStart}Improved debuggability of the Physics system{boldEnd} - Improve the ability to debug physics in Studio by visualizing force/torques, overhauling the pause functionality (live), adding the ability to step through physics frames when paused, and adding the ability to temporarily simulate selected parts in edit mode. (2024){listItemEnd}{listItemStart}{boldStart}CSG on Meshes{boldEnd} - Perform CSG (Constructive Solid Geometry) operations like Union, Intersect and Subtract on Meshes in Studio and in-experience. (2024){listItemEnd}{listItemStart}{boldStart}New voxel light grid{boldEnd} - Improvements to lighting to bring the highest quality option to as many devices as possible--includes shadows, specular highlights, light reflection. (2025){listItemEnd}{listItemStart}{boldStart}Upper Body tracking{boldEnd} - Upper body tracking translates arm and torso movement onto your avatar in real time using the same technology as facial animation. (2024){listItemEnd}{listItemStart}{boldStart}Audio Meta Data API{boldEnd} - Developer-facing API to help developers add audio metadata to their experiences. (Early 2024){listItemEnd}{listItemStart}{boldStart}Speech to text API{boldEnd} - Takes in audio dialogue and outputs text. Can specify input and output language, but output language defaults to the user's account language. Allows creators to create diverse experiences that use voice commands. (Late 2024){listItemEnd}{listItemStart}{boldStart}Text to speech API{boldEnd} - Takes in text and outputs speech audio. Can specify input and output language, but output language defaults to the user's account language. Allows creators to create diverse experiences with more speaking NPCs, narrators, etc. (2025){listItemEnd}{listEnd}",
    "Description.CloudCreation2024AugustUpdate": "Large, lifelike worlds will require heavy computational power and vast amounts of storage to create. Offloading these needs to the cloud will ensure that you can reliably create megascale experiences without disruption, while collaborating with teams of any size.{listStart}{listItemStart}{boldStart}Team Create Assets{boldEnd} - Access newly uploaded assets without needing to restart Team Create. (Late 2024){listItemEnd}{listItemStart}{boldStart}Granular Collaborator Permissions{boldEnd} - Give collaborators scoped access to your experiences in Team Create. (Early 2025){listItemEnd}{listItemStart}{boldStart}Comments & Annotations inside Studio{boldEnd} - Annotate and leave comments in Studio for your collaborators. (Late 2024){listItemEnd}{listItemStart}{boldStart}Experience Activity History{boldEnd} - View history of collaboration activities and configuration changes in your experiences. Live on Creator Hub. Coming to Studio. (Mid 2024){listItemEnd}{listItemStart}{boldStart}Live Collaborator Presence in Studio{boldEnd} - Easily track active collaborators and jump to where they are working in Team Create. ({visibilityOfCollaboratorsLinkStart}Live{visibilityOfCollaboratorsLinkEnd}){listItemEnd}{listItemStart}{boldStart}Enhance Drafts {boldEnd} - Focusing on live scripting and performance improvement.  We've put this on hold as it will get addressed as part of broader refactoring. (On hold){listItemEnd}{listEnd}",
    "Description.PowerfulSearch2024AugustUpdate": "We're empowering users to explore a variety of content that matches their interests and passions, and be able to find anything that exists on Roblox. These improved discovery tools will deliver more relevant traffic to your experience and help new experiences get discovered more quickly.{listStart}{listItemStart}{boldStart}Dynamic Filters{boldEnd} - A community-requested feature that will enable users to find your experience based on genre or tag. (On hold){listItemEnd}{listItemStart}{boldStart}Algorithmically-Generated Categories and Sorts{boldEnd} - Highlighting new, high quality, and trending experiences. ({enhancedDiscoverPageTopChartsLinkStart}Live{enhancedDiscoverPageTopChartsLinkEnd}){listItemEnd}{listItemStart}{boldStart}Combined Search & Discovery{boldEnd} - Merging Discover functionality with Search to simplify navigation. Search, browse, and filter all in one place. (On hold){listItemEnd}{listItemStart}{boldStart}Search Relevance Improvements{boldEnd} - This is an ongoing effort to improve search relevance and to improve the discoverability of new experiences. Focus areas include fixing irrelevant results and using advanced machine learning models to optimize for relevance. (2024){listItemEnd}{listItemStart}{boldStart}Unified Search Result Page{boldEnd} - Improved ranking of experiences, people, marketplace items inside search result page and ranking them based on their relevance to the user query regardless of content type. (Late 2024){listItemEnd}{listItemStart}{boldStart}Clickbait suppression{boldEnd} - Working on detecting misleading and clickbait content and decreasing user exposure. (Early 2024){listItemEnd}{listItemStart}{boldStart}Improved Experience Genres{boldEnd} - Improved experience genre taxonomy and way for creators to select their genre. (Late 2024){listItemEnd}{listEnd}",
    "Description.AvatarCreation2024AugustUpdate": "Avatars are a core part of Roblox. From using them to communicate to creating your own, our avatar features mimic real-life communication, empower self-expression, and drive creation. Here are some of the features we are enabling to create a community-led Marketplace where any creator can make an avatar that is expressive, communicative, and personalized:{listStart}{listItemStart}{boldStart}Improved Avatar Face and Body Tooling{boldEnd} - Enhancing how you can import, create, and publish avatar assets. (Late 2024){listItemEnd}{listItemStart}{boldStart}Community-led Marketplace{boldEnd} - Anyone can publish 3D avatar items to the Marketplace. ({anyoneCanPublishAvatarItemsLinkStart}Live{anyoneCanPublishAvatarItemsLinkEnd}){listItemEnd}{listItemStart}{boldStart}Marketplace price floors{boldEnd} - Improve price floors for items in the Marketplace to help grow creator earnings. (Live){listItemEnd}{listItemStart}{boldStart}Marketplace search and recommendations{boldEnd} - Improvements in Marketplace search and recommendations to create a more seamless shopping experience. (Early 2024){listItemEnd}{listItemStart}{boldStart}Photo to avatar {boldEnd} - Create avatars from photo and text prompts using generative AI. (2024){listItemEnd}{listItemStart}{boldStart}Accessory adjustment tool{boldEnd} - Avatar editor tool that allows you to adjust the size and placement of accessories on your avatar. (Early 2024){listItemEnd}{listItemStart}{boldStart}R6 to 15 Conversion Tool{boldEnd} - Streamline the conversion of existing R6 experiences to R15 with tools to migrate characters, animations and scripts. (On hold){listItemEnd}{listItemStart}{boldStart}Avatar Auto Setup{boldEnd} - Simplify and automate the creation of fully functional Roblox-ready avatars from single-mesh 3D models of humanoid-like bodies. Launched in {avatarAutoSetupAlphaLinkStart}Alpha{avatarAutoSetupAlphaLinkEnd} and {avatarAutoSetupBetaLinkStart}Beta{avatarAutoSetupBetaLinkEnd}. Targeting full release. (Late 2024){listItemEnd}{listItemStart}{boldStart}UGC Validation{boldEnd} - Unified library of validation checks for UGC assets (accessories and bodies) to enforce a minimum quality bar and compatibility with existing marketplace assets. (Live){listItemEnd}{listItemStart}{boldStart}Archiving Avatar Items{boldEnd} - Allows creators to archive avatar items themselves, without reaching out to Roblox. (Late 2024){listItemEnd}{listItemStart}{boldStart}Marketplace Analytics{boldEnd} - We are expanding Creator Analytics for Avatar Items to include item-level insights such as buyer demographics, publishing advance rebates recouped, item sales location breakdown, and more. (Late 2024){listItemEnd}{listItemStart}{boldStart}Community Avatars{boldEnd} - We are opening up the community's ability to create and share full Avatars to Marketplace, by combining existing bodies, accessories, and clothing. (Mid 2024){listItemEnd}{listItemStart}{boldStart}Avatar Item Thumbnail Improvements{boldEnd} - We are making a series of thumbnail improvements to improve the Marketplace user experience and make it easier for users to find items they love. We will begin with lighting improvements and providing tools to creators to control how their items are displayed in Marketplace. (Late 2024){listItemEnd}{listEnd}",
    "Description.Matchmaking2024AugustUpdate": "Matchmaking is at the heart of Roblox's vision for connecting people. We abstract away the complexity of game server management and use signals like friends, latency, language, age, and server occupancy to direct users to the server most likely to maximize engagement. {listStart}{listItemStart}{boldStart}Auto-Reconnect{boldEnd} - Connect players to the same server following an update. ({automaticallyReconnectDuringUpdatesLinkStart}Live{automaticallyReconnectDuringUpdatesLinkEnd}){listItemEnd}{listEnd}",
    "Description.LanguageBarriers2024AugustUpdate": "We strive to empower all our users to communicate with one another, regardless of language. By dissolving communication barriers, Roblox will help your community stay more closely connected, which will lead to increased engagement.{listStart}{listItemStart}{boldStart}Automatic Chat Translations{boldEnd} - In-experience chat automatically translated to supported languages. ({inExperienceTextChatLinkStart}Live{inExperienceTextChatLinkEnd}){listItemEnd}{listItemStart}{boldStart}In-experience Translation Feedback{boldEnd} - Allow users to share suggestions on ways you can improve your localization quality. ({translationFeedbackLinkStart}Live{translationFeedbackLinkEnd}){listItemEnd}{listItemStart}{boldStart}Fully translated documentation for 95% of creators{boldEnd} - Machine translation will let the majority of creators read documentation in their native language. (Late 2024){listItemEnd}{listItemStart}{boldStart}New Regions{boldEnd} - Shipped support for four new locales on platform by the end of 2023 - Indonesian, Thai, Turkish, and Vietnamese. Shipped support for Polish in Feb 2024. Arabic support upcoming in the second half of 2024. (Late 2024){listItemEnd}{listItemStart}{boldStart}Support for Language Variants{boldEnd} - Localization support for variants within languages, such as English (US) and English (UK). (Late 2024){listItemEnd}{listItemStart}{boldStart}Image Translation{boldEnd} - Automatically translate text inside images while matching the style and feel of the original image. (Mid 2024){listItemEnd}{listItemStart}{boldStart}Automatic Translation Support for Non-English Experiences{boldEnd} - Creators who build in supported non-English languages can leverage automatic translation to make their experiences available in 15 other languages. ({automaticTranslationLinkStart}Live{automaticTranslationLinkEnd}){listItemEnd}{listItemStart}{boldStart}Real-Time Translation API{boldEnd} - Creators can call Roblox's automatic translation API to translate UGC and dynamic content in real time. (Late 2024){listItemEnd}{listItemStart}{boldStart}Voice chat captioning + translations{boldEnd} - All users can see captions of any voice chat happening via spatial voice. The captions will go through the text filter and also be translated into your account language if possible. (Late 2024){listItemEnd}{listItemStart}{boldStart}Real-time voice chat translation{boldEnd} - Real-time speech translation for voice chat. (2025){listItemEnd}{listEnd}",
    "Description.AccelerateCreation2024AugustUpdate": "Creator Store contains millions of high-quality assets, but it's not always easy to find them. We aim to connect you with the perfect asset for any occasion and ensure everything you find in the Creator Store is safe to use. We have also heard your feedback about Creator Store monetization, and will be rolling out a plan to improve earnings for asset creators.{listStart}{listItemStart}{boldStart}List View Beta{boldEnd} - Making it easier to browse large asset collections in Toolbox. (On hold){listItemEnd}{listItemStart}{boldStart}Additional Spam & Plagiarism Protections{boldEnd} - More rigorous plagiarism detection and punishments for repeat offenders. (Mid 2024){listItemEnd}{listItemStart}{boldStart}Personalized Asset Recommendations{boldEnd} - Discover assets based on the content in your experience. Launched but was paused due to scalability issues and deprioritized. (On hold){listItemEnd}{listItemStart}{boldStart}Improved Asset Previews & Social Links on Creator Store{boldEnd} - We will enable social links (including GitHub, YouTube, etc.) for Creator Store Assets. We will also be adding additional images for Models & MeshParts. We will also be enabling presentation of higher resolution images. (Mid 2024){listItemEnd}{listEnd}",
    "Description.SafetyAndModeration2024AugustUpdate": "Our safety features, tools, and moderation capabilities have been built into the design of our product. We are continuing to work to make those capabilities smarter and stronger over time and will be investing more heavily in the detection and prevention of in-experience exploits. {listStart}{listItemStart}{boldStart}Ads brand safety and suitability controls{boldEnd} - Give advertisers brand safety and suitability controls for Immersive Ads to give more control over where their ads will be shown. ({expandedPublisherEligibilityBrandSuitabilityLinkStart}Live{expandedPublisherEligibilityBrandSuitabilityLinkEnd}){listItemEnd}{listItemStart}{boldStart}Moderation Precision{boldEnd} - We are working hard to lessen the burden of asset moderation while keeping the community safe. (Ongoing){listItemEnd}{listItemStart}{boldStart}Alt-Account Detection{boldEnd} - Take action on repeat offenders and help us combat exploiters on Roblox. ({banApiAltAccountDetectionLinkStart}Live{banApiAltAccountDetectionLinkEnd}){listItemEnd}{listItemStart}{boldStart}Rights Manager (formerly Tools to manage Intellectual Property){boldEnd} - New centralized place for developers to easily manage the intellectual property rights of their creations. ({rightsManagerLinkStart}Live{rightsManagerLinkEnd}){listItemEnd}{listItemStart}{boldStart}Ban API{boldEnd} - Allows creators to temporarily or permanently ban bad actors from their experience if they violate the established guidelines for that experience. ({banApiAltAccountDetectionLinkStart}Live{banApiAltAccountDetectionLinkEnd}){listItemEnd}{listEnd}",
    "Description.LearnConnectCreate2024AugustUpdate": "Creation on Roblox is constantly evolving, and we strive to make it easy for users of all skill levels to learn and grow with the platform. In the coming year, we'll improve our documentation coverage and quality, expand our learning series, grow our Creator Events program, and support creators who are making next generation experiences.{listStart}{listItemStart}{boldStart}Docs Available in Studio{boldEnd} - Access advice and code samples directly from Studio. (Late 2024){listItemEnd}{listItemStart}{boldStart}Staff Articles in Dev Forum (Formerly Experts in Dev Forum){boldEnd} - Roblox staff can create articles and guides in Dev Forum about existing features, platform insights, and more. This is a new genre of information to share with creators beyond feature announcements and canonical documentation. ({staffArticlesLinkStart}Live{staffArticlesLinkEnd}){listItemEnd}{listItemStart}{boldStart}Updated Experience Templates{boldEnd} - Re-releasing some experience templates with much needed updates. Launched Racing template ({studioRacingTemplateLinkStart}live{studioRacingTemplateLinkEnd}), Laser Tag template ({studioLaserTagTemplateLinkStart}live{studioLaserTagTemplateLinkEnd}), and Platformer template ({studioPlatformerTemplateLinkStart}live{studioPlatformerTemplateLinkEnd}). More templates coming in later this year. (Early 2024){listItemEnd}{listItemStart}{boldStart}Tutorials in-Studio{boldEnd} - New Roblox-created tutorials for new and growing creators. Tutorials can be found through Studio Start and followed without leaving Studio. (2024){listItemEnd}{listItemStart}{boldStart}Creator Fund (formerly Game Fund){boldEnd} - Supporting creators who want to build the next generation of Roblox experiences with a $35 million investment. (Ongoing){listItemEnd}{listEnd}",
    "Description.Insight2024AugustUpdate": "Many top Roblox creators already use analytics to grow their experiences, but data can be overwhelming. We want to offer everyone the power of a trusted data analyst, to help you interpret complicated data patterns and know what actions to take next.{listStart}{listItemStart}{boldStart}Session Time for New vs. Returning Users{boldEnd} - See session time split by new and returning users. Monitor session time drop off (e.g., 30% of your new users dropped off 30 sec in). ({newReturningUserSessionTimeLinkStart}Live{newReturningUserSessionTimeLinkEnd}){listItemEnd}{listItemStart}{boldStart}In Game Economy and Funnel Tracking (formerly Standard Event Schema){boldEnd} - Instrument schema to unlock funnel charts such as level progression and economy source vs. sink. ({analyticsTrackFunnelLinkStart}Live{analyticsTrackFunnelLinkEnd}){listItemEnd}{listItemStart}{boldStart}Data Export API{boldEnd} - On hold to prioritize custom events first based on creator feedback. (On hold){listItemEnd}{listItemStart}{boldStart}Custom Analytics Events{boldEnd} - Track custom analytics events in your experience. (Late 2024){listItemEnd}{listItemStart}{boldStart}External Acquisition Source{boldEnd} - Generate a unique URL and track acquisition metrics for it. (Late 2024){listItemEnd}{listItemStart}{boldStart}Improved Insights and Benchmarks{boldEnd} - Give you transparency around discovery and help you take action to grow your experience. (Ongoing){listItemEnd}{listEnd}",
    "Description.Collaborate2024AugustUpdate": "Most top experiences are developed by teams, and Roblox wants to make it even easier for you to collaborate. Talent Hub will help you connect with people to grow your team, and we are re-building 'Groups' from the ground up to make it easier to manage permissions.{listStart}{listItemStart}{boldStart}Self-serve Experience Ownership Transfer{boldEnd} - Free, self-service experience transfer from account to group. (2024){listItemEnd}{listItemStart}{boldStart}Creator Groups in Creator Hub{boldEnd} - Assign more specific permissions to roles, provide multiple roles to a member, and add collaborators with a new invite flow. ({groupsInCreatorHubLinkStart}Live{groupsInCreatorHubLinkEnd}){listItemEnd}{listItemStart}{boldStart}Overhauled Group Revenue{boldEnd} - Pay out collaborators directly within Creator Hub, and define more granular percentage splits by revenue source rather than total Group revenue. ({groupRevenueInCreatorHubLinkStart}Live{groupRevenueInCreatorHubLinkEnd}){listItemEnd}{listItemStart}{boldStart}Groups owning Groups{boldEnd} - Set up more complicated hierarchies with your collaborators by managing groups owned by your primary group. (Late 2024){listItemEnd}{listItemStart}{boldStart}Asset Privacy and Permissions: Audio and Video{boldEnd} - Sharing audio & video assets with friends. ({assetPrivacyLinkStart}Live{assetPrivacyLinkEnd}){listItemEnd}{listItemStart}{boldStart}Asset Privacy and Permissions: Audio and Video{boldEnd} - Sharing audio & video assets with groups. (Mid 2024){listItemEnd}{listItemStart}{boldStart}Asset Privacy and Permissions: Animations{boldEnd} - Sharing animations with friends and groups. (Mid 2025){listItemEnd}{listItemStart}{boldStart}Asset Privacy and Permissions: Meshes, Images, Models and Packages{boldEnd} - Privacy and sharing with friends & groups for meshes, mesh parts, decals, images, models & packages. (Early 2025){listItemEnd}{listItemStart}{boldStart}Asset Privacy and Permissions: Limited Access Beta for Meshes, Images, Models and Packages{boldEnd} - Privacy and sharing with friends & groups for meshes, mesh parts, decals, images, models & packages. ({assetPrivacyMeshesLinkStart}Live{assetPrivacyMeshesLinkEnd}){listItemEnd}{listItemStart}{boldStart}Asset Management: Revamped asset manager Open Beta{boldEnd} - Launching a revamped Asset Manager in Studio. Enable users to easily organize (folders/labels) and search assets in their accounts and their groups' accounts.  We'll be deprecating the existing Asset Manager and migrating user inventory out of Toolbox into the new Asset Manager, and Toolbox will become solely focused on Creator Store content. Q4 launch: Open Beta (Late 2024){listItemEnd}{listItemStart}{boldStart}Asset Management: Revamped asset manager full launch{boldEnd} - Full launch of revamped asset manager. New features; Folders (or labels). (Mid 2025){listItemEnd}{listEnd}",
    "Description.Personalization2024AugustUpdate": "It's important to know what's going on with your assets, experiences, collaborators, and the platform at large. This information allows you to take the right actions at the right time, and we want to make it even simpler to take advantage of insights and customize them. {listStart}{listItemStart}{boldStart}Expanded Notifications{boldEnd} - Get informed about critical events like a spike in crash rates, a collaboration invite, or a 'right to be forgotten' request. (Ongoing){listItemEnd}{listItemStart}{boldStart}Notifications in Creator Hub{boldEnd} - Easily stay informed about important updates anywhere on Creator Hub with notifications. ({creatorHubNotificationsLinkStart}Live{creatorHubNotificationsLinkEnd}){listItemEnd}{listEnd}"
}