{
    "Heading.RobloxCreatorRoadmap": "Roblox Creator Roadmap",
    "Description.MetadataDescription": "Preview new features and capabilities coming soon to Roblox. Get a glimpse into and help shape the future of the platform.",
    "Heading.CreatorRoadMap": "Creator Roadmap",
    "Description.CreatorRoadMap": "We are focused on providing you with solutions to make creation easier and more immersive. Use this roadmap to get a preview of some of the new features and capabilities coming soon to Roblox.",
    "Description.Disclaimer": "Disclaimer: The Creator Roadmap is not a comprehensive list of all upcoming features, and the details of the proposed features may change or some may not launch at all. Launch windows, e.g. (Mid 2023), are approximate and subject to change.",
    "Label.LastUpdated": "Last Updated: September 2023",
    "Heading.CreateHoweverYouWant": "Create however you want",
    "Description.CreateHoweverYouWant": "We aim to make it easy and intuitive for everyone to express themselves. Whether you're building experiences or designing accessories, we'll support more ways for you to create.",
    "Heading.EasyCreation": "Easy creation, optimized for your ideal workflows",
    "Description.EasyCreation": "Our vision is to provide powerful, flexible workflows for creators to build next-generation immersive 3D experiences and user-generated content (UGC). We are building a foundation that will make it easier than ever to create high quality content, while adding flexibility to your day-to-day tasks. We are also exploring ways we can open the platform in a stable, supported, and future-proof way and will be holding several 'Office Hours' sessions in the near future to share more and answer your questions. {listStart}{listItemStart}{boldStart}{selectionLinkStart}Selection Improvements{selectionLinkEnd}, {explorerLinkStart}Explorer Search Filter{explorerLinkEnd}, and {multiCursorLinkStart}Multi-Cursor{multiCursorLinkEnd} in Script Editor{boldEnd} - Full release thanks to your beta {listItemEnd}{listItemStart}{boldStart}Drag Detectors Beta{boldEnd} - Make objects in your experience draggable and interactive without scripting (Mid 2023){listItemEnd}{listItemStart}{boldStart}Camera Speed and Rotation{boldEnd} - Easier control while moving the camera (Mid 2023){listItemEnd}{listItemStart}{boldStart}Next Generation Studio Ribbon{boldEnd} - A completely redesigned Studio Ribbon with easy access to the tools and plugins that best match your unique workflows (Late 2023){listItemEnd}{listItemStart}{boldStart}Live Scripting Beta{boldEnd} - Script collaboratively with streamlined version history, like editing a cloud document with your team (Late 2023){listItemEnd}{listItemStart}{boldStart}Window Context Cues{boldEnd} - See the Place name in addition to your current tab name in the Studio window title (Late 2023){listItemEnd}{listItemStart}{boldStart}Better Support for Your Tools and Workflows{boldEnd} - Upcoming support for your preferred tools and workflows to promote efficient creation, including any external software you may use, starting with glTF support (Ongoing){listItemEnd}{listEnd}",
    "Heading.StudioBugs": "Studio will address long-standing bugs and pain points",
    "Description.StudioBugs": "Studio is a professional tool supporting long periods of sustained creation. We are investing heavily in both bug fixes and quality of life improvements that will make Studio more functional and reliable.{listStart}{listItemStart}{boldStart}Studio Docking{boldEnd} - Improved widget docking thanks to your feedback (Mid 2023){listItemEnd}{listItemStart}{boldStart}Faster Play Launch Times{boldEnd} - Test your experience in less than 2 seconds (Mid 2023){listItemEnd}{listItemStart}{boldStart}Improve Team Create Join Time{boldEnd} - Start working on your experience, of any size, faster (Late 2023){listItemEnd}{listItemStart}{boldStart}Terrain Customization{boldEnd} - Adding the ability to customize the height of grass (Mid 2023){listItemEnd}{listItemStart}{boldStart}Script Editor{boldEnd} - Better general performance in large code bases and for operations like find/replace all (Mid 2023){listItemEnd}{listItemStart}{boldStart}Script Diff Window{boldEnd} - Additions like side-by-side view, copy/paste, 1-click merge, and edits in recovery mode (Mid 2023){listItemEnd}{listItemStart}{boldStart}Custom Logging{boldEnd} - Allowing you to pass error locations through pcalls (Late 2023){listItemEnd}{listEnd}",
    "Heading.CreateWorlds": "Create rich and lifelike worlds",
    "Description.CreateWorlds": "We are releasing aerodynamic simulation as our first fluid dynamics force, enabling completely new types of physically-accurate content. We're also significantly improving Future lighting's performance so that we can enable it on Android and make it our default lighting model.{listStart}{listItemStart}{boldStart}Global Wind{boldEnd} - A new property to add more richness to your worlds with grass, clouds, and even falling leaves that move with the wind (Mid 2023){listItemEnd}{listItemStart}{boldStart}Lift and Drag Beta{boldEnd} - Aerodynamic properties, such as air density, to better simulate flight for objects like wingsuits (Mid 2023){listItemEnd}{listItemStart}{boldStart}Future Lighting Android Beta{boldEnd} - Future lighting model available as a beta feature on Android devices (Mid 2023){listItemEnd}{listItemStart}{boldStart}Future Lighting Studio Default{boldEnd} - Future lighting as the default lighting model, boosting the visual quality of experiences for more creators (Late 2023){listItemEnd}{listEnd}",
    "Heading.CloudCreation": "Cloud creation improves collaboration and reliability",
    "Description.CloudCreation": "Large, lifelike worlds will require heavy computational power and vast amounts of storage to create. Offloading these needs to the cloud will ensure that you can reliably create megascale experiences without disruption, while collaborating with teams of any size.{listStart}{listItemStart}{boldStart}Team Create Invitations{boldEnd} - See invite notifications and share URLs to send collaborators directly to your Place in Studio (Mid 2023){listItemEnd}{listItemStart}{boldStart}Collaborator Activity{boldEnd} - View who's actively contributing to your experiences from the Start page (Mid 2023){listItemEnd}{listItemStart}{boldStart}Team Create Assets{boldEnd} - Access newly uploaded assets without needing to restart (Mid 2023){listItemEnd}{listItemStart}{boldStart}Studio Reconnection{boldEnd} - Automatically reconnect after a temporary connectivity loss (Late 2023){listItemEnd}{listItemStart}{boldStart}Enhance Drafts{boldEnd} - Collaborative Edit for scripts with better data management (Late 2023){listItemEnd}{listEnd}",
    "Heading.GenerativeAI": "Generative AI accelerates creation",
    "Description.GenerativeAI": "Roblox is building Generative AI tools to scale your creation efforts and let you focus on the aspects that matter most. This technology will help you build faster, iterate more, and augment your skills to create even better content. These are the features currently available in open beta. Please share your feedback in the following forum posts to help us prioritize bug fixes and improvements.{listStart}{listItemStart}{boldStart}{generatorLinkStart}Material Generator{generatorLinkEnd} Full Release{boldEnd} - Quickly generate visually-compelling materials using natural language (Late 2023){listItemEnd}{listItemStart}{boldStart}{assistLinkStart}Code Assist{assistLinkEnd} Full Release{boldEnd} - Powerful code generation tool for both experienced and new scripters (Late 2023){listItemEnd}{listEnd}",
    "Heading.AvatarCreation": "Avatar creation and Marketplace",
    "Description.AvatarCreation": "Avatars are a core part of Roblox. From using them to communicate to creating your own, our avatar features mimic real-life communication, empower self-expression, and drive creation. Here are some of the features we are enabling to create a community-led Marketplace where any creator can make an avatar that is expressive, communicative, and personalized:{listStart}{listItemStart}{boldStart}glTF File Support{boldEnd} - Import avatar rigs in standard formats (Mid 2023){listItemEnd}{listItemStart}{boldStart}Improved Avatar Face and Body Tooling{boldEnd} - Enhancing how you can import, create, and publish avatar assets (Late 2023){listItemEnd}{listItemStart}{boldStart}Bodies and Animated Faces{boldEnd} - Members of the {ugcLinkStart}UGC Program{ugcLinkEnd} and later all creators will be able to create items in the Marketplace including bodies and animated faces (Mid 2023){listItemEnd}{listItemStart}{boldStart}Community-led Marketplace{boldEnd} - Everyone can publish avatar items to the Marketplace, including {limitedsLinkStart}Limiteds{limitedsLinkEnd} (Late 2023){listItemEnd}{listEnd}",
    "Heading.GrowAudience": "Grow and engage your audience",
    "Description.GrowAudience": "Did you know that 100 of the top 150 experiences were created last year? We're making it easier for new experiences to build a global audience and giving you tools to engage and retain users.",
    "Heading.RobloxHome": "Roblox Home page connects you to your ideal audience",
    "Description.RobloxHome": "The Roblox Home page connects people with experiences that they will love, and will help you find your ideal audience. Every user's Home page connects them to new experiences through a state-of-the-art recommendation engine. We aim to make it easier for every Roblox experience to engage and grow their user base by recommending the experience to the right audience.{listStart}{listItemStart}{boldStart}Continuous Home{boldEnd} - Improving discovery on the Home page through an extended, continually scrollable feed (Mid 2023){listItemEnd}{listItemStart}{boldStart}Social and Contextual Descriptors{boldEnd} - Labels like Friend presence in the experience and Genre to distinguish different types of experiences on the Home page (Late 2023){listItemEnd}{listItemStart}{boldStart}Recommendation Algorithm Improvements{boldEnd} - Enabling up-and-coming experiences to reach their audience faster (Ongoing){listItemEnd}{listEnd}",
    "Heading.PowerfulSearch": "Powerful search and browse capabilities",
    "Description.PowerfulSearch": "We're empowering users to explore a variety of content that matches their interests and passions, and be able to find anything that exists on Roblox. These improved discovery tools will deliver more relevant traffic to your experience and help new experiences get discovered more quickly.{listStart}{listItemStart}{boldStart}Dynamic Filters{boldEnd} - A community-requested feature that will enable users to find your experience based on genre or tag (Mid 2023){listItemEnd}{listItemStart}{boldStart}Algorithmically-Generated Categories and Sorts{boldEnd} - Highlighting new, high quality, and trending experiences (Mid 2023){listItemEnd}{listItemStart}{boldStart}Combined Search & Discovery{boldEnd} - Merging Discover functionality with Search to simplify navigation. Search, browse, and filter all in one place (Mid 2023){listItemEnd}{listItemStart}{boldStart}Semantic Similarity Search{boldEnd} - Improving results through context, especially for non-english queries (Mid 2023){listItemEnd}{listEnd}",
    "Heading.Matchmaking": "Match your users to the best server",
    "Description.Matchmaking": "Matchmaking is at the heart of Roblox's vision for connecting people. We abstract away the complexity of game server management and use signals like friends, latency, language, age, and server occupancy to direct users to the server most likely to maximize engagement.{listStart}{listItemStart}{boldStart}Improved Scalability{boldEnd} - Better support for large traffic spikes (Mid 2023){listItemEnd}{listItemStart}{boldStart}Auto-Reconnect{boldEnd} - Connect players to the same server following an update (Late 2023){listItemEnd}{listItemStart}{boldStart}Flexible Join Destination{boldEnd} - Send your users to non-root places when they join (Late 2023){listItemEnd}{listItemStart}{boldStart}Friend Invites{boldEnd} - Groups of friends can easily connect to the same server (Late 2023){listItemEnd}{listEnd}",
    "Heading.Notifications": "Re-engage your community through notifications",
    "Description.Notifications": "{linkStart}Developer-driven Invites{linkEnd} are a new way to customize and improve the invite experience for users, and some creators are already reporting a 10x increase in players joining their friends. We aim to make it even easier for you to reach your community, and help you optimize the value of each notification.{listStart}{listItemStart}{boldStart}Real-Time Experience Invites{boldEnd} - Send invitations to players who are currently active on Roblox ({liveLinkStart}Live{liveLinkEnd}){listItemEnd}{listItemStart}{boldStart}Notification Analytics{boldEnd} - Additional aggregated data provided via Creator Analytics (Late 2023){listItemEnd}{listItemStart}{boldStart}Universal Experience Notifications API{boldEnd} - Create any kind of notification for your experiences, beyond just invites (Late 2023){listItemEnd}{listItemStart}{boldStart}Notification Insights{boldEnd} - Automated suggestions to help improve the efficiency of your messages (2024){listItemEnd}{listEnd}",
    "Heading.LanguageBarriers": "Break down language barriers",
    "Description.LanguageBarriers": "We strive to empower all our users to communicate with one another, regardless of language. By dissolving communication barriers, Roblox will help your community stay more closely connected, which will lead to increased engagement.{listStart}{listItemStart}{boldStart}Automatic Chat Translations{boldEnd} - In-experience chat automatically translated to supported languages (Late 2023){listItemEnd}{listItemStart}{boldStart}In-Experience Translation Feedback{boldEnd} - Allow users to share suggestions on ways you can improve your localization quality (Late 2023){listItemEnd}{listItemStart}{boldStart}Translated Documentation{boldEnd} - Adding support for 7 languages (including Spanish, Portuguese, Japanese) so you can read in your preferred language (Mid 2023){listItemEnd}{listItemStart}{boldStart}New Regions{boldEnd} - Support for seven new locales on platform by the end of the year (Late 2023){listItemEnd}{listEnd}",
    "Heading.GrowingCreator": "Benefit from a growing creator ecosystem",
    "Description.GrowingCreator": "We will support you with a thriving ecosystem that simplifies the challenging aspects of creation. These offerings will enhance your productivity, maintain a safe and civil platform, and offer you new ways to earn.",
    "Heading.CreatorHubSuccess": "Creator Hub is your key to success",
    "Description.CreatorHubSuccess": "We're equipping you with all the information you need to maximize your success with open-source  documentation, actionable recommendations to grow your experience, and timely notifications when your attention is needed.",
    "Heading.ComingSoon": "Coming Soon",
    "Description.ComingIn": "in {comingIn} week",
    "Description.ComingInPlural": "in {comingIn} weeks",
    "Heading.JoinTheCommunity": "Join The Community ",
    "Description.JoinTheCommunity": "The Forum is a collaborative resource where you can read about new features, share your input on upcoming features, and connect with other creators. Join in on the discussions and help shape the future of creation on Roblox.",
    "Label.DiscusRoadMap": "Learn More on the Forum",
    "Action.DiscussOnForum": "Discuss on forum",
    "Heading.RobloxCloud": "Roblox Cloud helps you scale",
    "Description.RobloxCloud": "{linkStart}Roblox Cloud{linkEnd} will support a broader application ecosystem through a set of flexible and secure web APIs. We envision a world where you'll be able to automate workflows through scripts, publish via the command line, or create bots to help manage your community.{listStart}{listItemStart}{boldStart}OAuth2 Public Release{boldEnd} - Log in to third-party services (eg analytics or community management bots) using your Roblox account (Mid 2023){listItemEnd}{listItemStart}{boldStart}Inventory API{boldEnd} - Check if a user owns an item (Mid 2023){listItemEnd}{listItemStart}{boldStart}Group API{boldEnd} - A new way to manage groups (Mid 2023){listItemEnd}{listItemStart}{boldStart}Simplify 'Right to be Forgotten' (GDPR) Process{boldEnd} - Reference solution that uses Webhooks and Open Cloud Data Store APIs to automatically process incoming requests (Mid 2023){listItemEnd}{listItemStart}{boldStart}Cloud Service Management{boldEnd} - Additional visibility and customization for services like Memory Stores (Late 2023){listItemEnd}{listItemStart}{boldStart}Universe APIs{boldEnd} - Update the metadata, such as the description, for your experience (Early 2024){listItemEnd}{listEnd}",
    "Heading.AccelerateCreation": "Accelerate creation",
    "Description.AccelerateCreation": "Creator Marketplace contains millions of high-quality assets, but it's not always easy to find them. We aim to connect you with the perfect asset for any occasion and ensure everything you find in the Creator Marketplace is safe to use. We have also heard your feedback about Creator Marketplace monetization, and are working hard on a plan to improve earnings for asset creators.{listStart}{listItemStart}{boldStart}Richer Audio Discovery{boldEnd} - Category support in Studio and Web (Mid 2023){listItemEnd}{listItemStart}{boldStart}Improved Search{boldEnd} - Find assets using descriptive language like 'red convertible car' or 'ambient restaurant sounds' (Mid 2023){listItemEnd}{listItemStart}{boldStart}List View Beta{boldEnd} - Making it easier to browse large asset collections in Toolbox (Late 2023){listItemEnd}{listItemStart}{boldStart}Additional Spam & Plagiarism Protections{boldEnd} - More rigorous plagiarism detection and punishments for repeat offenders (Late 2023){listItemEnd}{listItemStart}{boldStart}Personalized Asset Recommendations{boldEnd} - Discover assets based on the content in your experience (Late 2023){listItemEnd}{listEnd}",
    "Heading.SafetyAndModeration": "Balanced safety and moderation",
    "Description.SafetyAndModeration": "Our safety features, tools, and moderation capabilities have been built into the design of our product. We are continuing to work to make those capabilities smarter and stronger over time and will be investing more heavily in the detection and prevention of in-experience exploits.{listStart}{listItemStart}{boldStart}Moderation Precision{boldEnd} - We are working hard to lessen the burden of asset moderation while keeping the community safe (Ongoing){listItemEnd}{listItemStart}{boldStart}Anti-Cheat{boldEnd} - Improving client-side and server-side anti-cheat, and giving you more ways to identify and block cheaters using {linkStart}Byfron's technology{linkEnd} (Mid 2023){listItemEnd}{listItemStart}{boldStart}Alt-Account Detection{boldEnd} - Take action on repeat offenders and help us combat exploiters on Roblox (Late 2023){listItemEnd}{listItemStart}{boldStart}Relaxed Text Filter{boldEnd} - Optionally adjust rules for experiences that are rated 13+ (Late 2023){listItemEnd}{listEnd}",
    "Heading.EarnAndAdvertise": "More ways to earn and advertise",
    "Description.EarnAndAdvertise": "We recently introduced {linkStart}Immersive Ads{linkEnd}, which allow developers to place high-quality, native ad units in their experience. These innovative ad units offer a new way for you to publish and earn from advertisements.{listStart}{listItemStart}{boldStart}Immersive Ads{boldEnd} - Providing a new path for you to monetize your experiences. We expect CPMs to increase as more advertisers participate and more developers serve ads in their experiences (Early 2023){listItemEnd}{listItemStart}{boldStart}Ads Manager{boldEnd} - Create Immersive Ads with our self-serve Ads Manager tool for ad creation, management, reporting and billing (Mid 2023){listItemEnd}{listItemStart}{boldStart}Sponsored Ads Improvements{boldEnd} - Better targeting, reporting, and delivery for your sponsored ads (2024){listItemEnd}{listEnd}",
    "Heading.LearnConnectCreate": "Learn, connect, and create with one another",
    "Description.LearnConnectCreate": "Creation on Roblox is constantly evolving, and we strive to make it easy for users of all skill levels to learn and grow with the platform. In the coming year, we'll improve our documentation coverage and quality, expand our {levelUpLinkStart}Level Up{levelUpLinkEnd} series, grow our Creator events program, and support Creators who are making next generation experiences.{listStart}{listItemStart}{boldStart}Tutorials{boldEnd} - Learn with tutorials and reference projects for building, scripting, and 3D Art. (Mid 2023){listItemEnd}{listItemStart}{boldStart}Open-Source Documentation{boldEnd} - Anyone in the community will be able to contribute to Creator Documentation (Late 2023){listItemEnd}{listItemStart}{boldStart}Docs Available in Studio{boldEnd} - Access advice and code samples directly from Studio (Late 2023){listItemEnd}{listItemStart}{boldStart}{gameFundLinkStart}Game Fund{gameFundLinkEnd}{boldEnd} - Supporting creators who want to build the next generation of Roblox experiences with a $35 million investment (Ongoing){listItemEnd}{listEnd}",
    "Heading.Insight": "Actionable insights to grow your experience",
    "Description.Insight": "Many top Roblox creators already use analytics to grow their experiences, but data can be overwhelming. We want to offer everyone the power of a trusted data analyst, to help you interpret complicated data patterns and know what actions to take next.{listStart}{listItemStart}{boldStart}Performance Monitoring{boldEnd} - See live user stats, frame rate, memory usage, and more (Mid 2023){listItemEnd}{listItemStart}{boldStart}Actionable Insights{boldEnd} - Celebrate new milestones and identify opportunities to grow your experience, along with personalized advice (Mid 2023){listItemEnd}{listItemStart}{boldStart}Error Reporting{boldEnd} - Identify and fix issues with the help of Lua error reports (Mid 2023){listItemEnd}{listItemStart}{boldStart}In-Experience Schema{boldEnd} - Instrument to unlock funnels and level progression (Late 2023){listItemEnd}{listItemStart}{boldStart}API Support{boldEnd} - A new Open Cloud API for direct, easy access to analytics data (2024){listItemEnd}{listEnd}",
    "Heading.Personalization": "Notifications and personalization keep you informed",
    "Description.Personalization": "It's important to know what's going on with your assets, experiences, collaborators, and the platform at large. This information allows you to take the right actions at the right time, and we want to make it even simpler to take advantage of insights and customize them.{listStart}{listItemStart}{boldStart}Expanded Notifications{boldEnd} - Get informed about critical events like a spike in crash rates, a collaboration invite, or a 'right to be forgotten' request (Ongoing){listItemEnd}{listItemStart}{boldStart}Creator Hub Homepage{boldEnd} - View everything important to you—such as experience management, top-line analytics, and more—together, in one view (Mid 2023){listItemEnd}{listItemStart}{boldStart}Expanded Creator Hub Homepage{boldEnd} - Personalized insights unique to you from across all of Creator Hub. This includes: analytical insights, Talent Hub applications, Forum responses, and more, as well as light mode! (Late 2023){listItemEnd}{listItemStart}{boldStart}Creator Notifications in Studio{boldEnd} - Access notifications directly from Studio, and support new use cases like collaboration invitations (Late 2023){listItemEnd}{listEnd}",
    "Heading.Collaborate": "Collaborate more efficiently as a team",
    "Description.Collaborate": "Most top experiences are developed by teams, and Roblox wants to make it even easier for you to collaborate. Talent Hub will help you connect with people to grow your team, and we are re-building ‘Groups' from the ground up to make it easier to manage permissions.{listStart}{listItemStart}{boldStart}Reputation Ranking in Talent Hub{boldEnd} - See more listings from reputable employers and creators (Mid 2023){listItemEnd}{listItemStart}{boldStart}Experience Ownership Transfer{boldEnd} - Transfer ownership to another individual or team (Mid 2023){listItemEnd}{listItemStart}{boldStart}Organizations and Permissions{boldEnd} - Assign specific Experience-access permissions to collaborators, like limiting analytics access to error reporting (Late 2023){listItemEnd}{listItemStart}{boldStart}Asset Privacy and Permissions{boldEnd} -  Enable asset privacy, sharing, & collaboration capabilities for all asset types (2024){listItemEnd}{listEnd}",
    "Description.EasyCreationV2": "Our vision is to provide powerful, flexible workflows for creators to build next-generation immersive 3D experiences and user-generated content (UGC). We are building a foundation that will make it easier than ever to create high quality content, while adding flexibility to your day-to-day tasks. We are also exploring ways we can open the platform in a stable, supported, and future-proof way and will be holding several 'Office Hours' sessions in the near future to share more and answer your questions. {listStart}{listItemStart}{boldStart}{selectionLinkStart}Selection Improvements{selectionLinkEnd}, {explorerLinkStart}Explorer Search Filter{explorerLinkEnd}, and {multiCursorLinkStart}Multi-Cursor{multiCursorLinkEnd} in Script Editor{boldEnd} - Full release thanks to your beta {listItemEnd}{listItemStart}{boldStart}Drag Detectors Beta{boldEnd} - Make objects in your experience draggable and interactive without scripting ({dragDetectorsLinkStart}Live{dragDetectorsLinkEnd}){listItemEnd}{listItemStart}{boldStart}Camera Speed and Rotation{boldEnd} - Easier control while moving the camera (Mid 2023){listItemEnd}{listItemStart}{boldStart}Next Generation Studio Ribbon{boldEnd} - A completely redesigned Studio Ribbon with easy access to the tools and plugins that best match your unique workflows (Late 2023){listItemEnd}{listItemStart}{boldStart}Live Scripting Beta{boldEnd} - Script collaboratively with streamlined version history, like editing a cloud document with your team (Late 2023){listItemEnd}{listItemStart}{boldStart}Window Context Cues{boldEnd} - See the Place name in addition to your current tab name in the Studio window title (Late 2023){listItemEnd}{listItemStart}{boldStart}Better Support for Your Tools and Workflows{boldEnd} - Upcoming support for your preferred tools and workflows to promote efficient creation, including any external software you may use, starting with glTF support (Ongoing){listItemEnd}{listEnd}",
    "Description.CreateWorldsV2": "We are releasing aerodynamic simulation as our first fluid dynamics force, enabling completely new types of physically-accurate content. We're also significantly improving Future lighting's performance so that we can enable it on Android and make it our default lighting model.{listStart}{listItemStart}{boldStart}Global Wind{boldEnd} - A new property to add more richness to your worlds with grass, clouds, and even falling leaves that move with the wind ({globalWindLinkStart}Live{globalWindLinkEnd}){listItemEnd}{listItemStart}{boldStart}Lift and Drag Beta{boldEnd} - Aerodynamic properties, such as air density, to better simulate flight for objects like wingsuits (Mid 2023){listItemEnd}{listItemStart}{boldStart}Future Lighting Android Beta{boldEnd} - Future lighting model available as a beta feature on Android devices (Mid 2023){listItemEnd}{listItemStart}{boldStart}Future Lighting Studio Default{boldEnd} - Future lighting as the default lighting model, boosting the visual quality of experiences for more creators (Late 2023){listItemEnd}{listEnd}",
    "Description.RobloxCloudV2": "{linkStart}Roblox Cloud{linkEnd} will support a broader application ecosystem through a set of flexible and secure web APIs. We envision a world where you'll be able to automate workflows through scripts, publish via the command line, or create bots to help manage your community.{listStart}{listItemStart}{boldStart}OAuth2 Public Release{boldEnd} - Log in to third-party services (eg analytics or community management bots) using your Roblox account ({oauth2LinkStart}Live{oauth2LinkEnd}){listItemEnd}{listItemStart}{boldStart}Inventory API{boldEnd} - Check if a user owns an item (Mid 2023){listItemEnd}{listItemStart}{boldStart}Group API{boldEnd} - A new way to manage groups (Mid 2023){listItemEnd}{listItemStart}{boldStart}Simplify 'Right to be Forgotten' (GDPR) Process{boldEnd} - Reference solution that uses Webhooks and Open Cloud Data Store APIs to automatically process incoming requests ({GDPRLinkStart}Live{GDPRLinkEnd}){listItemEnd}{listItemStart}{boldStart}Cloud Service Management{boldEnd} - Additional visibility and customization for services like Memory Stores (Late 2023){listItemEnd}{listItemStart}{boldStart}Universe APIs{boldEnd} - Update the metadata, such as the description, for your experience (Early 2024){listItemEnd}{listEnd}",
    "Description.EarnAndAdvertiseV2": "We recently introduced {linkStart}Immersive Ads{linkEnd}, which allow developers to place high-quality, native ad units in their experience. These innovative ad units offer a new way for you to publish and earn from advertisements.{listStart}{listItemStart}{boldStart}Immersive Ads{boldEnd} - Providing a new path for you to monetize your experiences. We expect CPMs to increase as more advertisers participate and more developers serve ads in their experiences ({immersiveAdsLinkStart}Live{immersiveAdsLinkEnd}){listItemEnd}{listItemStart}{boldStart}Ads Manager{boldEnd} - Create Immersive Ads with our self-serve Ads Manager tool for ad creation, management, reporting and billing ({adsManagerLinkStart}Live{adsManagerLinkEnd}){listItemEnd}{listItemStart}{boldStart}Sponsored Ads Improvements{boldEnd} - Better targeting, reporting, and delivery for your sponsored ads (2024){listItemEnd}{listEnd}",
    "Description.InsightV2": "Many top Roblox creators already use analytics to grow their experiences, but data can be overwhelming. We want to offer everyone the power of a trusted data analyst, to help you interpret complicated data patterns and know what actions to take next.{listStart}{listItemStart}{boldStart}Performance Monitoring{boldEnd} - See live user stats, frame rate, memory usage, and more ({performanceLinkStart}Live{performanceLinkEnd}){listItemEnd}{listItemStart}{boldStart}Actionable Insights{boldEnd} - Celebrate new milestones and identify opportunities to grow your experience, along with personalized advice (Mid 2023){listItemEnd}{listItemStart}{boldStart}Error Reporting{boldEnd} - Identify and fix issues with the help of Lua error reports (Mid 2023){listItemEnd}{listItemStart}{boldStart}In-Experience Schema{boldEnd} - Instrument to unlock funnels and level progression (Late 2023){listItemEnd}{listItemStart}{boldStart}API Support{boldEnd} - A new Open Cloud API for direct, easy access to analytics data (2024){listItemEnd}{listEnd}",
    "Action.ReadAnnouncement": "Read Latest Announcement",
    "Description.StudioBugsAugUpdate": "Studio is a professional tool supporting long periods of sustained creation. We are investing heavily in both bug fixes and quality of life improvements that will make Studio more functional and reliable.{listStart}{listItemStart}{boldStart}Studio Docking{boldEnd} - Improved widget docking thanks to your feedback (On-going){listItemEnd}{listItemStart}{boldStart}Faster Play Launch Times{boldEnd} - Test your experience in less than 2 seconds (Live){listItemEnd}{listItemStart}{boldStart}Improve Team Create Join Time{boldEnd} - Start working on your experience, of any size, faster (Late 2023){listItemEnd}{listItemStart}{boldStart}Terrain Customization{boldEnd} - Improvements to terrain editing ({terrainLinkStart}Live{terrainLinkEnd}), adding the ability to customize the height of grass (Late 2023){listItemEnd}{listItemStart}{boldStart}Script Editor{boldEnd} - Better general performance in large code bases and for operations like find/replace all (Live){listItemEnd}{listItemStart}{boldStart}Script Diff Window{boldEnd} - Additions like side-by-side view, copy/paste, 1-click merge, and edits in recovery mode (Late 2023){listItemEnd}{listItemStart}{boldStart}Custom Logging{boldEnd} - Allowing you to pass error locations through pcalls (Late 2023){listItemEnd}{listEnd}",
    "Description.CloudCreationAugUpdate": "Large, lifelike worlds will require heavy computational power and vast amounts of storage to create. Offloading these needs to the cloud will ensure that you can reliably create megascale experiences without disruption, while collaborating with teams of any size.{listStart}{listItemStart}{boldStart}Team Create Invitations{boldEnd} - See invite notifications and share URLs to send collaborators directly to your Place in Studio (Late 2023){listItemEnd}{listItemStart}{boldStart}Collaborator Activity{boldEnd} - View who's actively contributing to your experiences from the Start page (Late 2023){listItemEnd}{listItemStart}{boldStart}Team Create Assets{boldEnd} - Access newly uploaded assets without needing to restart (Late 2023){listItemEnd}{listItemStart}{boldStart}Studio Reconnection{boldEnd} - Automatically reconnect after a temporary connectivity loss (Live){listItemEnd}{listItemStart}{boldStart}Enhance Drafts{boldEnd} - Collaborative Edit for scripts with better data management (Late 2023){listItemEnd}{listEnd}",
    "Description.PowerfulSearchAugUpdate": "We're empowering users to explore a variety of content that matches their interests and passions, and be able to find anything that exists on Roblox. These improved discovery tools will deliver more relevant traffic to your experience and help new experiences get discovered more quickly.{listStart}{listItemStart}{boldStart}Dynamic Filters{boldEnd} - A community-requested feature that will enable users to find your experience based on genre or tag (On Hold){listItemEnd}{listItemStart}{boldStart}Algorithmically-Generated Categories and Sorts{boldEnd} - Highlighting new, high quality, and trending experiences (2024){listItemEnd}{listItemStart}{boldStart}Combined Search & Discovery{boldEnd} - Merging Discover functionality with Search to simplify navigation. Search, browse, and filter all in one place (2024){listItemEnd}{listItemStart}{boldStart}Semantic Similarity Search{boldEnd} - Improving results through context, especially for non-english queries (On-going){listItemEnd}{listEnd}",
    "Description.InsightAugUpdate": "Many top Roblox creators already use analytics to grow their experiences, but data can be overwhelming. We want to offer everyone the power of a trusted data analyst, to help you interpret complicated data patterns and know what actions to take next.{listStart}{listItemStart}{boldStart}Performance Monitoring{boldEnd} - See live user stats, frame rate, memory usage, and more ({performanceLinkStart}Live{performanceLinkEnd}){listItemEnd}{listItemStart}{boldStart}Actionable Insights{boldEnd} - Celebrate new milestones and identify opportunities to grow your experience, along with personalized advice (Mid 2023){listItemEnd}{listItemStart}{boldStart}Error Reporting{boldEnd} - Identify and fix issues with the help of Lua error reports ({errorReportingLinkStart}Live{errorReportingLinkEnd}){listItemEnd}{listItemStart}{boldStart}In-Experience Schema{boldEnd} - Instrument to unlock funnels and level progression (Late 2023){listItemEnd}{listItemStart}{boldStart}API Support{boldEnd} - A new Open Cloud API for direct, easy access to analytics data (2024){listItemEnd}{listEnd}",
    "Description.PersonalizationAugUpdate": "It's important to know what's going on with your assets, experiences, collaborators, and the platform at large. This information allows you to take the right actions at the right time, and we want to make it even simpler to take advantage of insights and customize them.{listStart}{listItemStart}{boldStart}Expanded Notifications{boldEnd} - Get informed about critical events like a spike in crash rates, a collaboration invite, or a 'right to be forgotten' request (Ongoing){listItemEnd}{listItemStart}{boldStart}Creator Hub Homepage{boldEnd} - View everything important to you—such as experience management, top-line analytics, and more—together, in one view ({creatorHubHomePageLinkStart}Live{creatorHubHomePageLinkEnd}){listItemEnd}{listItemStart}{boldStart}Expanded Creator Hub Homepage{boldEnd} - Personalized insights unique to you from across all of Creator Hub. This includes: analytical insights, Talent Hub applications, Forum responses, and more, as well as light mode! (Late 2023){listItemEnd}{listItemStart}{boldStart}Creator Notifications in Studio{boldEnd} - Access notifications directly from Studio, and support new use cases like collaboration invitations (Late 2023){listItemEnd}{listEnd}",
    "Description.CollaborateAugUpdate": "Most top experiences are developed by teams, and Roblox wants to make it even easier for you to collaborate. Talent Hub will help you connect with people to grow your team, and we are re-building ‘Groups' from the ground up to make it easier to manage permissions.{listStart}{listItemStart}{boldStart}Reputation Ranking in Talent Hub{boldEnd} - See more listings from reputable employers and creators ({talentHubRankingLinkStart}Live{talentHubRankingLinkEnd}){listItemEnd}{listItemStart}{boldStart}Experience Ownership Transfer{boldEnd} - Transfer ownership to another individual or team (Mid 2023){listItemEnd}{listItemStart}{boldStart}Organizations and Permissions{boldEnd} - Assign specific Experience-access permissions to collaborators, like limiting analytics access to error reporting (Late 2023){listItemEnd}{listItemStart}{boldStart}Asset Privacy and Permissions{boldEnd} -  Enable asset privacy, sharing, & collaboration capabilities for all asset types (2024){listItemEnd}{listEnd}",
    "Description.SafetyAndModerationAugUpdateV2": "Our safety features, tools, and moderation capabilities have been built into the design of our product. We are continuing to work to make those capabilities smarter and stronger over time and will be investing more heavily in the detection and prevention of in-experience exploits.{listStart}{listItemStart}{boldStart}Moderation Precision{boldEnd} - We are working hard to lessen the burden of asset moderation while keeping the community safe (Ongoing){listItemEnd}{listItemStart}{boldStart}Anti-Cheat{boldEnd} - Improving client-side and server-side anti-cheat, and giving you more ways to identify and block cheaters using {linkStart}Byfron's technology{linkEnd} (Live){listItemEnd}{listItemStart}{boldStart}Alt-Account Detection{boldEnd} - Take action on repeat offenders and help us combat exploiters on Roblox (Late 2023){listItemEnd}{listItemStart}{boldStart}Relaxed Text Filter{boldEnd} - Optionally adjust rules for experiences that are rated 13+ (Late 2023){listItemEnd}{listEnd}",
    "Description.AccelerateCreationAugUpdate": "Creator Marketplace contains millions of high-quality assets, but it's not always easy to find them. We aim to connect you with the perfect asset for any occasion and ensure everything you find in the Creator Marketplace is safe to use. We have also heard your feedback about Creator Marketplace monetization, and are working hard on a plan to improve earnings for asset creators.{listStart}{listItemStart}{boldStart}Richer Audio Discovery{boldEnd} -  Category support in Web (Live) and Studio (Late 2023){listItemEnd}{listItemStart}{boldStart}Improved Search{boldEnd} - Find assets using descriptive language like 'red convertible car' or 'ambient restaurant sounds' (Live){listItemEnd}{listItemStart}{boldStart}List View Beta{boldEnd} - Making it easier to browse large asset collections in Toolbox (Late 2023){listItemEnd}{listItemStart}{boldStart}Additional Spam & Plagiarism Protections{boldEnd} - More rigorous plagiarism detection and punishments for repeat offenders (Late 2023){listItemEnd}{listItemStart}{boldStart}Personalized Asset Recommendations{boldEnd} - Discover assets based on the content in your experience (Late 2023){listItemEnd}{listEnd}",
    "Description.EasyCreationAugUpdate": "Our vision is to provide powerful, flexible workflows for creators to build next-generation immersive 3D experiences and user-generated content (UGC). We are building a foundation that will make it easier than ever to create high quality content, while adding flexibility to your day-to-day tasks. We are also exploring ways we can open the platform in a stable, supported, and future-proof way and will be holding several 'Office Hours' sessions in the near future to share more and answer your questions. {listStart}{listItemStart}{boldStart}{selectionLinkStart}Selection Improvements{selectionLinkEnd}, {explorerLinkStart}Explorer Search Filter{explorerLinkEnd}, and {multiCursorLinkStart}Multi-Cursor{multiCursorLinkEnd} in Script Editor{boldEnd} - Full release thanks to your beta {listItemEnd}{listItemStart}{boldStart}Drag Detectors Beta{boldEnd} - Make objects in your experience draggable and interactive without scripting ({dragDetectorsLinkStart}Live{dragDetectorsLinkEnd}){listItemEnd}{listItemStart}{boldStart}Camera Speed and Rotation{boldEnd} - Easier control while moving the camera (Mid 2023){listItemEnd}{listItemStart}{boldStart}Next Generation Studio Ribbon{boldEnd} - A completely redesigned Studio Ribbon with easy access to the tools and plugins that best match your unique workflows (Late 2023){listItemEnd}{listItemStart}{boldStart}Live Scripting Beta{boldEnd} - Script collaboratively with streamlined version history, like editing a cloud document with your team (Late 2023){listItemEnd}{listItemStart}{boldStart}Window Context Cues{boldEnd} - See the Place name in addition to your current tab name in the Studio window title (On Hold){listItemEnd}{listItemStart}{boldStart}Better Support for Your Tools and Workflows{boldEnd} - Upcoming support for your preferred tools and workflows to promote efficient creation, including any external software you may use, starting with glTF support (Ongoing){listItemEnd}{listEnd}",
    "Description.CreateWorldsAugUpdate": "We are releasing aerodynamic simulation as our first fluid dynamics force, enabling completely new types of physically-accurate content. We're also significantly improving Future lighting's performance so that we can enable it on Android and make it our default lighting model.{listStart}{listItemStart}{boldStart}Global Wind{boldEnd} - A new property to add more richness to your worlds with grass, clouds, and even falling leaves that move with the wind ({globalWindLinkStart}Live{globalWindLinkEnd}){listItemEnd}{listItemStart}{boldStart}Lift and Drag Beta{boldEnd} - Aerodynamic properties, such as air density, to better simulate flight for objects like wingsuits (Mid 2023){listItemEnd}{listItemStart}{boldStart}Future Lighting Android Beta{boldEnd} - Future lighting model available as a beta feature on Android devices (Late 2023){listItemEnd}{listItemStart}{boldStart}Future Lighting Studio Default{boldEnd} - Future lighting as the default lighting model, boosting the visual quality of experiences for more creators (Late 2023){listItemEnd}{listEnd}",
    "Description.RobloxHomeAugUpdate": "The Roblox Home page connects people with experiences that they will love, and will help you find your ideal audience. Every user's Home page connects them to new experiences through a state-of-the-art recommendation engine. We aim to make it easier for every Roblox experience to engage and grow their user base by recommending the experience to the right audience.{listStart}{listItemStart}{boldStart}Continuous Home{boldEnd} - Improving discovery on the Home page through an extended, continually scrollable feed (Mid 2023){listItemEnd}{listItemStart}{boldStart}Social and Contextual Descriptors{boldEnd} - Labels like Friend presence in the experience and Genre to distinguish different types of experiences on the Home page (Early 2024){listItemEnd}{listItemStart}{boldStart}Recommendation Algorithm Improvements{boldEnd} - Enabling up-and-coming experiences to reach their audience faster (Ongoing){listItemEnd}{listEnd}",
    "Description.MatchmakingAugUpdate": "Matchmaking is at the heart of Roblox's vision for connecting people. We abstract away the complexity of game server management and use signals like friends, latency, language, age, and server occupancy to direct users to the server most likely to maximize engagement.{listStart}{listItemStart}{boldStart}Improved Scalability{boldEnd} - Better support for large traffic spikes (Late 2023){listItemEnd}{listItemStart}{boldStart}Auto-Reconnect{boldEnd} - Connect players to the same server following an update (Late 2023){listItemEnd}{listItemStart}{boldStart}Flexible Join Destination{boldEnd} - Send your users to non-root places when they join (Late 2023){listItemEnd}{listItemStart}{boldStart}Friend Invites{boldEnd} - Groups of friends can easily connect to the same server (Late 2023){listItemEnd}{listEnd}",
    "Description.NotificationsAugUpdate": "{linkStart}Developer-driven Invites{linkEnd} are a new way to customize and improve the invite experience for users, and some creators are already reporting a 10x increase in players joining their friends. We aim to make it even easier for you to reach your community, and help you optimize the value of each notification.{listStart}{listItemStart}{boldStart}Real-Time Experience Invites{boldEnd} - Send invitations to players who are currently active on Roblox ({liveLinkStart}Live{liveLinkEnd}){listItemEnd}{listItemStart}{boldStart}Notification Analytics{boldEnd} - Additional aggregated data provided via Creator Analytics (Early 2024){listItemEnd}{listItemStart}{boldStart}Universal Experience Notifications API{boldEnd} - Create any kind of notification for your experiences, beyond just invites (Early 2024){listItemEnd}{listItemStart}{boldStart}Notification Insights{boldEnd} - Automated suggestions to help improve the efficiency of your messages (2024){listItemEnd}{listEnd}",
    "Description.LanguageBarriersAugUpdate": "We strive to empower all our users to communicate with one another, regardless of language. By dissolving communication barriers, Roblox will help your community stay more closely connected, which will lead to increased engagement.{listStart}{listItemStart}{boldStart}Automatic Chat Translations{boldEnd} - In-experience chat automatically translated to supported languages (Late 2023){listItemEnd}{listItemStart}{boldStart}In-Experience Translation Feedback{boldEnd} - Allow users to share suggestions on ways you can improve your localization quality (Late 2023){listItemEnd}{listItemStart}{boldStart}Translated Documentation{boldEnd} - Adding support for 7 languages (including Spanish, Portuguese, Japanese) so you can read in your preferred language (Late 2024){listItemEnd}{listItemStart}{boldStart}New Regions{boldEnd} - Support for seven new locales on platform by the end of the year (Late 2023){listItemEnd}{listEnd}",
    "Description.StudioBugsSepUpdate": "Studio is a professional tool supporting long periods of sustained creation. We are investing heavily in both bug fixes and quality of life improvements that will make Studio more functional and reliable.{listStart}{listItemStart}{boldStart}Studio Docking{boldEnd} - Improved widget docking thanks to your feedback (Late 2023){listItemEnd}{listItemStart}{boldStart}Faster Play Launch Times{boldEnd} - Test your experience in less than 2 seconds (Mid 2023){listItemEnd}{listItemStart}{boldStart}Improve Team Create Join Time{boldEnd} - Start working on your experience, of any size, faster (Late 2023){listItemEnd}{listItemStart}{boldStart}Terrain Customization{boldEnd} - Adding the ability to customize the height of grass (Mid 2023){listItemEnd}{listItemStart}{boldStart}Script Editor{boldEnd} - Better general performance in large code bases and for operations like find/replace all (Mid 2023){listItemEnd}{listItemStart}{boldStart}Script Diff Window{boldEnd} - Additions like side-by-side view, copy/paste, 1-click merge, and edits in recovery mode (Mid 2023){listItemEnd}{listItemStart}{boldStart}Custom Logging{boldEnd} - Allowing you to pass error locations through pcalls (Early 2024){listItemEnd}{listItemStart}{boldStart}Unreliable Remote Events{boldEnd} - Support for sending Remote Events unreliably, allowing Creators to prioritize latency over reliability and ordering. (Late 2023){listItemEnd}{listItemStart}{boldStart}Occlusion Culling {boldEnd} - Reduces the geometry rendered to only what’s visible, which greatly improves performance. (2024){listItemEnd}{listItemStart}{boldStart}UI Styling & Flex Layouts{boldEnd} - Stylesheets make it possible to change the look and feel of your UI with one click. They work with 3D content, too. Flex layouts allow content to responsively and dynamically adapt to different layouts. (Late 2023){listItemEnd}{listEnd}",
    "Description.CloudCreationSepUpdate": "Large, lifelike worlds will require heavy computational power and vast amounts of storage to create. Offloading these needs to the cloud will ensure that you can reliably create megascale experiences without disruption, while collaborating with teams of any size.{listStart}{listItemStart}{boldStart}Team Create Invitations{boldEnd} - See invite notifications and share URLs to send collaborators directly to your Place in Studio (Late 2023){listItemEnd}{listItemStart}{boldStart}Collaborator Activity{boldEnd} - View who's actively contributing to your experiences from the Start page (Late 2023){listItemEnd}{listItemStart}{boldStart}Team Create Assets{boldEnd} - Access newly uploaded assets without needing to restart (Late 2023){listItemEnd}{listItemStart}{boldStart}Studio Reconnection{boldEnd} - Automatically reconnect after a temporary connectivity loss (Live){listItemEnd}{listItemStart}{boldStart}Granular Collaborator Permissions{boldEnd} - Give collaborators scoped access to your experiences in Team Create. (2024){listItemEnd}{listItemStart}{boldStart}Experience Activity History{boldEnd} - View history of collaboration activities and configuration changes in your experiences (Early 2024){listItemEnd}{listItemStart}{boldStart}Live Collaborator Presence in Studio{boldEnd} - Easily track active collaborators and jump to where they are working in Team Create (Early 2024){listItemEnd}{listItemStart}{boldStart}Enhance Drafts{boldEnd} - Focusing on live scripting and performance improvement (Early 2024){listItemEnd}{listEnd}",
    "Description.AvatarCreationSepUpdate": "Avatars are a core part of Roblox. From using them to communicate to creating your own, our avatar features mimic real-life communication, empower self-expression, and drive creation. Here are some of the features we are enabling to create a community-led Marketplace where any creator can make an avatar that is expressive, communicative, and personalized:{listStart}{listItemStart}{boldStart}glTF File Support{boldEnd} - Import avatar rigs in standard formats ({gltfLinkStart}Live{gltfLinkEnd}){listItemEnd}{listItemStart}{boldStart}Improved Avatar Face and Body Tooling{boldEnd} - Enhancing how you can import, create, and publish avatar assets (Late 2023){listItemEnd}{listItemStart}{boldStart}Bodies and Animated Faces{boldEnd} - Members of the {ugcLinkStart}UGC Program{ugcLinkEnd} and later all creators will be able to create items in the Marketplace including bodies and animated faces (Mid 2023){listItemEnd}{listItemStart}{boldStart}Community-led Marketplace{boldEnd} - Everyone can publish avatar items to the Marketplace, including {limitedsLinkStart}Limiteds{limitedsLinkEnd} (Late 2023){listItemEnd}{listItemStart}{boldStart}Photo to Avatar{boldEnd} - Create avatars from photo and text prompts using generative AI (2024){listItemEnd}{listItemStart}{boldStart}Accessory Adjustment Tool{boldEnd} - Avatar editor tool that allows you to adjust the size and placement of accessories on your avatar (Late 2023){listItemEnd}{listEnd}",
    "Description.RobloxHomeSepUpdate": "The Roblox Home page connects people with experiences that they will love, and will help you find your ideal audience. Every user's Home page connects them to new experiences through a state-of-the-art recommendation engine. We aim to make it easier for every Roblox experience to engage and grow their user base by recommending the experience to the right audience.{listStart}{listItemStart}{boldStart}Continuous Home{boldEnd} - Improving discovery on the Home page through an extended, continually scrollable feed (Ongoing){listItemEnd}{listItemStart}{boldStart}Social and Contextual Descriptors{boldEnd} - Labels like Friend presence in the experience and Genre to distinguish different types of experiences on the Home page (Early 2024){listItemEnd}{listItemStart}{boldStart}Recommendation Algorithm Improvements{boldEnd} - This is an on-going effort, we will continue to improve recommendations for users. (Ongoing){listItemEnd}{listEnd}",
    "Description.MatchmakingSepUpdate": "Matchmaking is at the heart of Roblox's vision for connecting people. We abstract away the complexity of game server management and use signals like friends, latency, language, age, and server occupancy to direct users to the server most likely to maximize engagement.{listStart}{listItemStart}{boldStart}Improved Scalability{boldEnd} - Better support for large traffic spikes (Late 2023){listItemEnd}{listItemStart}{boldStart}Auto-Reconnect{boldEnd} - Connect players to the same server following an update (Late 2023){listItemEnd}{listItemStart}{boldStart}Flexible Join Destination{boldEnd} - Send your users to non-root places when they join ({flexibleJoinLinkStart}Live{flexibleJoinLinkEnd}){listItemEnd}{listItemStart}{boldStart}Friend Invites{boldEnd} - Groups of friends can easily connect to the same server (Late 2023){listItemEnd}{listItemStart}{boldStart}Prewarming{boldEnd} - Enable significantly faster join times by provisioning experience instances in advance for high-volume experiences. (Late 2023){listItemEnd}{listItemStart}{boldStart}Social Context and Experience Hop Prompts{boldEnd} - At join time, users will see which of their friends are in the server. If a friend has left, the banner will indicate which experience they have moved to, with an option to follow them. (Late 2023){listItemEnd}{listEnd}",
    "Description.LanguageBarriersSepUpdate": "We strive to empower all our users to communicate with one another, regardless of language. By dissolving communication barriers, Roblox will help your community stay more closely connected, which will lead to increased engagement.{listStart}{listItemStart}{boldStart}Automatic Chat Translations{boldEnd} - In-experience chat automatically translated to supported languages (Late 2023){listItemEnd}{listItemStart}{boldStart}In-Experience Translation Feedback{boldEnd} - Allow users to share suggestions on ways you can improve your localization quality (Late 2023){listItemEnd}{listItemStart}{boldStart}Translated Documentation for 7 Languages{boldEnd} - Added support for 7 languages (including Spanish, Portuguese, Japanese) so you can read in your preferred languages. ({translationLinkStart}Live{translationLinkEnd}){listItemEnd}{listItemStart}{boldStart}Fully translated documentation for 95% of creators{boldEnd} - Machine translation will let the majority of creators read documentation in their native language. (Mid 2024){listItemEnd}{listItemStart}{boldStart}New Regions{boldEnd} - Support for seven new locales on platform by the end of the year (Late 2023){listItemEnd}{listEnd}",
    "Header.RobloxDevices": "Roblox on all popular devices",
    "Description.RobloxDevicesSepUpdate": "Roblox is one of the largest immersive platforms available anywhere. As devices evolve and new versions become available, we want to provide everyone on Roblox with the best experience possible for their device. Creators can publish experiences once and immediately get them into the hands of a global audience across all of the platforms we support.{listStart}{listItemStart}{boldStart}Meta Quest Full Release{boldEnd} - Bring your experiences to Meta Quest. (Late 2023){listItemEnd}{listItemStart}{boldStart}PlayStation Full Release{boldEnd} - Bring your experiences to PlayStation. (Late 2023){listItemEnd}{listEnd}",
    "Header.EmpowerCommunication": "Empower immersive communication and expression",
    "Description.EmpowerCommunicationSepUpdate": "People already use Roblox to connect with friends. We will be enabling new ways for users to connect, share, and express themselves, and provide creators with tools and APIs to build new forms of communication experiences.{listStart}{listItemStart}{boldStart}Roblox Connect{boldEnd} - Connect will offer a suite of APIs and reference code examples to support developers in building experiences for communication and connection. (Late 2023){listItemEnd}{listItemStart}{boldStart}Updated experience controls{boldEnd} - Consistent and adaptive experience controls that make it easier for users to find their most frequently used action. (Late 2023){listItemEnd}{listItemStart}{boldStart}Screenshots{boldEnd} - Capture screenshots from in-experience and share with friends (Late 2023){listItemEnd}{listEnd}",
    "Description.RobloxCloudSepUpdate": "{linkStart}Roblox Cloud{linkEnd} will support a broader application ecosystem through a set of flexible and secure web APIs. We envision a world where you'll be able to automate workflows through scripts, publish via the command line, or create bots to help manage your community.{listStart}{listItemStart}{boldStart}OAuth2 Public Release{boldEnd} - Log in to third-party services (eg analytics or community management bots) using your Roblox account ({oauth2LinkStart}Live{oauth2LinkEnd}){listItemEnd}{listItemStart}{boldStart}Inventory API{boldEnd} - Check if a user owns an item (Late 2023){listItemEnd}{listItemStart}{boldStart}Group API{boldEnd} - A new way to manage groups (Late 2023){listItemEnd}{listItemStart}{boldStart}Simplify 'Right to be Forgotten' (GDPR) Process{boldEnd} - Reference solution that uses Webhooks and Open Cloud Data Store APIs to automatically process incoming requests ({GDPRLinkStart}Live{GDPRLinkEnd}){listItemEnd}{listItemStart}{boldStart}Cloud Service Management{boldEnd} - Additional visibility and customization for services like Memory Stores (Late 2023){listItemEnd}{listItemStart}{boldStart}Universe APIs{boldEnd} - Update the metadata, such as the description, for your experience (Early 2024){listItemEnd}{listItemStart}{boldStart}Secret Store for HTTPService{boldEnd} - Securely store and attach secrets (like API keys and credentials) to access external services separately from code. No more plain text. (Late 2023){listItemEnd}{listEnd}",
    "Description.SafetyAndModerationSepUpdate": "Our safety features, tools, and moderation capabilities have been built into the design of our product. We are continuing to work to make those capabilities smarter and stronger over time and will be investing more heavily in the detection and prevention of in-experience exploits.{listStart}{listItemStart}{boldStart}Moderation Precision{boldEnd} - We are working hard to lessen the burden of asset moderation while keeping the community safe (Ongoing){listItemEnd}{listItemStart}{boldStart}Anti-Cheat{boldEnd} - Improving client-side and server-side anti-cheat, and giving you more ways to identify and block cheaters using {linkStart}Byfron's technology{linkEnd} (Live){listItemEnd}{listItemStart}{boldStart}Alt-Account Detection{boldEnd} - Take action on repeat offenders and help us combat exploiters on Roblox (Late 2023){listItemEnd}{listItemStart}{boldStart}Adding Strong Language Support to 17+ Experiences{boldEnd} - Originally added as relaxed text filters. We will are working on enabling strong language in 17+ experiences (Late 2023){listItemEnd}{listItemStart}{boldStart}Banning API{boldEnd} - API that allows devs to ban specific users from an experience and automatically handles alt accounts. (Late 2023){listItemEnd}{listEnd}",
    "Description.EarnAndAdvertiseSepUpdate": "We recently introduced {linkStart}Immersive Ads{linkEnd}, which allow developers to place high-quality, native ad units in their experience. These innovative ad units offer a new way for you to publish and earn from advertisements.{listStart}{listItemStart}{boldStart}Immersive Ads{boldEnd} - Providing a new path for you to monetize your experiences. We expect CPMs to increase as more advertisers participate and more developers serve ads in their experiences ({immersiveAdsLinkStart}Live{immersiveAdsLinkEnd}){listItemEnd}{listItemStart}{boldStart}Ads Manager{boldEnd} - Create Immersive Ads with our self-serve Ads Manager tool for ad creation, management, reporting and billing ({adsManagerLinkStart}Live{adsManagerLinkEnd}){listItemEnd}{listItemStart}{boldStart}Sponsored Ads Improvements{boldEnd} - Better targeting, reporting, and delivery for your sponsored ads. (Late 2023){listItemEnd}{listItemStart}{boldStart}Earn more on Creator Marketplace sales{boldEnd} - Creators will get 100% of Creator Marketplace sales in Creator Hub and Studio minus sales taxes and payment processing fees.  Items will be priced and sold in $USD instead of Robux and no longer subject to DevEx. (2024){listItemEnd}{listItemStart}{boldStart}Subscriptions within experiences{boldEnd} - Creators will be able to offer recurring subscriptions in their experiences. In September, ID/phone-verified creators with experiences created before September will be able to access tooling for testing. Users will be able to purchase starting in November. (Late 2023){listItemEnd}{listEnd}",
    "Description.LearnConnectCreateSepUpdate": "Creation on Roblox is constantly evolving, and we strive to make it easy for users of all skill levels to learn and grow with the platform. In the coming year, we’ll improve our documentation coverage and quality, expand our learning series, grow our Creator Events program, and support creators who are making next generation experiences.{listStart}{listItemStart}{boldStart}Tutorials{boldEnd} - Learn with tutorials and reference projects for building, scripting, and 3D Art. (Mid 2023){listItemEnd}{listItemStart}{boldStart}Open-Source Documentation{boldEnd} - Anyone in the community will be able to contribute to Creator Documentation (Live){listItemEnd}{listItemStart}{boldStart}Docs Available in Studio{boldEnd} - Access advice and code samples directly from Studio (Late 2023){listItemEnd}{listItemStart}{boldStart}{gameFundLinkStart}Game Fund{gameFundLinkEnd}{boldEnd} - Supporting creators who want to build the next generation of Roblox experiences with a $35 million investment (Ongoing){listItemEnd}{listEnd}",
    "Description.InsightSepUpdate": "Many top Roblox creators already use analytics to grow their experiences, but data can be overwhelming. We want to offer everyone the power of a trusted data analyst, to help you interpret complicated data patterns and know what actions to take next.{listStart}{listItemStart}{boldStart}Real Time Stats{boldEnd} - See live user stats, frame rate, memory usage, and more ({performanceLinkStart}Live{performanceLinkEnd}){listItemEnd}{listItemStart}{boldStart}Real Time Error Report{boldEnd} - Identify and fix server and client errors and warnings({errorReportingLinkStart}Live{errorReportingLinkEnd}){listItemEnd}{listItemStart}{boldStart}Insights{boldEnd} - Focus on the most important metrics to grow your creations ({insightsLinkStart}Live{insightsLinkEnd}){listItemEnd}{listItemStart}{boldStart}Analytics home for Experiences and Avatar Items{boldEnd} - Monitor your experiences across groups and track sales and revenue for each avatar item. (Late 2023){listItemEnd}{listItemStart}{boldStart}Analytics for Developer Products and Passes{boldEnd} - See developer product and game pass revenue by item (2024){listItemEnd}{listItemStart}{boldStart}Acquisition Analytics Improvements{boldEnd} - See new user home recommendations conversion rate and icon and title annotations (Late 2023){listItemEnd}{listItemStart}{boldStart}Session Time for New vs. Returning Users{boldEnd} - See session time split by new and returning users. Monitor session time drop off (e.g., 30% of your new users dropped off 30 sec in) (Late 2023){listItemEnd}{listItemStart}{boldStart}Standard Event Schema{boldEnd} - Instrument to unlock funnel charts such as level progression and economy source vs. sink (2024){listItemEnd}{listItemStart}{boldStart}Data Export API{boldEnd} - Export raw analytics data for your experiences (2024){listItemEnd}{listItemStart}{boldStart}External Acquisition Source{boldEnd} - See where new users are coming from externally. (2024){listItemEnd}{listItemStart}{boldStart}Improved Insights and Benchmarks{boldEnd} - Improve signal to help creators take action. (2024){listItemEnd}{listEnd}",
    "Description.CollaborateSepUpdate": "Most top experiences are developed by teams, and Roblox wants to make it even easier for you to collaborate. Talent Hub will help you connect with people to grow your team, and we are re-building ‘Groups' from the ground up to make it easier to manage permissions.{listStart}{listItemStart}{boldStart}Reputation Ranking in Talent Hub{boldEnd} - See more listings from reputable employers and creators ({talentHubRankingLinkStart}Live{talentHubRankingLinkEnd}){listItemEnd}{listItemStart}{boldStart}Manual Paid Experience Ownership Transfer{boldEnd} - Transfer ownership from an account to a Group for a fee, with a manual request to Roblox. ({ownershipLinkStart}Live{ownershipLinkEnd}){listItemEnd}{listItemStart}{boldStart}Self-serve Experience Ownership Transfer{boldEnd} - Free, self-service experience transfer from account to group. (2024){listItemEnd}{listItemStart}{boldStart}Organizations and Permissions{boldEnd} - Assign specific Experience-access permissions to collaborators, like limiting analytics access to error reporting (Late 2023){listItemEnd}{listItemStart}{boldStart}Asset Privacy and Permissions{boldEnd} -  Enable asset privacy, sharing, & collaboration: Asset owners can share audio and video assets with their friends and groups coming end of 2023, and all other asset types in 2024{listItemEnd}{listEnd}",
    "Description.CreateWorldsSepUpdate": "We are releasing aerodynamic simulation as our first fluid dynamics force, enabling completely new types of physically-accurate content. We're also significantly improving Future lighting's performance so that we can enable it on Android and make it our default lighting model.{listStart}{listItemStart}{boldStart}Global Wind{boldEnd} - A new property to add more richness to your worlds with grass, clouds, and even falling leaves that move with the wind (Mid 2023){listItemEnd}{listItemStart}{boldStart}Lift and Drag Beta{boldEnd} - Aerodynamic properties, such as air density, to better simulate flight for objects like wingsuits (Mid 2023){listItemEnd}{listItemStart}{boldStart}Future Lighting Android Beta{boldEnd} - Future lighting model available as a beta feature on Android devices (Mid 2023){listItemEnd}{listItemStart}{boldStart}Future Lighting Studio Default{boldEnd} - Future lighting as the default lighting model, boosting the visual quality of experiences for more creators (Late 2023){listItemEnd}{listItemStart}{boldStart}Audio APIs{boldEnd} - Audio API empowers developers with increased control over audio, particularly voice, so devs can explore new ways to remix audio and create realistic sound in experience. (Late 2023){listItemEnd}{listItemStart}{boldStart}Mesh & Texture APIs{boldEnd} - First step in a new era of creation where developers have direct access to meshes and textures in Lua. (Late 2023){listItemEnd}{listItemStart}{boldStart}Video Uploads{boldEnd} - 13+ and ID-verified creators can upload 30s short form videos to their experiences (Late 2023){listItemEnd}{listItemStart}{boldStart}New Voxel Light Grid{boldEnd} - Improvements to lighting to bring the highest quality option to as many devices as possible-- includes shadows, specular highlights, light reflection. (2024){listItemEnd}{listItemStart}{boldStart}Customizable Grass Height{boldEnd} - Allows devs to adjust the height of grass in their experience. Launching as non-scriptable properties for Grass Height and Grass Density in Roblox Studio, working on API (Late 2023){listItemEnd}{listItemStart}{boldStart}Upper Body Tracking{boldEnd} - Upper body tracking translates arm and torso movement onto your avatar in real time using the same technology as facial animation. (Late 2024){listItemEnd}{listEnd}",
    "Description.GenerativeAISepUpdate": "Roblox is building Generative AI tools to scale your creation efforts and let you focus on the aspects that matter most. This technology will help you learn, code, debug, build faster, iterate more, and augment your skills to create even better content.{listStart}{listItemStart}{boldStart}{generatorLinkStart}Material Generator{generatorLinkEnd} Full Release{boldEnd} - Quickly generate visually-compelling materials using natural language (Late 2023){listItemEnd}{listItemStart}{boldStart}{assistLinkStart}Code Assist{assistLinkEnd} Full Release{boldEnd} - Powerful code generation tool for both experienced and new scripters (Late 2023){listItemEnd}{listEnd}",
    "Heading.AccelerateCreationSepUpdate": "Accelerate creation through community-generated assets",
    "Description.AccelerateCreationSepUpdate": "Creator Marketplace contains millions of high-quality assets, but it’s not always easy to find them. We aim to connect you with the perfect asset for any occasion and ensure everything you find in the Creator Marketplace is safe to use. We have also heard your feedback about Creator Marketplace monetization, and will be rolling out a plan to improve earnings for asset creators.{listStart}{listItemStart}{boldStart}Richer Audio Discovery{boldEnd} - Category support in Studio and Web (Mid 2023){listItemEnd}{listItemStart}{boldStart}Improved Search{boldEnd} - Find assets using descriptive language like 'red convertible car' or 'ambient restaurant sounds' (Mid 2023){listItemEnd}{listItemStart}{boldStart}List View Beta{boldEnd} - Making it easier to browse large asset collections in Toolbox (Late 2023){listItemEnd}{listItemStart}{boldStart}Additional Spam & Plagiarism Protections{boldEnd} - More rigorous plagiarism detection and punishments for repeat offenders (Late 2023){listItemEnd}{listItemStart}{boldStart}Personalized Asset Recommendations{boldEnd} - Discover assets based on the content in your experience (Late 2023){listItemEnd}{listEnd}",
    "Description.EasyCreationSepUpdate": "Our vision is to provide powerful, flexible workflows for creators to build next-generation immersive 3D experiences and user-generated content (UGC). We are building a foundation that will make it easier than ever to create high quality content, while adding flexibility to your day-to-day tasks. We are also exploring ways we can open the platform in a stable, supported, and future-proof way and will be holding several 'Office Hours' sessions in the near future to share more and answer your questions. {listStart}{listItemStart}{boldStart}{selectionLinkStart}Selection Improvements{selectionLinkEnd}, {explorerLinkStart}Explorer Search Filter{explorerLinkEnd}, and {multiCursorLinkStart}Multi-Cursor{multiCursorLinkEnd} in Script Editor{boldEnd} - Full release thanks to your beta {listItemEnd}{listItemStart}{boldStart}Drag Detectors Beta{boldEnd} - Make objects in your experience draggable and interactive without scripting ({dragDetectorsLinkStart}Live{dragDetectorsLinkEnd}){listItemEnd}{listItemStart}{boldStart}Camera Speed and Rotation{boldEnd} - Easier control while moving the camera (Mid 2023){listItemEnd}{listItemStart}{boldStart}Next Generation Studio Ribbon{boldEnd} - A completely redesigned Studio Ribbon with easy access to the tools and plugins that best match your unique workflows (Early 2024){listItemEnd}{listItemStart}{boldStart}Live Scripting Beta{boldEnd} - Script collaboratively with streamlined version history, like editing a cloud document with your team (Late 2023){listItemEnd}{listItemStart}{boldStart}Window Context Cues{boldEnd} - See the Place name in addition to your current tab name in the Studio window title (On Hold){listItemEnd}{listItemStart}{boldStart}Studio Luau File Sync Beta{boldEnd} - Export/import scripts between Studio and disk, so that you can use any IDE or version control system. (Late 2023){listItemEnd}{listItemStart}{boldStart}Data Model Open Cloud API Beta (Scripting only){boldEnd} - Use Open Cloud APIs for cloud based workflows or external IDEs. We're starting with scripting but plan to expand to the entire data model. (Late 2023){listItemEnd}{listItemStart}{boldStart}Public packages on Creator Marketplace{boldEnd} - Packages can be shared publicly on Creator Marketplace (2024){listItemEnd}{listEnd}",
    "Description.CreateWorldsSepUpdateV2": "We are releasing aerodynamic simulation as our first fluid dynamics force, enabling completely new types of physically-accurate content. We're also significantly improving Future lighting's performance so that we can enable it on Android and make it our default lighting model.{listStart}{listItemStart}{boldStart}Global Wind{boldEnd} - A new property to add more richness to your worlds with grass, clouds, and even falling leaves that move with the wind ({globalWindLinkStart}Live{globalWindLinkEnd}){listItemEnd}{listItemStart}{boldStart}Lift and Drag Beta{boldEnd} - Aerodynamic properties, such as air density, to better simulate flight for objects like wingsuits (Live){listItemEnd}{listItemStart}{boldStart}Future Lighting Android Beta{boldEnd} - Future lighting model available as a beta feature on Android devices (Mid 2023){listItemEnd}{listItemStart}{boldStart}Future Lighting Studio Default{boldEnd} - Future lighting as the default lighting model, boosting the visual quality of experiences for more creators (Late 2023){listItemEnd}{listItemStart}{boldStart}Audio APIs{boldEnd} - Audio API empowers developers with increased control over audio, particularly voice, so devs can explore new ways to remix audio and create realistic sound in experience. (Late 2023){listItemEnd}{listItemStart}{boldStart}Mesh & Texture APIs{boldEnd} - First step in a new era of creation where developers have direct access to meshes and textures in Lua. (Late 2023){listItemEnd}{listItemStart}{boldStart}Video Uploads{boldEnd} - 13+ and ID-verified creators can upload 30s short form videos to their experiences (Late 2023){listItemEnd}{listItemStart}{boldStart}New Voxel Light Grid{boldEnd} - Improvements to lighting to bring the highest quality option to as many devices as possible-- includes shadows, specular highlights, light reflection. (2024){listItemEnd}{listItemStart}{boldStart}Customizable Grass Height{boldEnd} - Allows devs to adjust the height of grass in their experience. Launching as non-scriptable properties for Grass Height and Grass Density in Roblox Studio, working on API (Late 2023){listItemEnd}{listItemStart}{boldStart}Upper Body Tracking{boldEnd} - Upper body tracking translates arm and torso movement onto your avatar in real time using the same technology as facial animation. (Late 2024){listItemEnd}{listEnd}",
    "Description.CreateWorldsSepUpdateV3": "We are releasing aerodynamic simulation as our first fluid dynamics force, enabling completely new types of physically-accurate content. We're also significantly improving Future lighting's performance so that we can enable it on Android and make it our default lighting model.{listStart}{listItemStart}{boldStart}Global Wind{boldEnd} - A new property to add more richness to your worlds with grass, clouds, and even falling leaves that move with the wind ({globalWindLinkStart}Live{globalWindLinkEnd}){listItemEnd}{listItemStart}{boldStart}Aerodynamic Forces{boldEnd} - Aerodynamic properties, such as air density, to better simulate flight for objects like wingsuits ({aerodynamicLinkStart}Live{aerodynamicLinkEnd}){listItemEnd}{listItemStart}{boldStart}Future Lighting Android Beta{boldEnd} - Future lighting model available as a beta feature on Android devices (Mid 2023){listItemEnd}{listItemStart}{boldStart}Future Lighting Studio Default{boldEnd} - Future lighting as the default lighting model, boosting the visual quality of experiences for more creators (Late 2023){listItemEnd}{listItemStart}{boldStart}Audio APIs{boldEnd} - Audio API empowers developers with increased control over audio, particularly voice, so devs can explore new ways to remix audio and create realistic sound in experience. (Late 2023){listItemEnd}{listItemStart}{boldStart}Mesh & Texture APIs{boldEnd} - First step in a new era of creation where developers have direct access to meshes and textures in Lua. (Late 2023){listItemEnd}{listItemStart}{boldStart}Video Uploads{boldEnd} - 13+ and ID-verified creators can upload 30s short form videos to their experiences (Late 2023){listItemEnd}{listItemStart}{boldStart}New Voxel Light Grid{boldEnd} - Improvements to lighting to bring the highest quality option to as many devices as possible-- includes shadows, specular highlights, light reflection. (2024){listItemEnd}{listItemStart}{boldStart}Customizable Grass Height{boldEnd} - Allows devs to adjust the height of grass in their experience. Launching as non-scriptable properties for Grass Height and Grass Density in Roblox Studio, working on API (Late 2023){listItemEnd}{listItemStart}{boldStart}Upper Body Tracking{boldEnd} - Upper body tracking translates arm and torso movement onto your avatar in real time using the same technology as facial animation. (Late 2024){listItemEnd}{listEnd}",
    "Description.CloudCreationSepUpdateV2": "Large, lifelike worlds will require heavy computational power and vast amounts of storage to create. Offloading these needs to the cloud will ensure that you can reliably create megascale experiences without disruption, while collaborating with teams of any size.{listStart}{listItemStart}{boldStart}Team Create Invitations{boldEnd} - See invite notifications and share URLs to send collaborators directly to your Place in Studio (Late 2023){listItemEnd}{listItemStart}{boldStart}Collaborator Activity{boldEnd} - View who's actively contributing to your experiences from the Start page (Late 2023){listItemEnd}{listItemStart}{boldStart}Team Create Assets{boldEnd} - Access newly uploaded assets without needing to restart (Late 2023){listItemEnd}{listItemStart}{boldStart}Studio Reconnection{boldEnd} - Automatically reconnect after a temporary connectivity loss ({reconnectionLinkStart}Live{reconnectionLinkEnd}){listItemEnd}{listItemStart}{boldStart}Granular Collaborator Permissions{boldEnd} - Give collaborators scoped access to your experiences in Team Create. (2024){listItemEnd}{listItemStart}{boldStart}Experience Activity History{boldEnd} - View history of collaboration activities and configuration changes in your experiences (Early 2024){listItemEnd}{listItemStart}{boldStart}Live Collaborator Presence in Studio{boldEnd} - Easily track active collaborators and jump to where they are working in Team Create (Early 2024){listItemEnd}{listItemStart}{boldStart}Enhance Drafts{boldEnd} - Focusing on live scripting and performance improvement (Early 2024){listItemEnd}{listEnd}",
    "StudioBugsSepUpdateV2": "Studio is a professional tool supporting long periods of sustained creation. We are investing heavily in both bug fixes and quality of life improvements that will make Studio more functional and reliable.{listStart}{listItemStart}{boldStart}Studio Docking{boldEnd} - Improved widget docking thanks to your feedback (Late 2023){listItemEnd}{listItemStart}{boldStart}Faster Play Launch Times{boldEnd} - Test your experience in less than 2 seconds (Live){listItemEnd}{listItemStart}{boldStart}Improve Team Create Join Time{boldEnd} - Start working on your experience, of any size, faster (Late 2023){listItemEnd}{listItemStart}{boldStart}Terrain Customization{boldEnd} - Improvements to terrain editing ({terrainLinkStart}Live{terrainLinkEnd}), adding the ability to customize the height of grass (Late 2023){listItemEnd}{listItemStart}{boldStart}Script Editor{boldEnd} - Better general performance in large code bases and for operations like find/replace all (Mid 2023){listItemEnd}{listItemStart}{boldStart}Script Diff Window{boldEnd} - Additions like side-by-side view, copy/paste, 1-click merge, and edits in recovery mode (Mid 2023){listItemEnd}{listItemStart}{boldStart}Custom Logging{boldEnd} - Allowing you to pass error locations through pcalls (Early 2024){listItemEnd}{listItemStart}{boldStart}Unreliable Remote Events{boldEnd} - Support for sending Remote Events unreliably, allowing Creators to prioritize latency over reliability and ordering. (Late 2023){listItemEnd}{listItemStart}{boldStart}Occlusion Culling {boldEnd} - Reduces the geometry rendered to only what’s visible, which greatly improves performance. (2024){listItemEnd}{listItemStart}{boldStart}UI Styling & Flex Layouts{boldEnd} - Stylesheets make it possible to change the look and feel of your UI with one click. They work with 3D content, too. Flex layouts allow content to responsively and dynamically adapt to different layouts. (Late 2023){listItemEnd}{listEnd}",
    "Description.EasyCreationSepUpdateV2": "Our vision is to provide powerful, flexible workflows for creators to build next-generation immersive 3D experiences and user-generated content (UGC). We are building a foundation that will make it easier than ever to create high quality content, while adding flexibility to your day-to-day tasks. We are also exploring ways we can open the platform in a stable, supported, and future-proof way and will be holding several 'Office Hours' sessions in the near future to share more and answer your questions. {listStart}{listItemStart}{boldStart}{selectionLinkStart}Selection Improvements{selectionLinkEnd}, {explorerLinkStart}Explorer Search Filter{explorerLinkEnd}, and {multiCursorLinkStart}Multi-Cursor{multiCursorLinkEnd} in Script Editor{boldEnd} - Full release thanks to your beta {listItemEnd}{listItemStart}{boldStart}Drag Detectors Beta{boldEnd} - Make objects in your experience draggable and interactive without scripting ({dragDetectorsLinkStart}Live{dragDetectorsLinkEnd}){listItemEnd}{listItemStart}{boldStart}Camera Speed and Rotation{boldEnd} - Easier control while moving the camera ({cameraLinkStart}Live{cameraLinkEnd}){listItemEnd}{listItemStart}{boldStart}Next Generation Studio Ribbon{boldEnd} - A completely redesigned Studio Ribbon with easy access to the tools and plugins that best match your unique workflows (Early 2024){listItemEnd}{listItemStart}{boldStart}Live Scripting Beta{boldEnd} - Script collaboratively with streamlined version history, like editing a cloud document with your team (Late 2023){listItemEnd}{listItemStart}{boldStart}Window Context Cues{boldEnd} - See the Place name in addition to your current tab name in the Studio window title (On Hold){listItemEnd}{listItemStart}{boldStart}Studio Luau File Sync Beta{boldEnd} - Export/import scripts between Studio and disk, so that you can use any IDE or version control system. (Late 2023){listItemEnd}{listItemStart}{boldStart}Engine Open Cloud API Beta (Scripting only){boldEnd} - Use Open Cloud APIs for cloud based workflows or external IDEs. We're starting with scripting but plan to expand to the entire data model. (Late 2023){listItemEnd}{listItemStart}{boldStart}Public packages on Creator Marketplace{boldEnd} - Packages can be shared publicly on Creator Marketplace (2024){listItemEnd}{listEnd}",
    "Description.StudioBugsSepUpdateV2": "Studio is a professional tool supporting long periods of sustained creation. We are investing heavily in both bug fixes and quality of life improvements that will make Studio more functional and reliable.{listStart}{listItemStart}{boldStart}Studio Docking{boldEnd} - Improved widget docking thanks to your feedback (Late 2023){listItemEnd}{listItemStart}{boldStart}Faster Play Launch Times{boldEnd} - Test your experience in less than 2 seconds (Live){listItemEnd}{listItemStart}{boldStart}Improve Team Create Join Time{boldEnd} - Start working on your experience, of any size, faster (Late 2023){listItemEnd}{listItemStart}{boldStart}Terrain Customization{boldEnd} - Improvements to terrain editing ({terrainLinkStart}Live{terrainLinkEnd}), adding the ability to customize the height of grass (Late 2023){listItemEnd}{listItemStart}{boldStart}Script Editor{boldEnd} - Better general performance in large code bases and for operations like find/replace all (Mid 2023){listItemEnd}{listItemStart}{boldStart}Script Diff Window{boldEnd} - Additions like side-by-side view, copy/paste, 1-click merge, and edits in recovery mode (Mid 2023){listItemEnd}{listItemStart}{boldStart}Custom Logging{boldEnd} - Allowing you to pass error locations through pcalls (Early 2024){listItemEnd}{listItemStart}{boldStart}Unreliable Remote Events{boldEnd} - Support for sending Remote Events unreliably, allowing Creators to prioritize latency over reliability and ordering. (Late 2023){listItemEnd}{listItemStart}{boldStart}Occlusion Culling {boldEnd} - Reduces the geometry rendered to only what’s visible, which greatly improves performance. (2024){listItemEnd}{listItemStart}{boldStart}UI Styling & Flex Layouts{boldEnd} - Stylesheets make it possible to change the look and feel of your UI with one click. They work with 3D content, too. Flex layouts allow content to responsively and dynamically adapt to different layouts. (Late 2023){listItemEnd}{listEnd}",
    "Description.AvatarCreationSepUpdateV2": "Avatars are a core part of Roblox. From using them to communicate to creating your own, our avatar features mimic real-life communication, empower self-expression, and drive creation. Here are some of the features we are enabling to create a community-led Marketplace where any creator can make an avatar that is expressive, communicative, and personalized:{listStart}{listItemStart}{boldStart}glTF File Support{boldEnd} - Import avatar rigs in standard formats ({gltfLinkStart}Live{gltfLinkEnd}){listItemEnd}{listItemStart}{boldStart}Improved Avatar Face and Body Tooling{boldEnd} - Enhancing how you can import, create, and publish avatar assets (Late 2023){listItemEnd}{listItemStart}{boldStart}Bodies and Animated Faces{boldEnd} - Members of the {ugcLinkStart}UGC Program{ugcLinkEnd} and later all creators will be able to create items in the Marketplace including bodies and animated faces (Mid 2023){listItemEnd}{listItemStart}{boldStart}Community-led Marketplace{boldEnd} - Anyone can publish avatar items to the Marketplace (Late 2023){listItemEnd}{listItemStart}{boldStart}Photo to Avatar{boldEnd} - Create avatars from photo and text prompts using generative AI (2024){listItemEnd}{listItemStart}{boldStart}Accessory Adjustment Tool{boldEnd} - Avatar editor tool that allows you to adjust the size and placement of accessories on your avatar (Late 2023){listItemEnd}{listEnd}"
}