{
    "Heading.RobloxCreatorRoadmap": "Roblox Creator Roadmap",
    "Description.MetadataDescription": "Preview new features and capabilities coming soon to Roblox. Get a glimpse into and help shape the future of the platform.",
    "Heading.CreatorRoadMap": "Creator Roadmap",
    "Description.CreatorRoadMap": "We are focused on providing you with solutions to make creation easier and more immersive. Use this roadmap to get a preview of some of the new features and capabilities coming soon to Roblox.",
    "Description.Disclaimer": "Disclaimer: The Creator Roadmap is not a comprehensive list of all upcoming features, and the details of the proposed features may change or some may not launch at all. Launch windows, e.g. (Mid 2023), are approximate and subject to change.",
    "Heading.CreateHoweverYouWant": "Create however you want",
    "Description.CreateHoweverYouWant": "We aim to make it easy and intuitive for everyone to express themselves. Whether you're building experiences or designing accessories, we'll support more ways for you to create.",
    "Heading.EasyCreation": "Easy creation, optimized for your ideal workflows",
    "Heading.StudioBugs": "Studio will address long-standing bugs and pain points",
    "Heading.CreateWorlds": "Create rich and lifelike worlds",
    "Heading.CloudCreation": "Cloud creation improves collaboration and reliability",
    "Heading.GenerativeAI": "Generative AI accelerates creation",
    "Heading.AvatarCreation": "Avatar creation and Marketplace",
    "Heading.GrowAudience": "Grow and engage your audience",
    "Description.GrowAudience": "Did you know that 100 of the top 150 experiences were created last year? We're making it easier for new experiences to build a global audience and giving you tools to engage and retain users.",
    "Heading.RobloxHome": "Roblox Home page connects you to your ideal audience",
    "Heading.PowerfulSearch": "Powerful search and browse capabilities",
    "Heading.Matchmaking": "Match your users to the best server",
    "Heading.Notifications": "Re-engage your community through notifications",
    "Heading.LanguageBarriers": "Break down language barriers",
    "Heading.GrowingCreator": "Benefit from a growing creator ecosystem",
    "Description.GrowingCreator": "We will support you with a thriving ecosystem that simplifies the challenging aspects of creation. These offerings will enhance your productivity, maintain a safe and civil platform, and offer you new ways to earn.",
    "Heading.CreatorHubSuccess": "Creator Hub is your key to success",
    "Description.CreatorHubSuccess": "We're equipping you with all the information you need to maximize your success with open-source  documentation, actionable recommendations to grow your experience, and timely notifications when your attention is needed.",
    "Heading.ComingSoon": "Coming Soon",
    "Description.ComingIn": "in {comingIn} week",
    "Description.ComingInPlural": "in {comingIn} weeks",
    "Heading.JoinTheCommunity": "Join The Community ",
    "Description.JoinTheCommunity": "The Forum is a collaborative resource where you can read about new features, share your input on upcoming features, and connect with other creators. Join in on the discussions and help shape the future of creation on Roblox.",
    "Label.DiscusRoadMap": "Learn More on the Forum",
    "Action.DiscussOnForum": "Discuss on Forum",
    "Heading.RobloxCloud": "Roblox Cloud helps you scale",
    "Heading.SafetyAndModeration": "Balanced safety and moderation",
    "Heading.EarnAndAdvertise": "More ways to earn and advertise",
    "Heading.LearnConnectCreate": "Learn, connect, and create with one another",
    "Heading.Insight": "Actionable insights to grow your experience",
    "Heading.Personalization": "Notifications and personalization keep you informed",
    "Heading.Collaborate": "Collaborate more efficiently as a team",
    "Action.ReadAnnouncement": "Read Latest Announcement",
    "Header.RobloxDevices": "Roblox on all popular devices",
    "Header.EmpowerCommunication": "Empower immersive communication and expression",
    "Heading.AccelerateCreationSepUpdate": "Accelerate creation through community-generated assets",
    "Heading.EngineExperience": "Engine can support any type of experience",
    "Label.LastUpdated2024October": "Last Updated: April 2025",
    "Description.StudioBugs2024OctoberUpdate": "Studio is a professional tool supporting long periods of sustained creation. We are investing heavily in both bug fixes and quality of life improvements that will make Studio more functional and reliable.{listStart}{listItemStart}{boldStart}Improve Team Create Join Time {boldEnd} - Start working on your experience, of any size, faster. (Live){listItemEnd}{listItemStart}{boldStart}Script Diff Window {boldEnd} - Shipped in Package Diffs ({scriptDiffLinkStart}Live{scriptDiffLinkEnd}) and Scripts ({scriptDiffImprovementsLinkStart}Live{scriptDiffImprovementsLinkEnd}).{listItemEnd}{listEnd}",
    "Description.CreateWorlds2024OctoberUpdate": "We are releasing aerodynamic simulation as our first fluid dynamics force, enabling completely new types of physically-accurate content. We're also significantly improving Future lighting's performance so that we can enable it on Android and make it our default lighting model.{listStart}{listItemStart}{boldStart}Store up to 8K image resolution{boldEnd} - Currently, when a user uploads an image > 1K in resolution, it gets transcoded down to 1K, and the high-fidelity version is lost. We will now start to store the high-fidelity version up to 8K. Initially, it will be used for asset previews in the Store. In the future, it can be utilized to support textures more than 1K. ({retainingHighFidelityImagesLinkStart}Live{retainingHighFidelityImagesLinkEnd}){listItemEnd}{listItemStart}{boldStart}Aerodynamic Forces{boldEnd} - Aerodynamic properties, such as air density, to better simulate flight for objects like wingsuits. Studio beta (live). Working toward full release. ({aerodynamicLinkStart}Live{aerodynamicLinkEnd}){listItemEnd}{listItemStart}{boldStart}Improved debuggability of the Physics system{boldEnd} - Improve the ability to debug physics in Studio by visualizing force/torques, overhauling the pause functionality ({physicsStepLinkStart}live{physicsStepLinkEnd}), adding the ability to step through physics frames when paused ({stepPhysicsApiLinkStart}live{stepPhysicsApiLinkEnd}), and adding the ability to temporarily simulate selected parts in edit mode. (2024){listItemEnd}{listItemStart}{boldStart}Physically-Simulated Avatars{boldEnd} - Release a new AnimationConstraint instance as a replacement for Motor6D joints that enables physically-simulated avatars by allowing force and torque limits for target pose matching. The Avatar Joint Upgrade Studio Beta will be an easy way for devs to opt into having all avatars in their experience spawn with AnimationConstraints rather than Motor6Ds. (Late 2024){listItemEnd}{listItemStart}{boldStart}Improved Physics Solver{boldEnd} - New and improved physics solver that enables more complex mechanisms and makes existing mechanisms more robust. (Early 2025){listItemEnd}{listItemStart}{boldStart}Fluid physics improvements{boldEnd} - Improved hydrodynamic forces and more realistic water behavior. (2025){listItemEnd}{listItemStart}{boldStart}Future Lighting Android Beta{boldEnd} - Future lighting model available as a beta feature on Android devices. (Late 2024){listItemEnd}{listItemStart}{boldStart}Future Lighting Studio Default {boldEnd} - Future lighting as the default lighting model in Studio, boosting the visual quality of experiences for more creators. (2025){listItemEnd}{listItemStart}{boldStart}Audio APIs{boldEnd} - Audio API empowers developers with increased control over audio, particularly voice, so devs can explore new ways to remix audio and create realistic sound in experience. ({audioApiBetaLinkStart}Live{audioApiBetaLinkEnd}){listItemEnd}{listItemStart}{boldStart}Mesh and Image APIs (formerly Texture){boldEnd} - First step in a new era of creation where developers have direct access to meshes and textures in Lua (Live in Studio), and coming to in-experience. (Late 2024){listItemEnd}{listItemStart}{boldStart}CSG on Meshes{boldEnd} - Perform CSG (Constructive Solid Geometry) operations like Union, Intersect and Subtract on Meshes in Studio and in-experience. (Early 2025){listItemEnd}{listItemStart}{boldStart}New voxel light grid{boldEnd} - Improvements to lighting to bring the highest quality option to as many devices as possible, including shadows, specular highlights, light reflection. (2025){listItemEnd}{listItemStart}{boldStart}Upper Body tracking{boldEnd} - Upper body tracking translates arm and torso movement onto your avatar in real time using the same technology as facial animation. (On hold){listItemEnd}{listItemStart}{boldStart}Speech to text API{boldEnd} - Convert text input into speech, with a set of predefined voices. (Mid 2025){listItemEnd}{listItemStart}{boldStart}Text to speech API{boldEnd} - Convert users' speech to text in real time. (Mid 2025){listItemEnd}{listItemStart}{boldStart}Video API{boldEnd} - We are adding new video instances and APIs that intersect with and build off of the newly-added Audio API. These video functionalities will give developers more control over how they can utilize videos within their experiences - as well as unique new ways to display videos. (2025){listItemEnd}{listEnd}",
    "Description.EngineExperience2024OctoberUpdate": "We're focused on ensuring that Engine can help you achieve your goals regardless of your ambition.{listStart}{listItemStart}{boldStart}Custom Logging {boldEnd} - Allowing you to pass error locations through pcalls. (On hold){listItemEnd}{listItemStart}{boldStart}UI styling{boldEnd} - Stylesheets make it possible to change the look and feel of your UI with one click. (Early 2025){listItemEnd}{listItemStart}{boldStart}Occlusion culling {boldEnd} - Reduces the amount of occluded geometry rendered, which moderately to greatly improves performance depending on the scenario. (2024){listItemEnd}{listItemStart}{boldStart}DataModel Isolation and Script Capabilities (Beta){boldEnd} - Ability to insert models with scripts into experiences and have those scripts isolated from modifying the world or accessing Roblox APIs that are not explicitly allowed. This makes it is safer to use models shared by other developers, and empowers in-experience creation, include scripting without impacting server state. (Late 2024){listItemEnd}{listItemStart}{boldStart}Immersion Mode for VR{boldEnd} - Support for tracked controllers in VR that animate avatar arms in real time. ({animatingAvatarInVrLinkStart}Live{animatingAvatarInVrLinkEnd}){listItemEnd}{listItemStart}{boldStart}Improved Haptics Controls{boldEnd} - Improved API for adding haptics to your experiences and UI across all supported platforms. (Late 2024){listItemEnd}{listEnd}",
    "Description.GenerativeAI2024OctoberUpdate": "Roblox is building Generative AI tools to scale your creation efforts and let you focus on the aspects that matter most. This technology will help you learn, code, debug, build faster, iterate more, and augment your skills to create even better content.{listStart}{listItemStart}{boldStart}Material Generator Full Release{boldEnd} - Quickly generate visually-compelling materials using natural language. ({materialGeneratorLinkStart}Live{materialGeneratorLinkEnd}){listItemEnd}{listItemStart}{boldStart}Assistant Full Release in Studio{boldEnd} - Powerful Generative AI Assistant in Studio that helps generate scripts, run tasks, explain code and find documents, allowing you to focus on creative work while the assistant handles the mundane tasks. (Late 2024){listItemEnd}{listItemStart}{boldStart}Texture Generator (Beta) (formerly AI texturing){boldEnd} - Text to texture generation to re-style your 3d meshes. ({textureGeneratorBetaLinkStart}Live{textureGeneratorBetaLinkEnd}){listItemEnd}{listEnd}",
    "Description.AvatarCreation2024OctoberUpdate": "Avatars are a core part of Roblox. From using them to communicate to creating your own, our avatar features mimic real-life communication, empower self-expression, and drive creation. Here are some of the features we are enabling to create a community-led Marketplace where any creator can make an avatar that is expressive, communicative, and personalized:{listStart}{listItemStart}{boldStart}Improved Avatar Face and Body Tooling{boldEnd} - Enhancing how you can import, create, and publish avatar assets. (On hold){listItemEnd}{listItemStart}{boldStart}Community-led Marketplace{boldEnd} - Anyone can publish 3D avatar items to the Marketplace. ({anyoneCanPublishAvatarItemsLinkStart}Live{anyoneCanPublishAvatarItemsLinkEnd}){listItemEnd}{listItemStart}{boldStart}Marketplace price floors{boldEnd} - Improve price floors for items in the Marketplace to help grow creator earnings. (Live){listItemEnd}{listItemStart}{boldStart}Marketplace search and recommendations{boldEnd} - Improvements in Marketplace search and recommendations to create a more seamless shopping experience. (On-going){listItemEnd}{listItemStart}{boldStart}Photo to avatar{boldEnd} - Create avatars from photo and text prompts using generative AI. (Early 2025){listItemEnd}{listItemStart}{boldStart}Accessory adjustment tool{boldEnd} - Avatar editor tool that allows you to adjust the size and placement of accessories on your avatar. (Late 2024){listItemEnd}{listItemStart}{boldStart}R6 to 15 Conversion Tool{boldEnd} - Streamline the conversion of existing R6 experiences to R15 with tools to migrate characters, animations and scripts. (On hold){listItemEnd}{listItemStart}{boldStart}Avatar Auto Setup (Beta){boldEnd} - Simplify and automate the creation of fully functional Roblox-ready avatars from single-mesh 3D models of humanoid-like bodies. Launched in {avatarAutoSetupAlphaLinkStart}Alpha{avatarAutoSetupAlphaLinkEnd} and {avatarAutoSetupBetaLinkStart}Beta{avatarAutoSetupBetaLinkEnd}.{listItemEnd}{listItemStart}{boldStart}Avatar Auto Setup (Full Release){boldEnd} - Simplify and automate the creation of fully functional Roblox-ready avatars from single-mesh 3D models of humanoid-like bodies. Targeting full release. (Early 2025){listItemEnd}{listItemStart}{boldStart}UGC Validation{boldEnd} - Unified library of validation checks for UGC assets (accessories and bodies) to enforce a minimum quality bar and compatibility with existing marketplace assets. (Live){listItemEnd}{listItemStart}{boldStart}Archiving Avatar Items{boldEnd} - Allows creators to archive avatar items themselves, without reaching out to Roblox. (Late 2024){listItemEnd}{listItemStart}{boldStart}Marketplace Analytics{boldEnd} - We are expanding Creator Analytics for Avatar Items to include item-level insights such as buyer demographics, publishing advance rebates recouped, item sales location breakdown, and more. (Late 2024){listItemEnd}{listItemStart}{boldStart}Community Avatars{boldEnd} - We are opening up the community's ability to create and share full Avatars to Marketplace, by combining existing bodies, accessories, and clothing. (Late 2024){listItemEnd}{listItemStart}{boldStart}Avatar Item Thumbnail Improvements{boldEnd} - We are making a series of thumbnail improvements to improve the Marketplace user experience and make it easier for users to find items they love. We will begin with lighting improvements and providing tools to creators to control how their items are displayed in Marketplace. (Late 2024){listItemEnd}{listEnd}",
    "Description.CloudCreation2024OctoberUpdate": "Large, lifelike worlds will require heavy computational power and vast amounts of storage to create. Offloading these needs to the cloud will ensure that you can reliably create megascale experiences without disruption, while collaborating with teams of any size.{listStart}{listItemStart}{boldStart}Team Create Assets{boldEnd} - Access newly uploaded assets without needing to restart Team Create. (Live){listItemEnd}{listItemStart}{boldStart}Granular Collaborator Permissions{boldEnd} - Give collaborators scoped access to your experiences in Team Create. (Mid 2025){listItemEnd}{listItemStart}{boldStart}Comments and Annotations Inside Studio{boldEnd} - Annotate and leave comments in Studio for your collaborators. (Early 2025){listItemEnd}{listItemStart}{boldStart}Experience Activity History{boldEnd} - View history of collaboration activities and configuration changes in your experiences on Creator Hub and Studio. ({activityHistoryLinkStart}Live{activityHistoryLinkEnd}){listItemEnd}{listItemStart}{boldStart}Scripting and Package activities in Studio Activity History{boldEnd} - View scripting and Package activities from your collaborators in the Studio Activity History. (Early 2025){listItemEnd}{listItemStart}{boldStart}Enhance Drafts {boldEnd} - We've put this feature on hold as it will be addressed as part of broader project. (On hold){listItemEnd}{listItemStart}{boldStart}Asset Management: Revamped Asset Manager (Beta){boldEnd} - Launching a revamped Asset Manager in Studio. Enable users to easily organize (folders/labels) and search assets in their accounts and their groups' accounts. We'll be deprecating the existing Asset Manager and migrating inventory out of Toolbox into the new Asset Manager, and Toolbox will become solely focused on Creator Store content (Early 2025){listItemEnd}{listItemStart}{boldStart}Asset Management: Revamped asset manager (Full Release){boldEnd} - Full launch of revamped asset manager. New features; Folders (or labels). (Mid 2025){listItemEnd}{listEnd}",
    "Heading.PoweringMusicDiscovery": "Powering music discovery",
    "Description.PoweringMusicDiscovery2024OctoberUpdate": "Our vision is to establish Roblox as a destination for organic and immersive music discovery. This includes features like Music Charts and What's Playing UI, as well as a new DistroKid integration.{listStart}{listItemStart}{boldStart}Audio Meta Data API{boldEnd} - Developer-facing API to help developers add audio metadata to their experiences. ({getAudioMetadataAsyncLinkStart}Live{getAudioMetadataAsyncLinkEnd}){listItemEnd}{listItemStart}{boldStart}DistroKid Music Integration{boldEnd} - You can now incorporate select music from DistroKid's catalog into your experiences, bringing a new level of creativity and engagement to the platform. For artists that own the rights to their music, starting in October, you'll be able to upload your music via DistroKid. (Late 2024){listItemEnd}{listItemStart}{boldStart}Music Experience Charts{boldEnd} - The Roblox Discover page will include top charts of music-themed experiences. Users will be able to launch associated experiences from charts. This chart is a mixture of sub-genres related to music, such as DJ, rhythm, music education, etc. (Late 2024){listItemEnd}{listItemStart}{boldStart}Basic Song Charts{boldEnd} - A web-based destination for industry and off-platform discovery includes popular songs on Roblox without sign-in. (Late 2024){listItemEnd}{listItemStart}{boldStart}What's Playing (UI in Experience Controls){boldEnd} - Music section in the upcoming experience controls will show users what music they are currently hearing and by which artist. Users will also see additional features to help with settings and reporting. (Early 2025){listItemEnd}{listItemStart}{boldStart}Expanded Song Charts{boldEnd} - As an extension of the “Music Experience Charts” feature, the Roblox Discover page will include top charts of popular songs. Users can open a Song Detail Page from charts, showing what experiences carry that song. (Early 2025){listItemEnd}{listEnd}",
    "Heading.StudioEnginePerformanceStability": "Studio & Engine Performance and Stability",
    "Description.StudioEnginePerformanceStability2024OctoberUpdate": "We're working behind the scenes to optimize your experience across platforms so your experience works well no matter what device your user is on–saving you time, resources, and effort.{listStart}{listItemStart}{boldStart}Improve Team Create Join Time {boldEnd} - Start working on your experience, of any size, faster. (Live){listItemEnd}{listItemStart}{boldStart}Reduce Studio Hangs {boldEnd} - Drastically reduce cases where Studio lags or hangs while you are working. (Mid 2025){listItemEnd}{listItemStart}{boldStart}Explorer and Properties improvement for large places{boldEnd} - Reduce lags when using the Explorer and Properties panes in large places. (Mid 2025){listItemEnd}{listItemStart}{boldStart}Output performance for large places{boldEnd} - Improve lag when printing to Output in large places. (Late 2024){listItemEnd}{listItemStart}{boldStart}Improved and faster autocomplete for scripts{boldEnd} - Faster, progressive display of autocomplete results for scripts. (Late 2024){listItemEnd}{listItemStart}{boldStart}Native Code Generation Server{boldEnd} - Improves script performance on RCC and in Studio plugins by compiling Luau to host CPU instructions instead of interpreting bytecodes in a virtual machine. ({luauNativeCodeGenerationLinkStart}Live{luauNativeCodeGenerationLinkEnd}){listItemEnd}{listItemStart}{boldStart}Type Inference for Native Compilation{boldEnd} - Incorporating types added by Luau into the decisions made by native code generation will allow more optimizations to performed and reduce the size of the generated native code. (Late 2024){listItemEnd}{listEnd}",
    "Description.RobloxHome2024OctoberUpdate": "The Roblox Home page connects people with experiences that they will love, and will help you find your ideal audience. Every user's Home page connects them to new experiences through a state-of-the-art recommendation engine. We aim to make it easier for every Roblox experience to engage and grow their user base by recommending the experience to the right audience.{listStart}{listItemStart}{boldStart}Continuous Home{boldEnd} - Improving discovery on the Home page through an extended, continually scrollable feed. (Live){listItemEnd}{listItemStart}{boldStart}Social and Contextual Descriptors{boldEnd} - Labels like Friend presence in the experience, Genre and additional insights to distinguish different types of experiences on the Home page. (Late 2024){listItemEnd}{listItemStart}{boldStart}Thumbnail Personalization{boldEnd} - Upload multiple thumbnails and we'll automatically show the best thumbnail to each user on Home. (Late 2024){listItemEnd}{listItemStart}{boldStart}Improved Experience Details {boldEnd} - We're updating the Experience Details Page to improve usability and conversion. We're adding the experience icon to mobile experience pages and showing improved insights about the experience to help users decide better. (Live){listItemEnd}{listItemStart}{boldStart}Recommendation Algorithm Improvements{boldEnd} - This is an on-going effort, we will continue to improve recommendations for users. (Ongoing){listItemEnd}{listItemStart}{boldStart}Improved Discovery of Events & Updates{boldEnd} - We're building a new unified way to communicate updates and events to your users. This includes a refresh of the Event creation tool in Creator Hub (rebranded as 'Events and Updates') and more surfacing your events and updates more visibly across discovery, including on the details page, Home, Search, and notifications. (Ongoing){listItemEnd}{listEnd}",
    "Description.PowerfulSearch2024OctoberUpdate": "We're empowering users to explore a variety of content that matches their interests and passions, and be able to find anything that exists on Roblox. These improved discovery tools will deliver more relevant traffic to your experience and help new experiences get discovered more quickly.{listStart}{listItemStart}{boldStart}Dynamic Filters{boldEnd} - A community-requested feature that will enable users to find your experience based on genre or tag. (On hold){listItemEnd}{listItemStart}{boldStart}Algorithmically-Generated Categories and Sorts{boldEnd} - Highlighting new, high quality, and trending experiences. ({enhancedDiscoverPageTopChartsLinkStart}Live{enhancedDiscoverPageTopChartsLinkEnd}){listItemEnd}{listItemStart}{boldStart}Combined Search and Discovery{boldEnd} - Merging Discover functionality with Search to simplify navigation. Search, browse, and filter all in one place. (On hold){listItemEnd}{listItemStart}{boldStart}Expanding Charts{boldEnd} - We turned the Discover page into Charts. Charts showcase what is top and trending on Roblox across multiple dimensions and criteria, and more will be added to this expanding discovery surface. (Live){listItemEnd}{listItemStart}{boldStart}Search Landing Page (SLP){boldEnd} - We are building a search zero state to showcase recently visited experiences, as well as trending and recent searches. (Ongoing){listItemEnd}{listItemStart}{boldStart}Unified Search Result Page{boldEnd} - Improved ranking of experiences, people inside search result page and ranking them based on their relevance to the user query regardless of content type. (Late 2024){listItemEnd}{listItemStart}{boldStart}Improved Experience Genres{boldEnd} - Improved experience genre taxonomy and way for creators to select their genre. (Late 2024){listItemEnd}{listEnd}",
    "Description.Matchmaking2024OctoberUpdate": "Matchmaking is at the heart of Roblox's vision for connecting people. We abstract away the complexity of game server management and use signals like friends, latency, language, age, and server occupancy to direct users to the server most likely to maximize engagement.{listStart}{listItemStart}{boldStart}Auto-Reconnect{boldEnd} - Connect players to the same server following an update. ({automaticallyReconnectDuringUpdatesLinkStart}Live{automaticallyReconnectDuringUpdatesLinkEnd}){listItemEnd}{listItemStart}{boldStart}Custom Matchmaking{boldEnd} - Custom Matchmaking lets you, the creator, define rules to customize matchmaking, allowing you to match players in a way that best suits your experience. Tailor the experience to your unique vision, optimizing how players are matched for maximum engagement. Skill-based matching and similar use cases with custom attributes and matchmaking rules (Early 2025). Additional rule types and deeper analytics. (Mid 2025) Queue-based Matchmaking and rule expansions. (Late 2025) {listItemEnd}{listEnd}",
    "Description.Notifications2024OctoberUpdate": "{developerInvitesLinkStart}Developer-driven Invites{developerInvitesLinkEnd} are a new way to customize and improve the invite experience for users, and some creators are already reporting a 10x increase in players joining their friends. We aim to make it even easier for you to reach your community, and help you optimize the value of each notification.{listStart}{listItemStart}{boldStart}Notification Analytics{boldEnd} - Additional aggregated data provided via Creator Analytics. ({experienceNotificationsLinkStart}Live{experienceNotificationsLinkEnd}){listItemEnd}{listItemStart}{boldStart}Universal Experience Notifications API{boldEnd} - Create any kind of notification for your experiences, beyond just invites. ({experienceNotificationsLinkStart}Live{experienceNotificationsLinkEnd}){listItemEnd}{listItemStart}{boldStart}Revamped Experience Updates {boldEnd} - The current 'Game Updates' page in Creator Hub will be overhauled to support localization, scheduling, and audience targeting. Users will also be able to receive these updates via mobile push if they opt in. (Mid 2025){listItemEnd}{listEnd}",
    "Description.LanguageBarriers2024OctoberUpdate": "We strive to empower all our users to communicate with one another, regardless of language. By dissolving communication barriers, Roblox will help your community stay more closely connected, which will lead to increased engagement.{listStart}{listItemStart}{boldStart}In-experience Translation Feedback{boldEnd} - Allow users to share suggestions on ways you can improve your localization quality. ({translationFeedbackLinkStart}Live{translationFeedbackLinkEnd}){listItemEnd}{listItemStart}{boldStart}Fully translated documentation for 95% of creators{boldEnd} - Machine translation will let the majority of creators read documentation in their native language. (Late 2024){listItemEnd}{listItemStart}{boldStart}New Regions{boldEnd} - Shipped support for four new locales on platform by the end of 2023 - Indonesian, Thai, Turkish, and Vietnamese. Shipped support for Polish in Feb 2024. Arabic support upcoming in the second half of 2024. (Late 2024){listItemEnd}{listItemStart}{boldStart}Support for Language Variants{boldEnd} - Localization support for variants within languages, such as English (US) and English (UK). (Early 2025){listItemEnd}{listItemStart}{boldStart}Automatic Translation for Experience Icons & Thumbnails{boldEnd} - Automatically translate text inside icons and thumbnails while matching the style and feel of the original image. (Late 2024){listItemEnd}{listItemStart}{boldStart}Automatic Translation for In-Experience Images{boldEnd} - Automatically translate text inside in-experience images while matching the style and feel of the original image. (Early 2025){listItemEnd}{listItemStart}{boldStart}Real-Time Translation API{boldEnd} - Creators can call Roblox's automatic translation API to translate UGC and dynamic content in real time. (Late 2024){listItemEnd}{listItemStart}{boldStart}Require by string{boldEnd} - Add support for require-by-string to the engine, allowing users to better manage modules in their place. (2025){listItemEnd}{listItemStart}{boldStart}Voice chat captioning + translations{boldEnd} - All users can see captions of any voice chat happening via spatial voice. The captions will go through the text filter and also be translated into your account language if possible. (2025){listItemEnd}{listItemStart}{boldStart}Real-time voice chat translation{boldEnd} - Real-time speech translation for voice chat. (2025){listItemEnd}{listItemStart}{boldStart}Additional Video Upload Language Support{boldEnd} - We are adding additional language support to video uploads, beyond English, starting in Q4 2024. We launched Spanish locale support, with additional locales throughout 2025. (Ongoing){listItemEnd}{listEnd}",
    "Heading.PopularAllDevices": "Roblox on all popular devices",
    "Description.PopularAllDevices2024OctoberUpdate": "Roblox is one of the largest immersive platforms available anywhere. As devices evolve and new versions become available, we want to provide everyone on Roblox with the best experience possible for their device. Creators can publish experiences once and immediately get them into the hands of a global audience across all of the platforms we support.{listStart}{listItemStart}{boldStart}Hold button short cut to Launch experiences on Console{boldEnd} - A shortcut - allowing users to launch directly into an experience by skipping the EDP page (similar to other platform), by holding a button. (Late 2024){listItemEnd}{listEnd}",
    "Description.EmpowerCommunication2024OctoberUpdate": "People already use Roblox to connect with friends. We will be enabling new ways for users to connect, share, and express themselves, and provide creators with tools and APIs to build new forms of communication experiences.{listStart}{listItemStart}{boldStart}Captures API{boldEnd} - The Captures APIs allow creators to include pre-set moments within experiences where a screenshot is automatically taken for users to save, share, or delete the screenshot. ({captureApisLinkStart}Live{captureApisLinkEnd}){listItemEnd}{listItemStart}{boldStart}Updated in-experience controls{boldEnd} - Consistent and adaptive experience controls that make it easier for users to find their most frequently used action. ({inExperienceControlsLinkStart}Live{inExperienceControlsLinkEnd}){listItemEnd}{listItemStart}{boldStart}Roblox Groups rebranded Roblox Communities{boldEnd} - Roblox Groups, which allows creators and users to form communities with people who share similar interests on the platform, is becoming Communities to reflect the expanding toolset we're building for creators to connect with their audiences. With this launch will come a Community Ban feature, where Creators can now permanently ban a user from their Community. (Late 2024){listItemEnd}{listItemStart}{boldStart}Managing your Roblox Community{boldEnd} - Community owners now have the ability to ban community members. (Late 2024){listItemEnd}{listItemStart}{boldStart}Forums{boldEnd} - Forums, a dedicated space where users can share feedback, discuss gameplay, and report issues found. (Late 2024){listItemEnd}{listItemStart}{boldStart}Sharing on Profile Experiment{boldEnd} - Experiment to allow users the ability to share screenshots to their profile. This is expected to promote discovery and play of new experiences for users. (Late 2024){listItemEnd}{listItemStart}{boldStart}In-experience Text Chat on Console{boldEnd} - Enable in-experience text chat on Xbox and PlayStation. (Late 2024){listItemEnd}{listItemStart}{boldStart}Party API{boldEnd} - Announced at RDC, Party is a seamless way for users to group up with their friends (up to 6), discover, and play their favorite games and experiences together. Party APIs allow you to see who is in a Party, empowering you to provide the best experience to keep friends together. (Early 2025){listItemEnd}{listEnd}",
    "Description.RobloxCloud2024OctoberUpdate": "{cloudLinkStart}Roblox Cloud{cloudLinkEnd} will support a broader application ecosystem through a set of flexible and secure web APIs. We envision a world where you'll be able to automate workflows through scripts, publish via the command line, or create bots to help manage your community.{listStart}{listItemStart}{boldStart}Memory Stores Enhancement{boldEnd} - Improve Memory Stores to support the key use cases better: 1) A data structure, HashMap, that has much higher limits for features like Server List ({memoryStoreHashMapLinkStart}Live{memoryStoreHashMapLinkEnd}), 2) Open Cloud APIs for Memory Stores that unlock use cases like external live leaderboards. ({openCloudMemoryStoresLinkStart}Live{openCloudMemoryStoresLinkEnd}){listItemEnd}{listItemStart}{boldStart}Improved Data Stores (Beta){boldEnd} - Adding easy-to-use schematized user profile management and platform support for session locking and retry logic. (Late 2024){listItemEnd}{listItemStart}{boldStart}Badges Enhancements{boldEnd} - Badges privacy options and ability to reorder. (Late 2024){listItemEnd}{listItemStart}{boldStart}Data Stores Versioning Update{boldEnd} - Optimize number of versions stored, versions available longer, support snapshots. ({dataStoresVersioningLinkStart}Live{dataStoresVersioningLinkEnd}){listItemEnd}{listItemStart}{boldStart}Game Server Performance Dashboards{boldEnd} - New dashboards to see Server CPU and Memory Usage Breakdowns. ({lowEndAndroidLinkStart}Live{lowEndAndroidLinkEnd}){listItemEnd}{listItemStart}{boldStart}Improved delivery of 3D meshes{boldEnd} - LoD (Level of Detail) generation for your meshes will be much better and continuously improve over time. More optimized delivery for 3D meshes to reduce client asset download times. (Ongoing){listItemEnd}{listEnd}",
    "Description.AccelerateCreation2024OctoberUpdate": "Creator Store contains millions of high-quality assets, but it's not always easy to find them. We aim to connect you with the perfect asset for any occasion and ensure everything you find in the Creator Store is safe to use. We have also heard your feedback about Creator Store monetization, and will be rolling out a plan to improve earnings for asset creators.{listStart}{listItemStart}{boldStart}Additional Spam Protections{boldEnd} - More rigorous spam detection and punishments for repeat offenders. (Live){listItemEnd}{listItemStart}{boldStart}Personalized Asset Recommendations{boldEnd} - Discover assets based on the content in your experience. Launched but was paused due to scalability issues and deprioritized. (On hold){listItemEnd}{listItemStart}{boldStart}Improved Asset Previews & Social Links on Creator Store{boldEnd} - We will enable social links (including GitHub, YouTube, etc.) for Creator Store Assets. We will also be adding additional images for Models and MeshParts. We will also be enabling presentation of higher resolution images. (Live){listItemEnd}{listEnd}",
    "Description.SafetyAndModeration2024OctoberUpdate": "Our safety features, tools, and moderation capabilities have been built into the design of our product. We are continuing to work to make those capabilities smarter and stronger over time and will be investing more heavily in the detection and prevention of in-experience exploits.{listStart}{listItemStart}{boldStart}Ads brand safety and suitability controls{boldEnd} - Give advertisers brand safety and suitability controls for Immersive Ads to give more control over where their ads will be shown. ({expandedPublisherEligibilityBrandSuitabilityLinkStart}Live{expandedPublisherEligibilityBrandSuitabilityLinkEnd}){listItemEnd}{listItemStart}{boldStart}Moderation Precision{boldEnd} - We are working hard to lessen the burden of asset moderation while keeping the community safe. (Ongoing){listItemEnd}{listItemStart}{boldStart}Alt-Account Detection{boldEnd} - Take action on repeat offenders and help us combat exploiters on Roblox. ({banApiAltAccountDetectionLinkStart}Live{banApiAltAccountDetectionLinkEnd}){listItemEnd}{listItemStart}{boldStart}Rights Manager (formerly Tools to manage Intellectual Property){boldEnd} - New centralized place for developers to easily manage the intellectual property rights of their creations. ({rightsManagerLinkStart}Live{rightsManagerLinkEnd}){listItemEnd}{listItemStart}{boldStart}Content quality moderation{boldEnd} - We're taking a closer look at content quality to ensure we surface original, non-duplicative, and non-misleading content that users will trust and engage with. When we identify that certain experiences could use a quality improvement to be more discoverable, we will notify creators in Creator Hub. (Early 2025){listItemEnd}{listItemStart}{boldStart}Ban API{boldEnd} - Allows creators to temporarily or permanently ban bad actors from their experience if they violate the established guidelines for that experience. ({banApiAltAccountDetectionLinkStart}Live{banApiAltAccountDetectionLinkEnd}){listItemEnd}{listItemStart}{boldStart}Rights Manager Claims and Disputes{boldEnd} - Claims will now be sent to creators. Creators can manage claims, disputes, and claims against them. (Late 2024){listItemEnd}{listItemStart}{boldStart}Rights Manager Search and Match{boldEnd} - Creators can search and claim items that potentially match their intellectual property. ({rightsManagerLinkStart}Live{rightsManagerLinkEnd}){listItemEnd}{listEnd}",
    "Description.EarnAndAdvertise2024OctoberUpdate": "We recently introduced {immersiveAdsLinkStart}Immersive Ads{immersiveAdsLinkEnd}, which allow developers to place high-quality, native ad units in their experience. These innovative ad units offer a new way for you to publish and earn from advertisements.{listStart}{listItemStart}{boldStart}Earn more on Creator Store sales{boldEnd} - Creators will get 100% of Creator Store sales in Creator Hub and Studio minus sales taxes and payment processing fees. Items will be priced and sold in $USD instead of Robux and no longer subject to DevEx. ({creatorStoreSellerOnboardingLinkStart}Live{creatorStoreSellerOnboardingLinkEnd}){listItemEnd}{listItemStart}{boldStart}Creator Affiliate Program{boldEnd} - Bring new users to Roblox and earn up to 50% on their purchases. ({pilotCreatorAffiliateProgramLinkStart}Pilot - Live{pilotCreatorAffiliateProgramLinkEnd}). Targeting full release. (2025){listItemEnd}{listItemStart}{boldStart}Sell Models on Creator Store{boldEnd} - We will enable $USD pricing and purchasing for Creator Store models once the Asset Privacy and Permissions Open Beta is available. (Early 2025){listItemEnd}{listItemStart}{boldStart}Immersive Ads video ad format and reporting{boldEnd} - Launch the video ad format for Immersive Ads to provide advertisers with new ways to express their ideas and provide new opportunities for publishers to earn. ({immersiveAdsVideoLaunchLinkStart}Live{immersiveAdsVideoLaunchLinkEnd}){listItemEnd}{listItemStart}{boldStart}Ads targeting{boldEnd} - More targeting options for advertisers to reach people interested in specific genres and other dimensions. ({enhancedSponsoredExperiencedAdsManagerLinkStart}Live{enhancedSponsoredExperiencedAdsManagerLinkEnd}){listItemEnd}{listItemStart}{boldStart}Subscribe within experiences with Roblox Credit{boldEnd} - Users can purchase subscriptions within experience with Roblox Credit, in addition to the saved card payment method offered today. (Live){listItemEnd}{listItemStart}{boldStart}Roblox Groups 'Announcements' can be posted via Guilded {boldEnd} - A community owner can now, using Guilded, send a message (Announcements) to their whole community at once. ({announcementsRobloxGroupsLinkStart}Live{announcementsRobloxGroupsLinkEnd}){listItemEnd}{listItemStart}{boldStart}Expanded Subscription API functionality {boldEnd} - Allow developers to access more information on subscriber status and subscription analytics. Subscription APIs will also be available on Open Cloud. ({subscriptionsWithinExperiencesApiExpansionsLinkStart}Live{subscriptionsWithinExperiencesApiExpansionsLinkEnd}){listItemEnd}{listItemStart}{boldStart}Subscription promotions{boldEnd} - Enabling devs to run promotions on subscriptions (e.g. free trial or discounted first month). (On hold){listItemEnd}{listItemStart}{boldStart}Subscription description updates{boldEnd} - Safely enabling the ability to edit and update the description of active subscriptions. ({subscriptionsExpansionNewFeaturesLinkStart}Live{subscriptionsExpansionNewFeaturesLinkEnd}){listItemEnd}{listItemStart}{boldStart}Commerce in-experience via Shopify{boldEnd} - Ability to make physical products retailed via your Shopify storefronts available for users to purchase within your experience. (Early 2025){listItemEnd}{listItemStart}{boldStart}Sponsored experiences{boldEnd} - Ability to sponsor 17+ experiences and paid access experiences. (Early 2025){listItemEnd}{listItemStart}{boldStart}Ads Manager{boldEnd} - Improving ways to create ads (copy, edit) and ad reporting improvements. (Early 2025){listItemEnd}{listEnd}",
    "Description.LearnConnectCreate2024OctoberUpdate": "Creation on Roblox is constantly evolving, and we strive to make it easy for users of all skill levels to learn and grow with the platform. In the coming year, we'll improve our documentation coverage and quality, expand our learning series, grow our Creator Events program, and support creators who are making next generation experiences.{listStart}{listItemStart}{boldStart}Docs Available in Studio{boldEnd} - Access documentation directly from Studio with improved tooltips in the script editor. (Late 2024){listItemEnd}{listItemStart}{boldStart}Updated Experience Templates{boldEnd} - Re-releasing some experience templates with much needed updates. Launched Racing template ({studioRacingTemplateLinkStart}live{studioRacingTemplateLinkEnd}), Laser Tag template ({studioLaserTagTemplateLinkStart}live{studioLaserTagTemplateLinkEnd}), and Platformer template ({studioPlatformerTemplateLinkStart}live{studioPlatformerTemplateLinkEnd}). More templates coming in later this year. (Early 2024){listItemEnd}{listItemStart}{boldStart}Tutorials in-Studio{boldEnd} - New Roblox-created tutorials for new and growing creators. Tutorials can be found through Studio Start and followed without leaving Studio. (Early 2025){listItemEnd}{listItemStart}{boldStart}Community-Created Learning Content{boldEnd} - More ways for the community to create educational content for other creators, including templates, tutorials, and highlighted articles. (Mid 2025){listItemEnd}{listItemStart}{boldStart}Cross-Product Creator Home{boldEnd} - One cohesive, personalized experience across Creator Hub Home and Studio Start Home. (Mid 2025){listItemEnd}{listItemStart}{boldStart}Creator Fund (formerly Game Fund){boldEnd} - Supporting creators who want to build the next generation of Roblox experiences with a $35 million investment. (Ongoing){listItemEnd}{listEnd}",
    "Description.Insight2024OctoberUpdate": "Many top Roblox creators already use analytics to grow their experiences, but data can be overwhelming. We want to offer everyone the power of a trusted data analyst, to help you interpret complicated data patterns and know what actions to take next.{listStart}{listItemStart}{boldStart}In Game Economy and Funnel Tracking (formerly Standard Event Schema){boldEnd} - Instrument schema to unlock funnel charts such as level progression and economy source vs. sink. ({analyticsTrackFunnelLinkStart}Live{analyticsTrackFunnelLinkEnd}){listItemEnd}{listItemStart}{boldStart}Data Export API{boldEnd} - On hold to prioritize custom events first based on creator feedback. (On hold){listItemEnd}{listItemStart}{boldStart}Custom Analytics Events{boldEnd} - Track custom analytics events in your experience. ({analyticsCustomEventsLinkStart}Live{analyticsCustomEventsLinkEnd}){listItemEnd}{listItemStart}{boldStart}External Acquisition Source{boldEnd} - Generate a unique URL and track acquisition metrics for it. (Late 2024){listItemEnd}{listItemStart}{boldStart}Improved Insights and Benchmarks{boldEnd} - Give you transparency around discovery and help you take action to grow your experience. ({analyticsRecommendationsLinkStart}Live{analyticsRecommendationsLinkEnd}){listItemEnd}{listItemStart}{boldStart}Remote Configs{boldEnd} - Dynamically update experience settings or content without requiring a new update or deployment. (Mid 2025){listItemEnd}{listItemStart}{boldStart}In-Experience Experimentation{boldEnd} - Test different versions of experience features or content with live players to optimize gameplay and engagement. (Late 2025){listItemEnd}{listEnd}",
    "Description.Personalization2024OctoberUpdate": "It's important to know what's going on with your assets, experiences, collaborators, and the platform at large. This information allows you to take the right actions at the right time, and we want to make it even simpler to take advantage of insights and customize them.{listStart}{listItemStart}{boldStart}Expanded Notifications{boldEnd} - Get informed about critical events like a spike in crash rates, a collaboration invite, or a 'right to be forgotten' request. (Ongoing){listItemEnd}{listItemStart}{boldStart}Notifications in Creator Hub{boldEnd} - Easily stay informed about important updates anywhere on Creator Hub with notifications. ({creatorHubNotificationsLinkStart}Live{creatorHubNotificationsLinkEnd}){listItemEnd}{listEnd}",
    "Description.Collaborate2024OctoberUpdate": "Most top experiences are developed by teams, and Roblox wants to make it even easier for you to collaborate. Talent Hub will help you connect with people to grow your team, and we are re-building 'Groups' from the ground up to make it easier to manage permissions.{listStart}{listItemStart}{boldStart}Self-serve Experience Ownership Transfer{boldEnd} - Free, self-service experience transfer from account to group. (Late 2024){listItemEnd}{listItemStart}{boldStart}Creator Groups in Creator Hub{boldEnd} - Assign more specific permissions to roles, provide multiple roles to a member, and add collaborators with a new invite flow. ({groupsInCreatorHubLinkStart}Live{groupsInCreatorHubLinkEnd}){listItemEnd}{listItemStart}{boldStart}Overhauled Group Revenue{boldEnd} - Pay out collaborators directly within Creator Hub, and define more granular percentage splits by revenue source rather than total Group revenue. ({groupRevenueInCreatorHubLinkStart}Live{groupRevenueInCreatorHubLinkEnd}){listItemEnd}{listItemStart}{boldStart}Groups owning Groups{boldEnd} - Set up more complicated hierarchies with your collaborators by managing groups owned by your primary group. (Mid 2025){listItemEnd}{listItemStart}{boldStart}Asset Privacy and Permissions: Audio and Video{boldEnd} - Sharing audio and video assets with friends. ({assetPrivacyLinkStart}Live{assetPrivacyLinkEnd}){listItemEnd}{listItemStart}{boldStart}Asset Privacy and Permissions: Audio and Video{boldEnd} - Sharing audio and video assets with groups. (Late 2024){listItemEnd}{listItemStart}{boldStart}Asset Privacy and Permissions: Animations{boldEnd} - Sharing animations with friends and groups. (Mid 2025){listItemEnd}{listItemStart}{boldStart}Asset Privacy and Permissions: Open Beta for meshes, mesh parts, decals, Images and composite propagation (Models and Packages){boldEnd} - Privacy and sharing with friends and groups for meshes, mesh parts, decals, images, models, and packages. (Early 2025){listItemEnd}{listItemStart}{boldStart}Asset Privacy and Permissions: Limited Access Beta for Meshes, Images, Models and Packages{boldEnd} - Privacy and sharing with friends and groups for meshes, mesh parts, decals, images, models, and packages. ({assetPrivacyMeshesLinkStart}Live{assetPrivacyMeshesLinkEnd}){listItemEnd}{listEnd}",
    "Description.EasyCreation2024OctoberUpdatePart2": "{listItemStart}{boldStart}3rd Party Interoperability for Images and Meshes{boldEnd} - Integrated file-based workflows for iterating on Media assets like meshes and images. Ideally an extension of the script-based workflows with extended functionality to manage publishing and moderation of assets. (Mid 2025){listItemEnd}{listItemStart}{boldStart}Engine Open Cloud API Beta (Scripting only){boldEnd} - Use Open Cloud APIs for editing the DataModel using external tools. ({openCloudEngineApiScriptingBetaLinkStart}Live{openCloudEngineApiScriptingBetaLinkEnd}){listItemEnd}{listItemStart}{boldStart}Open Cloud Engine API for Luau Execution{boldEnd} - Run Luau code in Roblox's servers via Open Cloud so external tools have full access to the power of the Roblox engine. ({openCloudExecutionLuauBetaLinkStart}Live{openCloudExecutionLuauBetaLinkEnd}){listItemEnd}{listItemStart}{boldStart}Detailed Place Version History{boldEnd} - Introduce detailed place version history in Studio that tracks who made changes and when. (Mid 2025){listItemEnd}{listItemStart}{boldStart}Improved Package Discoverability and Update Workflow{boldEnd} - Easily discover package actions and apply updates. (Live){listItemEnd}{listItemStart}{boldStart}OSS Code Libraries as Packages on Creator Store{boldEnd} - OSS Code Libraries can be distributed as Packages on Creator Store. (2025){listItemEnd}{listItemStart}{boldStart}Package Publish support Place Publish {boldEnd} - Enable Package publish to trigger Place publish within an Experience, without having to manually open each place. (Mid 2025){listItemEnd}{listItemStart}{boldStart}Gamepad + VR support in Studio Emulator{boldEnd} - Platform specific gamepads (e.g., Xbox, PlayStation)  ({studioControllerEmulatorLinkStart}live{studioControllerEmulatorLinkEnd}), and VR can be emulated. (Late 2024){listItemEnd}{listItemStart}{boldStart}Dragger Improvements{boldEnd} - Improved controls, guides, and measurements for draggers. ({draggerImprovementsDefaultLinkStart}Live{draggerImprovementsDefaultLinkEnd}){listItemEnd}{listItemStart}{boldStart}DragDetectors for UI{boldEnd} - Make UI in your experience draggable and interactive without scripting. (Late 2024){listItemEnd}{listItemStart}{boldStart}Terrain Creation{boldEnd} - Create large geographic features (e.g., mountains, lakes, hills) quickly with customizable parameters. (On hold){listItemEnd}{listItemStart}{boldStart}Avatar Setup Editing Tools{boldEnd} - Edit attachment points and cage of an Avatar directly in the Avatar Setup tool. (On hold){listItemEnd}{listItemStart}{boldStart}Viewport Settings -> Visualization Modes{boldEnd} - Modify viewport settings quickly and easily in the viewport. ({studioVisualizationModesLinkStart}Live{studioVisualizationModesLinkEnd}){listItemEnd}{listItemStart}{boldStart}Material Picker{boldEnd} - Consolidated interface to apply and create materials quickly. ({materialPickerLinkStart}Live{materialPickerLinkEnd}){listItemEnd}{listItemStart}{boldStart}Explorer Revamp{boldEnd} - Significantly improve performance of the Explorer widget, especially in large, complex places. Introduce better organizational and editing tools to make quick changes directly from the explorer, increasing creator velocity. (Early 2025){listItemEnd}{listItemStart}{boldStart}Builder Font{boldEnd} - We are releasing our own custom Roblox font family: Builder. It is available in the Creator Store now and soon will be used on the Roblox App, Website, and Creator Hub. ({builderFontLinkStart}Live{builderFontLinkEnd}){listItemEnd}{listItemStart}{boldStart}Updated Type Solver (Beta){boldEnd} - This improves Luau script analysis including more accurate binary operators inferences and new type operators. ({newTypeSolverBetaLinkStart}Live{newTypeSolverBetaLinkEnd}){listItemEnd}{listItemStart}{boldStart}Updated Type Solver (Full Release){boldEnd} - A v1 general and more solid release of our updated luau solver above that will replace the existing solver. (2025){listItemEnd}{listItemStart}{boldStart}Content Importer{boldEnd} - Today, there are multiple import flows in Studio. Working on creating a streamlined single importer that enables users to import all their content easily. (Late 2024){listItemEnd}{listItemStart}{boldStart}Properties Revamp{boldEnd} - Make editing of high-touch properties fast and fluid, and reorganize the properties panel to make interacting with it as quick and easy as possible. Significantly improve performance and stability of the the properties panel, so working with it in large, complex places doesn't slow you down. (Early 2025){listItemEnd}{listItemStart}{boldStart}Avatar Auto Setup (Partial setup){boldEnd} - Ability to customize Avatar Auto Setup to only do parts of the process (skinning, rigging, segmenting) so the creator has more control over the output. (Early 2025){listItemEnd}",
    "Description.EasyCreation2024OctoberUpdatePart1": "{listItemStart}{boldStart}Next Generation Studio UI (Beta){boldEnd} - A completely redesigned Studio UI with easier access to the tools and plugins that best match your unique workflows. ({nextGenStudioPreviewLinkStart}Live{nextGenStudioPreviewLinkEnd}){listItemEnd}{listItemStart}{boldStart}Studio Luau File Sync Preview{boldEnd} - An opt-in preview for working on your scripts as files, enabling you to edit your code using your favorite IDE. As we shared at RDC, we didn't get our first attempt right, so we are releasing an early preview of our next iteration soon to get your feedback on our new approach. (Late 2024){listItemEnd}",
    "Description.EasyCreation2024OctoberUpdateDescription": "Our vision is to provide powerful, flexible workflows for creators to build next-generation immersive 3D experiences and user-generated content (UGC). We are building a foundation that will make it easier than ever to create high quality content, while adding flexibility to your day-to-day tasks. We are also exploring ways we can open the platform in a stable, supported, and future-proof way and will be holding several 'Office Hours' sessions in the near future to share more and answer your questions.",
    "Heading.LegacyFeatures": "Sunsetting legacy features & tools",
    "Description.LegacyFeatures": "We want to keep you in the loop when we are sunset tools or features that we've launched in the past. We hope this transparency gives you the opportunity to keep your experience up-to-date and using the latest tools, features, and APIs that are still being regularly updated and supported.",
    "Heading.SunsettingFeatures": "Tools or features scheduled to be sunset",
    "Description.SunsettingFeatures": "These are the tools, features, or APIs that are currently scheduled to be sunset. You can learn more about what's happening and if it'll impact you by visiting the link next to each item below.{listStart}{listItemStart}{boldStart}Team Chat is being removed from Studio{boldEnd} - In keeping with our effort to drive safe chat on the platform, we’re removing support for Team Chat from Studio by January 30th, 2025, as it does not integrate with parental controls. We believe that creator team communication within Studio will be better served by the ability to annotate and add comments directly within the workspace. We plan to enable annotation and comments early next year. (Early 2025){listItemEnd}{listItemStart}{boldStart}Legacy Chat System is being sunset{boldEnd} - Starting November 30th, 2024, new experiences can not be created that use the legacy chat system. We’re updating our Community Standards 94 to require that creators use TextChatService, creators will have until April 30th, 2025 to migrate. You can read more on the {removingLegacyChatStart}DevForum post here{removingLegacyChatEnd} on how to transition to TextChatService. (Early 2025){listItemEnd}{listItemStart}{boldStart}Sunsetting support for Windows 7 and 8.1{boldEnd} - We are sunsetting support for Windows 7 and 8.1 in Studio in Early 2025. This means, in order to use Roblox Studio, you’ll need to upgrade to Windows 10 or higher. This is following a recent update to the Roblox app, where we announced with an in-app warning that we will remove support for Windows 7 and Windows 8.1 for the Roblox app by January 15, 2025. We’ll also be adding a similar warning to Studio and we’ll keep you updated on when support will be effectively discontinued. We will provide at least 30 days of notice prior to removing support. ({sunsettingStudioSupportLinkStart}Live{sunsettingStudioSupportLinkEnd}){listItemEnd}{listItemStart}{boldStart}Simplified appeals process{boldEnd} - Appeals migration from Zendesk to Toolbox. (Mid 2025){listItemEnd}{listEnd}"
}